{
  "62": "Lucas opens a bank account with 1000 and lets it accumulate at an annual nominal interest rate of 6% convertible semiannually. Danielle also opens a bank account with 1000 at the same time as Lucas, but it grows at an annual nominal interest rate of 3% convertible monthly.   For each account, interest is credited only at the end of each interest conversion period.  Calculate the number of months required for the amount in Lucas’s account to be at least double the amount in Danielle’s account.  (A) 276",
  "102": "Rhonda purchases a perpetuity providing a payment of 1 at the beginning of each year. The perpetuity’s Macaulay duration is 30 years.   Calculate the modified duration of this perpetuity.   (A) 28.97",
  "216": "An investor pays 962.92 for a ten-year bond with an annual coupon rate of 8% paid semiannually. The annual nominal yield rate is 10% convertible semiannually.  Calculate the discount of this purchase.  (A) 117",
  "258": "Bond A is a 15-year 1000 face amount bond with an annual coupon rate of 9% paid semiannually. Bond A will be redeemed at 1200 and is bought to yield 8.4% convertible semiannually.   Bond B is an n-year 1000 face amount bond with an annual coupon rate of 8% paid quarterly. Bond B will be redeemed at 1376.69 and is bought to yield 8.4% convertible quarterly.   The two bonds have the same purchase price.  Calculate n.  (A) 12",
  "296": "On the first of the month, Chuck took out a business loan for 50,000, with payments at the end of each month based on an annual nominal interest rate compounded monthly.  Each monthly payment is equal to 800, except for a final drop payment.    Immediately after the first payment the balance owed was 49,800.  Calculate the number of payments that Chuck needed to pay off the loan.  (A) 115",
  "302": "Susan receives annual payments from a 20-year annuity-immediate.  The payment in year 1 is 100 and in each succeeding year the payment is 90% of the prior year’s payment.  Upon receipt of each payment, Susan invests the payment in a savings account earning interest at a 3% annual effective rate.   Calculate the balance in the savings account immediately after Susan invests the last annuity payment.  (A)   696",
  "414": "At the beginning of the year, an entrepreneur deposited money into a savings account.  At the end of the year, the entrepreneur had earned a total of 400 in interest and had an account balance of 8000.  Determine which annual quantity exactly equals 5%.  (A) Nominal discount rate",
  "423": "Bond A pays 1 at the end of each year in perpetuity.  Bond B is a zero coupon bond that matures in ten years.  The Macaulay duration of bond A is twice that of bond B.   Calculate the modified duration of bond A.   (A) 19.0"
}