{
  "2": "Kathryn deposits 100 into an account at the beginning of each 4-year period for 40 years. The account credits interest at an annual effective interest rate of i .",
  "4": "A perpetuity costs 77.1 and makes end -of-year payments. The  perpetuity pays 1 at the end of",
  "6": "A 20 -year loan of 1000 is repaid with payments at the end of each year.",
  "8": "A perpetuity-immediate pays 100 per year. Immediately after the fifth payment, the  perpetuity is",
  "10": "Ernie makes deposits of 100 at time 0, and X  at time 3.  The fund grows at a force of interest",
  "12": "A 10 -year loan of 2000 is to be repaid with payments at the end of each year.  It can be repaid",
  "14": "To accumulate 8000 at the end of 3n years, deposits of 98 are made at the end of each of the first n years and 196 at the end of each of the next 2n years.",
  "16": "David can receive one of the following two payment streams:",
  "18": "You have decided to invest in Bond X, an n-year bond with semi-annual coupons and the following characteristics:",
  "20": "A perpetuity- immediate pays X per year.  Brian receives the first n payments, Colleen receives",
  "22": "Bruce and Robbie each open up new bank accounts at t ime 0.  Bruce deposits 100 into his bank",
  "24": "At an annual effective interest rate of i , i > 0%, the present value of a perpetuity paying 10 at the",
  "26": "An insurance company has an obligation to pay the medical costs for a claimant. A nnual claim",
  "28": "You are given the following information with respect to a bond:",
  "30": "The current price of an annual coupon bond is 100. The yield to maturity is an annual effective rate of 8%. The derivative of the price of the bond with respect to the yield to maturity is -700.",
  "32": "A common stock pays dividends at the end of each year into perpetuity. Assume that the dividend increases by 2% each year .",
  "34": "Bill buys a 10-year 1000 par value bond with semi-annual coupons paid at an annual rate of 6% .",
  "36": "Happy and financially astute parents decide at the birth of their daughter that they will need to provide 50,000 at each of their daughter’s 18",
  "38": "Joe must pa y liabilities of 2 000 due one year  from now and another 1000 due two  year s from",
  "40": "Matt purchased a 20 -year par value bond with an annual nominal coupon rate of 8% payable",
  "42": "Sue purchased a 10-year par value bond with an annual nominal coupon rate of 4% payable semiannually at a price of 1021.50. The bond can be called at par value X  on any coupon date",
  "44": "A liability consists of a series of 15 annual payments of 35,000 with the first payment to be made one year from now.  The assets available to immunize this liability are five -year and ten -year zero -coupon bonds.",
  "46": "The annual force of interest credited to a savings account is defined by",
  "56": "Aakash has a liability of 6000 due in four years. This liability will be met with payments of A  in",
  "60": "A borrower takes out a 15-year loan for 400,000, with level end-of-month payments, at an annual nominal interest rate of 9% convertible monthly.  Immediately after the 36th payment, the borrower decides to refinance the loan at an annual nominal interest rate of j , convertible monthly. The remaining term of the loan is kept at twelve",
  "62": "Lucas opens a bank account with 1000 and lets it accumulate at an annual nominal interest rate of 6% convertible semiannually. Danielle also opens a bank account with 1000 at the same time as Lucas, but it grows at an annual nominal interest rate of 3% convertible monthly.   For each account, interest is credited only at the end of each interest conversion period.  Calculate the number of months required for the amount in Lucas’s account to be at least double the amount in Danielle’s account.  (A) 276",
  "64": "A borrower takes out a 50- year loan, to be repaid with payments at the end of each year.  The",
  "66": "The present value of a perpetuity paying 1 every two years with first payment due immediately is 7.21 at an annual effective rate of i .",
  "68": "An investor wishes to accumulate 5000 in a fund at the end of 15 years. To accomplish  this, she",
  "70": "College tuition is 6000 for the current school year, payable in full at the beginning of the school year.  College tuition will grow at an annual rate of 5%. A parent sets up a college savings fund",
  "72": "An investor purchases a 10-year callable bond with face amount of 1000 for price P . The bond",
  "74": "Seth has two retirement benefit options.",
  "76": "Let S be the accumulated value of 1000 invested for two years at a nominal annual rate of discount d convertible semiannually, which is equivalent to an annual effective interest rate of i .",
  "78": "Five deposits of 100 are made into a fund at two- year intervals with the first deposit at the",
  "80": "Jack inherited a perpetuity -due, with annual payments of 15,000. He immediately  exchanged the",
  "82": "A 30 -year annuity is arranged to pay off a loan taken out today at a 5% annual effective interest",
  "84": "An insurance company purchases a perpetuity-due providing a geometric series of quarterly payments for a price of 100,000 based on an annual effective interest rate of i . The first and",
  "86": "A bank agrees to lend 10,000 now and X  three years from now in exchange for a single",
  "88": "Tim takes out an n-year loan with equal annual payments at the end of each year.",
  "90": "A 5-year loan of 500,000 with an annual effective discount rate of 8% is to be repaid by level",
  "92": "A loan of X  is repaid with level annual payments at the end of each year for 10 years.",
  "94": "Jeff has 8000 and would like to purchase a 10,000 bond. In doing so, Jeff takes out a 10 year",
  "96": "An investor owns a bond that is redeemable for 250 in 6 years from now. The investor has just received a coupon of c and each subsequent semiannual coupon will be 2% larger than the",
  "98": "An n-year bond with semiannual coupons has the following characteristics:",
  "100": "Annuity A pays 1 at the beginning of each year for three years.  Annuity B pays 1 at the",
  "102": "Rhonda purchases a perpetuity providing a payment of 1 at the beginning of each year. The perpetuity’s Macaulay duration is 30 years.   Calculate the modified duration of this perpetuity.   (A) 28.97",
  "104": "A company owes 500 and 1000 to be paid at the end of year one and year four, respectively. The company will set up an investment program to match the duration and the present value of the above obligation using an annual effective interest rate of 10%.   The investment program produces asset cash flows of X  today and Y  in three years.",
  "106": "A company has liabilities of 573 due at the end of year 2 and 701 due at the end of year 5.  A portfolio comprises two zero-coupon bonds, Bond A and Bond B.  Determine which portfolio produces a Redington immunization of the liabilities using an annual effective interest rate of 7.0%.",
  "108": "You are given the following information about a company's liabilities:",
  "111": "Martha leaves an estate of 500,000.  Interest on this estate is paid to John for the first X  years at",
  "113": "Which of the following is an expression for the present value of a perpetuity with annual payments of 1, 2, 3, …, where the first payment will be made at the end of n years, using an",
  "115": "For a given interest rate i  > 0, the present value of a 20-year continuous annuity of one dollar per",
  "117": "At an annual effective interest rate of 10.9%, each of the following are equal to X :",
  "119": "A perpetuity-due with semi-annual payments consists of two level payments of 300, followed by a series of increasing payments.  Beginning with the third payment, each payment is 200 larger",
  "121": "A company is considering investing in a particular project. The project requires an investment of X today. Additional investments are required at the beginning of each of the next five years, with",
  "123": "A family purchases a perpetuity-immediate that provides annual payments that decrease by 0.4% each year.  The price of the perpetuity is 10,000 at an annual force of interest of 0.06.",
  "126": "A borrower takes out a loan of 4000 at an annual effective interest rate of 6%.  Starting at the end of the fifth year, the loan is repaid by annual payments, each of which equals 600 except for a final balloon payment that is less than 1000.  Calculate the final balloon payment.",
  "128": "A 16 -year loan of L  is repaid with a payment at the end of each year.  During the first eight years,",
  "130": "A student borrows money to pay for university tuition. He borrows 1000 at the end of each month for four years. No payments are made to repay the loan until the end of five years.  The loan accumulates interest at a 6% nominal interest rate convertible monthly for the first two years and at an 8% nominal interest rate convertible monthly for the following two years.  Calculate the loan balance at the end of four years immediately following the receipt of the final 1000.  (A) 54,098",
  "132": "Seth repays a 30 -year lo an with a payment at the end of each year.  Each of the first  20 payments",
  "134": "A 25 -year loan is being repaid with annual payments of 1300 at an annual effective rate of",
  "136": "Bond X is a 20-year bond with annual coupons and the following characteristics:",
  "138": "You are given the following information about a 20-year bond with face amount 7500:",
  "140": "You are given the following information about a 20-year bond with face amount 1000:",
  "142": "You are given the following information about an n-year bond, where n > 10:",
  "144": "An investor buys a perpetuity-immediate providing annual payments of 1, with an annual effective interest rate of i  and Macaulay duration of 17.6 years.",
  "146": "A 20 -year bond priced to have an annual effective yield of 10% has a Macaulay duration of 11.",
  "148": "A company has liabilities that require it to make payments of 1000 at the end of each of the next five years.  The only investments available to the company are as follows:",
  "150": "A company must pay liabilities of 1000 at the end of year 1 and X  at the end of year 2.",
  "152": "A 20 -year bond priced to have an annual effective yield of 10% has a Macaulay duration of 11.",
  "158": "Two 15-year par value bonds, X and Y, each pay an annual coupon of 200 at the end of the year. The face amount of Bond X is one-half the face amount of Bond Y.  At an annual effective yield of i , the price of Bond X is 2695.39 and the price of Bond Y is",
  "160": "A 20 -year arithmetically increasing annuity -due sells for 600,000 and provides annual payments.",
  "162": "Trish had a loan with a balance of 4000 at the beginning of month 1. Starting with month 1, and every month thereafter, she made a payment of X  in the middle of the month. At the beginning of",
  "164": "An annuity provides level payments of 1000 every six months for a fixed period.   Using an annual effective interest rate of i , the future value of this annuity at the time of the last",
  "166": "An investor deposits 100 into a bank account at time 0. The bank credits interest at an annual nominal interest rate of i , compounded semi-annually.",
  "168": "A borrower takes out a 15- year loan at an annual effective interest rate of i  with payments of 50",
  "170": "Fund J begins with a balance of 20,000 and earns an annual effective rate of 6.5%. At the end of each year, the interest earned and an additional 1000 is withdrawn from the fund so that by the end of the 20th year, the fund is depleted.  The annual withdrawals of interest and principal are deposited into Fund K, which earns an annual effective rate of 8.25%.  At the end of the 20",
  "172": "Fund X receives a deposit of 1000 at time 0 . Fund X accumulates at a nominal rate of interest k ,",
  "174": "The present value of a perpetuity- immediate with a first payment of P  and successive annual",
  "176": "A two -year loan of 100 is repaid with a payment of X  at the end of the first year and 2 X at the",
  "178": "An investor will accumulate 10,000 at the end of ten years by making level deposits of X at the beginning of each year. The deposits earn 12% simple interest at the end of every year but the interest is reinvested at an annual effective rate of 8%.",
  "180": "A company is considering a project that will require an initial investment of 600 and additional investments of 100 and 50 at the end of years one and two, respectively. It is expected that",
  "182": "Four annual tuition payments of 25,000 are to be paid at a future date.  The payments will be funded by investing 1000 at the beginning of each month. The last deposit will be made six months before the first tuition payment.  Interest is payable at a nominal interest",
  "184": "A company has liabilities of 402.11 due at the end of each of the next three years.  The company will match the duration of its liabilities by investing a total of 1000 in one-year and three- year zero -coupon bonds. The annual effective yield of both bonds is 10%.",
  "187": "A mortgage for 125,000 has level payments at the end of each month and an annual nominal",
  "189": "A bond with a face value of 1000 and a redemption value of 1080 has an annual coupon rate of 8% payable semiannually. The bond is bought to yield an annual nominal rate of 10% convertible semiannually.  At this yield rate, the present value of the redemption value is 601 on the purchase date.  Calculate the purchase price of the bond.  (A) 911",
  "191": "A five -year loan has  an annual nominal interest rate of 30%, convertible monthly. The loan is",
  "193": "An institute has provided an early retirement incentive package to a 60- year-old retiree that pays",
  "195": "A company’s preferred stock will pay level annual dividends forever starting five years from now.   Using an annual effective interest rate of 10%, the modified duration of the stock is D .",
  "197": "Three asset -liability cash flows are given in the following table where a positive amount is an",
  "199": "Determine which of the following statements regarding the Redington immunization technique is false.",
  "201": "You are given the following information about a perpetuity with annual payments:  i) The first 15 payments are each 2500, with the first payment to be made three years from",
  "203": "A loan for 10,000 is to be repaid by level annual payments at the end of each year for ten years.",
  "205": "A company is required to pay 190,000 in 20.5 years. The company creates an investment portfolio using three bonds with annual coupons, so that its position is Redington immunized based on an annual effective interest rate of 7%.  The table below shows the Macaulay duration",
  "207": "An investor deposited 1000 in each of Bank X and Bank Y. Bank X credits simple interest at an annual rate of 10% for the first five years and 7% thereafter.  Bank Y credits interest at an annual",
  "209": "Sam deposits 5000 at the beginning of each year for ten years. The deposits earn an annual effective interest rate of i . All interest is reinvested at an annual effective interest rate of  5%.",
  "211": "A worker is starting an endowment fund for his charity. The fund will accumulate at a nominal annual interest rate of 12% convertible monthly. Beginning today, the worker will deposit 500 monthly for ten years. No deposits or withdrawals will be made for the subsequent ten years. Exactly twenty years from today, monthly payments of X  will be made to his charity and",
  "212": "Payments of 1000 at the end of each year are paid on a loan of 12,000. The payments are based on an annual effective interest rate of 10%.  Calculate the outstanding loan balance immediately after the 12",
  "214": "Matthew deposits 100 into Fund X, which earns a nominal annual rate of discount of 12% convertible quarterly.  At the same time, Sarah deposits 200 into Fund Y, which earns a constant annual force of",
  "216": "An investor pays 962.92 for a ten-year bond with an annual coupon rate of 8% paid semiannually. The annual nominal yield rate is 10% convertible semiannually.  Calculate the discount of this purchase.  (A) 117",
  "218": "A 25 -year loan is being repaid with payments of 1300 at the end of each year. The loan payments",
  "220": "A bank lends 100,000 to Sam . The loan is repaid with level payments at the end of each year for",
  "222": "You are given the following term structure of interest rates:",
  "224": "A company has liabilities of 1000 due at the end of each of the next three years. The company will exactly match the cash flows of assets and liabilities.  The following zero-coupon bonds are",
  "226": "The price of a 36 -year zero -coupon bond is 80% of its face value.",
  "228": "An insurer has a liability that is expected to result in the following cash outflows.    End of year   Cash Outflow",
  "229": "A company created a portfolio in order to protect its position using Redington immunization.  Under which of the following changes in the yield rate is the immunization strategy guaranteed to be effective?",
  "231": "Two borrowers obtain loans at the same time. Each loan is for the same amount and is repaid with level end -of month payments.",
  "233": "An investor’s new savings account earns an annual effective interest rate of 3% for each of the first ten years and an annual effective interest rate of 2% for each year thereafter.",
  "235": "You are given the following information about Bond X and Bond Y:  i) Both bonds are 20-year bonds.",
  "237": "An annuity writer sells an annual perpetuity-immediate for 16,000. The first payment is 1,000 and the payments decrease by r % each year.",
  "238": "A perpetuity makes payments every five years with a first payment of 2 to be paid five years from now.  Each subsequent payment is 10 more than the previous payment. The annual effective interest rate is 9%.",
  "240": "You are given the following information about a fully immunized portfolio:  i) The liability is a single payment of 600,000 due in two years.",
  "241": "An investor pays 4000 today for a three-year investment that returns cash flows of 1400 at the end of each year. The cash flows can be reinvested at the positive annual effective interest rate of",
  "243": "A 15 -year loan of 60,000 is to be repaid with payments of X  at the end of each month based on",
  "244": "Greg buys a 20-year increasing annuity- immediate with annual payments.  The first payment is",
  "246": "A loan of X  is repaid with level payments of R  payable at the end of each year  for n years.",
  "248": "Kate buys a five-year 1000 face amount bond today with a 100 discount. The annual nominal coupon rate is 5% convertible semiannually.  One year later, Wallace buys a four -year bond. It has the same face amount and coupon values as",
  "250": "A homeowner borrows 1000 to be repaid with payments at the end of each year for 20 years. There are two repayment options. The first option is equal annual payments based on an annual effective interest rate of 3%.  The second option is payments of 50 each year plus interest on the",
  "251": "A debt is amortized with 120 level payments at the end of each month based on an annual effective interest rate of 8%.  The amount of principal in the sixth payment is 600.",
  "253": "You have the option of purchasing one of the following two annuities- immediate:",
  "255": "Erin borrows X  at an annual effective rate of 5%.  If the  principal and all accumulated interest is",
  "256": "A 20 -year loan of 500 based on a 5% annual effective interest rate is repaid with level",
  "258": "Bond A is a 15-year 1000 face amount bond with an annual coupon rate of 9% paid semiannually. Bond A will be redeemed at 1200 and is bought to yield 8.4% convertible semiannually.   Bond B is an n-year 1000 face amount bond with an annual coupon rate of 8% paid quarterly. Bond B will be redeemed at 1376.69 and is bought to yield 8.4% convertible quarterly.   The two bonds have the same purchase price.  Calculate n.  (A) 12",
  "260": "The table below defines available zero -coupon bonds and their prices:",
  "262": "The first payment of a five-year annuity is due in five years in the amount of 1000. The subsequent four annual payments increase by 500 each year. The annual effective interest rate is i.",
  "264": "A ten -year bond paying annual coupons of X  has a face amount of 1000, a price of 450, and an",
  "267": "A borrower planned to repay a loan of L  with level payments at the end of each month for 30",
  "269": "A three-year bond with face amount X  and a coupon of 4 paid at the end of every six months is",
  "270": "Prosperity Insurance sells a two -year annuity with equal payments at the end of each year.  The",
  "272": "A 100,000 loan has  an annual nominal interest rate of 8% convertible quarterly. The loan will be",
  "274": "An insurance company has liabilities due at the end of each of the next two years.  The liability due",
  "276": "A perpetuity-immediate pays 20 for 10 years, decreases by 1 per year for 19 years, and then pays 1 per year thereafter.  At an annual effective interest rate of 6%, the present value is equal to X .",
  "277": "An actuary’s child will be going to college 15 years from now. To save for the estimated cost of 2000, the actuary makes deposits into a fund at the end of each year for the next 15 years. The first deposit is X . Each subsequent deposit is 3% larger than the previous deposit.",
  "279": "A debt is amortized with 60 equal monthly payments at an annual effective interest rate of 12%. The amount of principal in the third payment is 900.  Calculate the amount of principal in the 33rd payment.  (A)   668",
  "281": "A 1000 par value ten-year bond with 7.6% semiannual coupons is bought to yield 6.0% convertible semiannually.  Calculate the book value of the bond at the end of year six immediately after the coupon payment.  (A) 1054",
  "282": "A loan of amount",
  "284": "A ten -year certificate of deposit pays an annual effective interest rate of 8%. If the balance is",
  "286": "A perpetuity pays 1 at the beginning of each three-month period.  Another perpetuity pays X at the beginning of each four-year period.  Using an annual effective interest rate of i , each",
  "287": "A loan with an annual nominal interest rate of 9%, convertible monthly, is repaid with 60 monthly payments.  The first payment is 1000 and each succeeding payment is 2% less than the previous payment.  Calculate the outstanding loan balance immediately after the 40",
  "289": "A loan of1500 is to be repaid with payments made at the end of each year for 20 years.  There are two repayment options:     i) equal payments at an annual effective interest rate of 5%",
  "291": "An investor deposits 150 today and receives 100 one year from now and 80 two years from now.  Calculate the annual nominal rate of interest convertible quarterly that the investor earns.",
  "292": "An investor purchases a 30-year bond with a face amount of 1000 and annual coupon rate of 8% paid semi -annually.  The bond is callable at its face value any time following the coupon",
  "294": "The current yield rates for zero -coupon bonds are as follows:",
  "296": "On the first of the month, Chuck took out a business loan for 50,000, with payments at the end of each month based on an annual nominal interest rate compounded monthly.  Each monthly payment is equal to 800, except for a final drop payment.    Immediately after the first payment the balance owed was 49,800.  Calculate the number of payments that Chuck needed to pay off the loan.  (A) 115",
  "298": "An annual perpetuity pays 1 one year from now.  Payments will then increase by 4% per year for",
  "299": "An insurance company has a liability of 2662 that is due at the end of three years.  The present value of this liability is 2000.  There are two investments available: a one- year zero -coupon bond",
  "301": "A ten -year 100 face amount bond has an annual coupon rate of 8% payable semiannually. The",
  "302": "Susan receives annual payments from a 20-year annuity-immediate.  The payment in year 1 is 100 and in each succeeding year the payment is 90% of the prior year’s payment.  Upon receipt of each payment, Susan invests the payment in a savings account earning interest at a 3% annual effective rate.   Calculate the balance in the savings account immediately after Susan invests the last annuity payment.  (A)   696",
  "304": "An insurance company has a liability of 750,000 due four years from now.  To protect against",
  "306": "You are given the following information regarding Company J.",
  "308": "A construction firm is facing three liabilities of 1000, due at the end of each of the periods 1, 2, and 3.  There are three bonds available to match these liabilities, as follows:",
  "310": "An insurance company purchases a perpetuity-due at an annual effective yield rate of 12.5% for 9450.  The perpetuity provides annual payments according to the repeating three- year pattern",
  "312": "Deposits of 100 are made to an account today and one year from today.  The annual force of interest at time t  in years for this account is:",
  "314": "A student takes out a loan for 30,000.  The annual nominal interest rate is 9%, convertible semiannually.  The student pays off the loan in five years with monthly payments beginning one month from today.  The first payment is 500, and each subsequent payment is X  more than the previous",
  "316": "A perpetuity- immediate with annual payments consists of ten level payments of k , followed by a",
  "318": "A ten -year bond with a face amount of 1000, a redemption value of C , and an annual coupon rate",
  "320": "An investor purchases two bonds having the same positive annual effective yield rate.    With respect to the annual effective yield rate, their modified durations are a years and b years,",
  "322": "A payment of 7 is deposited into an account at the end of each year for 45 years.  The account earns  an annual effective interest rate of i .",
  "323": "A loan of 20,000 is to be repaid with payments at the end of each year for ten years.   The  first",
  "325": "An investor buys a one-year bond with a face amount of 100 and an annual coupon rate of 6% paid semiannually.  The bond is purchased at a discount of 1.50 to yield an annual nominal rate of j convertible semiannually.  Calculate j.",
  "326": "A 20-year bond with 8% annual coupons is purchased at a price of P .  The face amount of the",
  "328": "A customer has the option to either buy a car for cash for 15,000 or lease it with a down payment of 1000 and monthly payments of X  payable at the end of each month for three years.",
  "330": "At time",
  "332": "An investor wants to accumulate 150,000 to purchase a business in ten years.  The investor",
  "334": "Today’s deposit of 9550 earns an annual effective interest rate of i  for five years.  At the end of",
  "335": "A zero -coupon bond with a face value of 1000 sells for a price of 600 and matures in n years,",
  "337": "A purchase of 5020 is paid off with a loan at an annual effective interest rate of 6.25%.  Payments are made at the end of each year until the loan is paid off.  Each payment is 360 except for a final balloon payment, which is less than 720.    Calculate the amount of the balloon payment.   (A) 611",
  "338": "A company is required to pay",
  "340": "A 15-year bond with semiannual coupons is purchased for 2895.28.  The bond is redeemable for 1000.  The first coupon payment is equal to R  and each subsequent coupon is 1% larger than the",
  "341": "An annuity writer sells an annual perpetuity-due, with a first payment of 3000.  The payments increase by 7% annually.  The purchase price, P , of the perpetuity is based on a 12% annual force of interest.",
  "343": "A five -year interest -only loan in the amount of 10,000 has  annual payments, and  an annual",
  "345": "An n-year bond with an annual coupon rate of r  % has the following characteristics:",
  "347": "A store purchased couch #1 for X  two months ago and plans to sell it for 1500 six months from",
  "349": "The annual force of interest is",
  "350": "A portfolio consists of two bonds.  Bond A is a three-year 1000 face amount bond with an annual coupon rate of 6% paid annually.  Bond B is a one- year zero -coupon bond.  Both bonds yield an",
  "352": "A zero -coupon bond with a face amount of 1000 sells for a price of 640 and matures in n years,",
  "353": "A bond is priced at 950, giving an annual effective yield to maturity of 9%.  At 9%, the derivative of the price of the bond with respect to the yield rate is",
  "355": "An individual is to receive 1,000,000 today and 1,000,000 five years from today.   These payments are to be converted to an increasing annual perpetuity, with the first payment, X ,",
  "357": "An annuity has payments of 1000 at the beginning of every three months for six years.  Another annuity has payments of X at the end of the first, third, and fifth years.",
  "359": "A perpetuity pays X  at the end of the third year, 2 X at the end of the sixth year, 3X  at the end of",
  "361": "A level monthly contribution of X  is required to purchase an annual perpetuity of 5000 that",
  "363": "An investor deposits 1000 at the beginning of each year for five years in a fund earning a 5% annual effective interest rate.  The interest from this fund can be reinvested at a 4% annual effective interest rate.",
  "364": "Consider an amortization schedule for a loan at interest rate i  per period, i  > 0, being repaid with",
  "368": "Harry borrows 10,000 from Sally and agrees to repay the five- year loan with equal payments at",
  "370": "5000 is borrowed at an annual nominal rate of interest of j  convertible monthly.  The loan is",
  "372": "A five -year 1000 face amount bond with  10% annual coupons is purchased at time of issue for",
  "374": "A car dealership offers a 120 -month loan for a blue car costing 30,000, with an annual nominal",
  "375": "Two bonds have the same annual effective yield rate, r , where r  > 0.  The bonds have Macaulay",
  "377": "A bank offers a loan to each of two borrowers with different credit scores.  Both loans are for the same amount.    The first borrower is charged a monthly effective interest rate of 1% and makes level end -of-",
  "379": "An investor deposits 50,000 into a new savings account, which earns an annual effective discount rate of 3.2%.  The investor then withdraws an amount X  at the end of every two -year",
  "381": "You have decided to invest in a newly issued 20-year bond with annual coupons and the following characteristics:",
  "383": "A company's liabilities are 20,000 today and 100,000 five years from today.  The Macaulay duration of the company's liabilities with respect to the market annual effective yield rate is 3.70 years.",
  "385": "A three-year 1000 face amount bond pays coupons of X  quarterly.  It is bought at a price to yield",
  "386": "An annuity has the first monthly payment of 750 occurring in five years.  Each payment thereafter is 1.0% greater than the preceding payment.  The final payment occurs exactly 15 years after the first payment.   The annuity has a present value of P  based on an annual nominal interest rate of 7.2%",
  "388": "A restaurant owner takes out a 120-month loan of 10,000 today.  To  pay off the loan, the owner",
  "390": "Company ABC is considering the following three investments:",
  "392": "Payments of 200 are invested at the beginning of each year for five years.  The payments earn interest at an annual effective interest rate of i.   The interest is reinvested at the end of each year",
  "394": "Given a force of interest",
  "395": "At an annual effective interest rate of 5%, the present value of an increasing perpetuity-due with annual payments of 1, 2, 3, etc., is equal to X .",
  "397": "An annuity-immediate has quarterly payments of 100, 200, 300, and 400 each year for ten years. At a nominal annual rate of 12% convertible quarterly, the present value of the annuity is P .",
  "398": "A perpetuity-immediate has annual payments starting at 1, increasing by 1 each year until it reaches 10, then decreasing by 1 each year until it reaches 5, and remaining at  5 thereafter.",
  "400": "A ten -year loan of 1000 is repaid by level payments at the end of each month at an annual",
  "401": "An investor borrows 13,650 at an annual effective interest rate of 7%.  Level payments are made at the end of each year.  The interest paid in the last payment is 65.42.  Calculate the principal repaid in the first payment.",
  "403": "At the beginning of a year, Rachael invests 10,000 in Fund X earning an annual nominal interest rate of 9% convertible quarterly.    At the end of the year and each successive year, she withdraws the accumulated interest from Fund X and reinvests it into Fund Y, earning an annual effective interest rate of i .",
  "405": "A borrower plans to repay a loan of 12,000 with payments to be made at the end of each month for five  years.  The loan payments are based on an annual nominal interest rate of 12%,",
  "407": "A person borrows 150,000 to purchase a house.  The borrower makes interest-only payments at the end of each month for five years, then makes payments of 1000 at the end of each month.  Interest accrues at a nominal annual rate of 4% convertible monthly for the first five years and then at a nominal annual rate of 6% convertible monthly.  Determine the total number of payments it will take to repay the loan.",
  "409": "A ten -year mortgage is to be repaid with annual level payments at the end of the year.  The",
  "410": "A student invested a math competition prize into a savings account.  The account receives interest quarterly, and the account balance increases by 4.5% each year.  Determine the correct term that the 4.5% figure represents.",
  "412": "A two -year annuity-immediate with level annual payments has a Macaulay duration of D  using a",
  "414": "At the beginning of the year, an entrepreneur deposited money into a savings account.  At the end of the year, the entrepreneur had earned a total of 400 in interest and had an account balance of 8000.  Determine which annual quantity exactly equals 5%.  (A) Nominal discount rate",
  "416": "Bond A and bond B are both annual-coupon bonds.    Bond A is an m -year bond with face amount 1000 and price 800, where m  is a whole number.",
  "418": "A credit card charges an annual continuously compounded interest rate of 18%, plus a fee of 20 at the end of each year.  These fees accrue interest once they are charged.",
  "420": "A perpetuity-due with annual payments is priced at X  based on an annual effective interest rate of",
  "421": "A 15-year bond is purchased at a premium.  The bond has an annual effective yield rate of 7.4% and pays semi-annual coupons.  Determine which of the following statements about this bond must be true.  (A) The face amount is greater than the purchase price.",
  "423": "Bond A pays 1 at the end of each year in perpetuity.  Bond B is a zero coupon bond that matures in ten years.  The Macaulay duration of bond A is twice that of bond B.   Calculate the modified duration of bond A.   (A) 19.0",
  "425": "A company has liabilities of 1000 and 750 due at the end of years two and four, respectively.  The company creates an investment portfolio that produces asset cash flows of X  immediately",
  "426": "Company XYZ has a liability of 10,000 due in nine months.  To pay this liability, they have an asset portfolio generating cash flows of X  in six months and Y  in one year.  The portfolio is",
  "428": "You are given the following information regarding two perpetuities:",
  "430": "A zero -coupon 1000 face amount bond sells for a price of 890 and matures in n years, where n is",
  "431": "A ten -year 1000 face amount bond has an annual coupon rate of 6% paid semiannually.  The",
  "433": "Interest on a 20- year loan is charged based on an annual effective rate of 10.1%.",
  "435": "A 20 -year 1000 face amount bond has an annual coupon rate of 6%, payable semiannually.",
  "437": "Kelly purchases a 25 -year annual coupon bond for 20,000 with an annual effective yield rate of  i.",
  "439": "Wendy borrows 20,000 based on an annual effective interest rate of 8% and agrees to repay the loan with level end -of-year payments for 40 years.  Immediately after the 20",
  "441": "At Jack’s death, his estate of 298,000 is to be divided between Charity A and Charity B.    Charity A will receive 198,000 and use it to purchase a perpetuity- due that makes a payment of",
  "443": "Kelly sets up a savings account and makes a deposit at the beginning of each month starting today.  The following information is known about the account:",
  "445": "An investor owns two bonds, Bond 1 and Bond 2.  At today’s annual effective interest rate, the bonds have the following characteristics:",
  "447": "A perpetuity- immediate with level annual payments of  k has a Macaulay duration of 32.25 years",
  "448": "A twelve -year 2500 face amount bond has an annual coupon rate of 4.84% paid quarterly and is",
  "450": "An electric company faces liabilities with present values 24,000 and 1,000, due 7.5 years from now and 20 years from now, respectively.",
  "452": "An investment project involves an outlay of 30 at time 0 and 40 at time 1, where time is measured in years.  In return the investor will receive 60 at time 2 and 90 at time",
  "453": "Kelly purchases a 25 -year annual coupon bond for 20,000 with an annual effective yield rate of  i.",
  "455": "Bond X, Bond Y, and Bond Z are each n -year bonds with face amount 1000.  All three bonds are",
  "457": "An n-year 100 face amount bond has an annual coupon rate of r  paid semiannually.  The price of",
  "458": "Investment A provides cash flows of 1000, 3000, and X  at the end of years two, three, and five,",
  "460": "A geometric perpetuity -immediate provides annual payments.  The first payment is 1, and each",
  "462": "Wilma takes out a loan of 5,000,000 to start a new business.  She will repay the loan with level semiannual payments of 303,244.53, with the first payment due in six months.    The loan payments are based on an annual nominal interest rate of 6.5% convertible semiannually.  Immediately after the tenth payment, the outstanding loan balance is X ."
}