{
  "1": {
    "content": "Bruce deposits 100 into a bank account. His account is credited interest at a n annual nominal rate \nof interest of 4% convertible semiannually.  At the same time, Peter deposits 100 into a separate account.  Peter’s account is credited interest \nat an annual force of interest of \nδ. \n After 7.25 years, the value of each account is the same.  \nCalculate \nδ. \n \n(A) 0.0388 \n(B) 0.0392 \n(C) 0.0396 \n(D) 0.0404 \n(E) 0.0414 \n  2. Kathryn deposits 100 into an account at the beginning of each 4-year period for 40 years. The account credits interest at an annual effective interest rate of i . \n The accumulated amount in the account at the end of 40 years is X , which is 5 times the \naccumulated amount in the account at the end of 20 years.  Calculate X .  \n (A) 4695 \n(B) 5070 (C) 5445 (D) 5820",
    "page_number": "2"
  },
  "3": {
    "content": "Eric deposits 100 into a savings account at time 0, which pays interest at a n annual  nominal rate \nof i, compounded semiannually. \n Mike deposits 200 into a different savings account at time 0, which pays simple interest at an annual rate of i . \n Eric and Mike earn the same amount of interest during the last 6 months of the 8\nth year.  \n Calculate i . \n (A) 9.06% \n(B) 9.26% (C) 9.46% (D) 9.66% \n(E) 9.86% \n  4. A perpetuity costs 77.1 and makes end -of-year payments. The  perpetuity pays 1 at the end of \nyear 2, 2 at the end of year 3, …., n at the end of  year (n+1). After year ( n+1), the payments \nremain constant at n. The annual effective interest rate is 10.5%.  Calculate n.  (A) 17 \n(B) 18 (C) 19 (D) 20",
    "page_number": "3"
  },
  "5": {
    "content": "1000 is deposited into Fund X, which earns an annual effective rate of 6%. At the end of each year, the interest earned plus an additional 100 is withdrawn from the fund. At the end of the tenth year, the fund is depleted.  The annual withdrawals of interest and principal are deposited into Fund Y, which earns an annual effective rate of 9%.  \n Calculate the accumulated value of Fund Y at the end of year 10.  (A) 1519 \n(B) 1819 (C) 2085 (D) 2273",
    "page_number": "4"
  },
  "6": {
    "content": "Company XYZ has a liability of 10,000 due in nine months.  To pay this liability, they have an asset portfolio generating cash flows of X  in six months and Y  in one year.  The portfolio is \nRedington immunized.   The annual effective interest rate is 2%.  \n Calculate X . \n (A) 4926 \n(B) 4975 (C) 5000 (D) 5025",
    "page_number": "42"
  },
  "7": {
    "content": "A 10,000 par value 10-year bond with 8% annual coupons is bought at a premium to yield an annual effective rate of 6%.  \n Calculate the interest portion of the 7th  coupon. \n (A) 632 \n(B) 642 (C) 651 (D) 660",
    "page_number": "5"
  },
  "8": {
    "content": "A company is required to pay \n50,000(1.075)y in y years.  The company invests 30,000 in a 28-\nyear zero -coupon bond and 20,000 in a 35 -year zero -coupon bond to Redington immunize its \nposition against small changes in interest rates, based on an annual effective interest rate of \n7.5%.  Calculate y . \n (A) 30.80 \n(B) 31.32 (C) 31.50 (D) 31.68 \n(E) 32.20 \n  \n164 339. \nYou are given the following information regarding Company J.  \ni) It has a single liability of 1,750,000 to be paid 12 years from now. \nii) Its asset portfolio consists of a zero-coupon bond maturing in 5 years for 242,180 and \na zero -coupon bond maturing in n years.  \niii) At an annual effective interest rate of 7%, Company J’s position is fully immunized. \n Calculate n.  (A) 13 \n(B) 14 (C) 15 (D) 16",
    "page_number": "33"
  },
  "9": {
    "content": "Jeff deposits 10 into a fund today and 20 fifteen years later. Interest for the first 10 years is \ncredited at a nominal discount rate of d compounded quarterly, and thereafter at a nominal interest rate of 6% compounded semiannually. The accumulated balance in the fund at the end of 30 years is 100.  Calculate d.  (A) 4.33% \n(B) 4.43% (C) 4.53% (D) 4.63% \n(E) 4.73% \n  10. Ernie makes deposits of 100 at time 0, and X  at time 3.  The fund grows at a force of interest \n2\n100ttδ= , t > 0.  \nThe amount of interest earned from time 3 to time 6 is also X . \n Calculate X . \n (A) 385 \n(B) 485 (C) 585 (D) 685",
    "page_number": "6"
  },
  "11": {
    "content": "Mike buys a perpetuity-immediate with varying annual payments. During the first 5 years, the payment is constant and equal to 10. Beginning in year 6, the payments start to increase. For year \n6 and all future years, the payment in that year is K% larger than the payment  in the year \nimmediately preceding that year, where K  < 9.2. \n At an annual effective interest rate of 9.2%, the perpetuity has a present value of 167.50.  Calculate K . \n (A) 4.0 \n(B) 4.2 (C) 4.4 (D) 4.6 \n(E) 4.8 \n  12. A 10 -year loan of 2000 is to be repaid with payments at the end of each year.  It can be repaid \nunder the following two options:  \n(i) Equal annual payments at an annual effective interest rate of 8.07%. (ii) Installments of 200 each year plus interest on the unpaid balance at an annual \neffective interest rate of i . \n The sum of the payments under option (i) equals the sum of the payments under option (ii).  \n Calculate i . \n (A) 8.75% \n(B) 9.00% (C) 9.25% (D) 9.50% \n(E) 9.75% \n8 13.  \nA loan is amortized over five years with monthly payments at an annual nominal interest rate of 9% compounded monthly. The first payment is 1000 and is to be paid one month from the date of the loan. Each succeeding monthly payment will be 2% lower than the prior payment.  Calculate the outstanding loan balance immediately after the 40\nth payment is made.  \n (A) 6750 \n(B) 6890 (C) 6940 (D) 7030",
    "page_number": "7"
  },
  "14": {
    "content": "To accumulate 8000 at the end of 3n years, deposits of 98 are made at the end of each of the first n years and 196 at the end of each of the next 2n years.  \n \nThe annual effective rate of interest is i . You are given \n(1 ) 2.0ni+= . \n \nCalculate i . \n (A) 11.25% \n(B) 11.75% (C) 12.25% (D) 12.75% \n(E) 13.25% \n \n9 15. \nOlga buys a 5-year increasing annuity for X .  \n Olga will receive 2 at the end of the first month, 4 at the end of the second month, and for each month thereafter the payment increases by 2.  The annual nominal interest rate is 9% convertible quarterly.  Calculate X . \n (A) 2680 \n(B) 2730 (C) 2780 (D) 2830",
    "page_number": null
  },
  "16": {
    "content": "David can receive one of the following two payment streams:  \n(i) 100 at time 0, 200 at time n years , and 300 at time 2n years  \n(ii) 600 at time 10 years  \n At an annual effective interest rate of i , the present values of the two streams are equal.  \n \nGiven  \n0.76nv= , calculate i . \n \n(A) 3.5% \n(B) 4.0% (C) 4.5% (D) 5.0% \n(E) 5.5% \n \n  \n10 17. \nPayments are made to an account at a continuous rate of (8 k + tk), where  0 10t≤≤ .  \nInterest is credited at a force of interest  1\n8ttδ=+. \nAfter time 10, the account is worth 20,000. \n Calculate k . \n (A) 111 \n(B) 116 (C) 121 (D) 126",
    "page_number": null
  },
  "18": {
    "content": "You have decided to invest in Bond X, an n-year bond with semi-annual coupons and the following characteristics:  \n(i) Par value is 1000. \n(ii) The ratio of the semi -annual coupon rate, r , to the desired semi -annual yield rate,  i, is \n1.03125. \n(iii) The present value of the redemption value is 381.50. \n \nGiven  \n(1 ) 0.5889ni−+= , calculate the price of bond X. \n \n(A) 1019 \n(B) 1029 (C) 1050 (D) 1055",
    "page_number": null
  },
  "19": {
    "content": "Project P requires an investment of 4000 today. The investment pays 2000 one year from today and 4000 two years from today.   Project Q requires an investment of X  two years from today. The investment pays 2000 today \nand 4000 one year from today.  The net present values of the two projects are equal at an annual effective interest rate of 10%.  \n Calculate X . \n (A) 5400 \n(B) 5420 (C) 5440 (D) 5460",
    "page_number": "11"
  },
  "20": {
    "content": "A perpetuity- immediate pays X per year.  Brian receives the first n payments, Colleen receives \nthe next n payments, and a charity receives the remaining payments. Brian's share of the present \nvalue of the original perpetuity is 40%, and the charity’s share is K .  \n \nCalculate K . \n (A) 24% \n(B) 28% (C) 32% (D) 36% \n(E) 40% \n   \n12 21. \nSeth, Janice, and Lori each borrow 5000 for five years at an annual nominal interest rate of 12%, compounded semi-annually.   Seth has interest accumulated over the five years and pays all the interest and principal in a lump sum at the end of five years.   Janice pays interest at the end of every six-month period as it accrues and the principal at the end of five years.   \n Lori repays her loan with 10 level payments at the end of every six-month period.   Calculate the total amount of interest paid on all three loans.  \n (A) 8718 \n(B) 8728 (C) 8738 (D) 8748",
    "page_number": null
  },
  "22": {
    "content": "Bruce and Robbie each open up new bank accounts at t ime 0.  Bruce deposits 100 into his bank \naccount, and Robbie deposits 50 into his. Each account earns the same annual effective interest rate. \n The amount of interest earned in Bruce's account during the 11th year is equal to X . The amount \nof interest earned in Robbie's account during the 17th year is also equal to X. \n Calculate X . \n (A) 28.00 \n(B) 31.30 (C) 34.60 (D) 36.70 \n(E) 38.90 \n \n  \n13 23. \nRon is repaying a loan with payments of 1 at the end of each year for n years.  The annual \neffective interest rate on the loan is i . The amount of interest paid in year t  plus the amount of \nprincipal repaid in year t  + 1 equals X .  \n Determine which of the following is equal to X . \n \n(A) \n1ntv\ni−\n+  \n(B) 1ntv\nd−\n+  \n(C) 1ntvi−+  \n(D) 1ntvd−+  \n(E) 1ntv−+  \n \n 24.   At an annual effective interest rate of i , i > 0%, the present value of a perpetuity paying 10 at the \nend of each 3-year period, with the first payment at the end of year 3, is 32.  At the same annual effective rate of i , the present value of a perpetuity paying 1 at the end of \neach 4 -month period, with first payment at the end of 4 months, is X . \n Calculate X . \n (A) 31.6 \n(B) 32.6 (C) 33.6 (D) 34.6 \n(E) 35.6 \n   \n14 25. \nAs of 12/31/2013, an insurance company has a known obligation to pay 1,000,000 on 12/31/2017. To fund this liability, the company immediately purchases 4 -year 5% annual coupon \nbonds totaling 822,703 of par value. The company anticipates reinvestment interest rates to remain constant at 5% through 12/31/2017. The maturity value of the bond equals the par value.   Consider two reinvestment interest rate movement scenarios effective 1/1/ 2014. Scenario A has \ninterest rates drop by 0.5%. Scenario B has interest rates increase by 0.5%.   Determine w hich of the following best describes the insurance company’s profit or (loss) as of \n12/31/2017 after the liability is paid .  \n (A) Scenario A – 6,610, Scenario B – 11,150 \n(B) Scenario A – (14,760), Scenario B – 14,420 \n(C) Scenario A – (18,910), Scenario B – 19,190 \n(D) Scenario  A – (1,310), Scenario B – 1,320 \n(E) Scenario A – 0, Scenario B – 0 \n  26. An insurance company has an obligation to pay the medical costs for a claimant. A nnual claim \ncosts today are 5000, and medical inflation is expected to be 7% per year. The claimant will receive 20 payments .  \n Claim payments are made at yearly intervals, with the first claim payment to be made one year from today.  Calculate the present value of the obligation using an annual effective interest rate of 5%.  \n (A) 87,900 \n(B) 102,500 (C) 114,600 (D) 122,600 \n(E) Cannot be determined \n   \n15 27. \nAn investor pays 100,000 today for a 4-year investment that returns cash flows of 60,000 at the end of each of years 3 and 4. The cash flows can be reinvested at 4.0% per annum effective.   Using an annual effective interest rate of 5.0%, calculate the net present  value of this investment \ntoday.  (A) –1,398 \n(B) –699 (C) 699 (D) 1,398 \n(E) 2,629 \n  28. You are given the following information with respect to a bond: \n(i) par value: 1000 \n(ii) term to maturity: 3 years  \n(iii) annual coupon rate : 6% payable annually  \n You are also given that the one, two, and three year annual spot interest rates are 7%, 8%, and 9% respectively.  Calculate the value of the bond.  (A) 906 \n(B) 926 (C) 930 (D) 950",
    "page_number": null
  },
  "29": {
    "content": "You are given the following information with respect to a bond: \n(i) par value: 1000 \n(ii) term to maturity: 3 years  \n(iii) annual coupon rate: 6% payable annually \n You are also given that the one, two, and three year annual spot interest rates are 7%, 8%, and 9% respectively.  The bond is sold at a price equal to its value.  Calculate the annual effective yield rate for the bond i.  \n (A) 8.1% \n(B) 8.3% (C) 8.5% (D) 8.7% \n(E) 8.9% \n  30. The current price of an annual coupon bond is 100. The yield to maturity is an annual effective rate of 8%. The derivative of the price of the bond with respect to the yield to maturity is -700.  \n Using the bond’s yield rate, c alculate the Macaulay duration of the bond in years . \n (A) 7.00 \n(B) 7.49 \n(C) 7.56 (D) 7.69 \n(E) 8.00 \n   \n17 31. \nA common stock pays a constant dividend at the end of each year into perpetuity.  \n Using an annual effective interest rate of 10%, calculate the Macaulay duration of the stock.  (A) 7 years  \n(B) 9 years  \n(C) 11 years  \n(D) 19 years  \n(E) 27 years  \n  32. A common stock pays dividends at the end of each year into perpetuity. Assume that the dividend increases by 2% each year . \n Using an annual effective interest rate of 5%, calculate the Macaulay duration of the stock in years.  \n (A) 27 \n(B) 35 (C) 44 (D) 52",
    "page_number": "16"
  },
  "33": {
    "content": "Seth borrows X for four years at an annual effective interest rate of 8%, to be repaid with equal payments at the end of each year. The outstanding loan balance at the end of the third year is 559.12.  Calculate the principal repaid in the first payment.  \n (A) 444 \n(B) 454 (C) 464 (D) 474",
    "page_number": "18"
  },
  "34": {
    "content": "Bill buys a 10-year 1000 par value bond with semi-annual coupons paid at an annual rate of 6% . \nThe price assumes an annual nominal yield of 6%, compounded semi-annually.   As Bill receives each coupon payment, he immediately puts the money into an account earning interest at an annual effective rate of i . \n At the end of 10 years, immediately after Bill receives the final coupon payment and the redemption value of the bond, Bill has earned an annual effective yield of 7% on his investment in the bond.  Calculate i . \n (A) 9.50% \n(B) 9.75% (C) 10.00% (D) 10.25% \n(E) 10.50% \n   \n19 35. \nA man turns 40 today and wishes to provide supplemental retirement income of 3000 at the beginning of each month starting on his 65th birthday. Starting today, he makes monthly contributions of X  to a fund for 25 years. The fund earns a n annual  nominal interest  rate of 8% \ncompounded monthly.   On his 65\nth birthday, each 1000 of the fund will provide 9.65 of income at the beginning of each \nmonth starting immediately and continuing as long as he survives.  Calculate X . \n (A) 324.70 \n(B) 326.90 (C) 328.10 (D) 355.50 \n(E) 450.70 \n  36. Happy and financially astute parents decide at the birth of their daughter that they will need to provide 50,000 at each of their daughter’s 18\nth, 19th, 20th and 21st birthdays to fund her college \neducation. They plan to contribute X  at each of their daughter’s 1st through 17th birthdays to fund \nthe four 50,000 withdrawals. T hey anticipate earning a constant 5% annual effective interest rate \non their contributions.  \nLet 1/1.05v= . \n \nDetermine which of the following equations of value can be used to calculate X . \n(A) 17\n234\n150,000[ ]k\nkX v vv v v\n== +++∑  \n(B) 16\n23\n11.05 50,000[1 ]k\nkX vv v\n== ++ +∑  \n(C) 17\n23\n01.05 50,000[1 ]k\nkX vv v\n== ++ +∑  \n(D) 17\n23\n11.05 50,000[1 ]k\nkX vv v\n== ++ +∑",
    "page_number": null
  },
  "37": {
    "content": "Joe must pay liabilities of 1,000 due 6 months from now and another 1,000 due one year from now. There are two available investments:  Bond I: A 6-month bond with face amount of 1,000, an 8% nominal annual coupon rate convertible semiannually, and a 6% nominal annual yield rate convertible semiannually;  Bond II: A one-year bond with face amount of 1,000, a 5% nominal annual coupon rate convertible semiannually, and a 7% nominal annual yield rate convertible semiannually.  Calculate the amount  of each bond that Joe should purchase to exactly match the liabilities.  \n (A) Bond I – 1, Bond II – 0.97561 \n(B) Bond I – 0.93809, Bond II – 1 (C) Bond I – 0.97561, Bond II – 0.94293 (D) Bond I – 0.93809, Bond II – 0.97561 \n(E) Bond I – 0.98345, Bond II – 0.97561 \n  38. Joe must pa y liabilities of 2 000 due one year  from now and another 1000 due two  year s from \nnow. He exactly matches his liabilities with the following two investments:  \n Mortgage I: A one year mortgage in which X  is lent. It is repaid with a single payment at time \none. The annual effective interest rate is 6%.  \n Mortgage II: A  two-year mortgage in which Y  is lent.  It is repaid with two equal annual \npayments. The annual effective interest rate is 7%.  \n Calculate X  + Y. \n (A) 2600 \n(B) 2682 (C) 2751 (D) 2825",
    "page_number": "20"
  },
  "39": {
    "content": "Joe must pay liabilities of 1,000 due one year from now and another 2,000 due three years  from \nnow. There are two available investments:  \n Bond I: A one- year zero -coupon bond that matures for 1000. The yield rate is 6% per year \nBond II: A two -year zero -coupon bond with face amount of 1,000. The yield rate is 7% per year. \n At the present time the one -year forward rate for an investment made two years from now is \n6.5%  Joe plans to buy amounts of each bond. He plans to reinvest the proceeds from Bond II in a one-year zero -coupon bond. Assuming the reinvestment earns the forward rate, calculate the total \npurchase price of Bond I and Bond II where the amounts are selected to exactly match the liabilities.  \n (A) 2584 \n(B) 2697 (C) 2801 (D) 2907",
    "page_number": "21"
  },
  "40": {
    "content": "Matt purchased a 20 -year par value bond with an annual nominal coupon rate of 8% payable \nsemiannually at a price of 1722.25. The bond can be called at par value X  on any coupon date \nstarting at the end of year 15 after the coupon is paid. The lowest yield rate  that Matt can \npossibly receive is a nominal annual interest rate of 6% convertible semiannually.  Calculate X . \n (A) 1400 \n(B) 1420 (C) 1440 (D) 1460",
    "page_number": null
  },
  "41": {
    "content": "Toby purchased a 20-year par value bond with semiannual coupons of 40 and a redemption value of 1100. The bond can be called at 1200 on any coupon date prior to maturity, starting at the end of year 15.   Calculate the maximum price of the bond to guarantee that Toby will earn an annual nominal interest rate of at least 6% convertible semiannually.  \n (A) 1251 \n(B) 1262 (C) 1278 (D) 1286",
    "page_number": "22"
  },
  "42": {
    "content": "Sue purchased a 10-year par value bond with an annual nominal coupon rate of 4% payable semiannually at a price of 1021.50. The bond can be called at par value X  on any coupon date \nstarting at the end of year 5. The lowest yield rate that  Sue can possibly receive is an annual \nnominal rate of 6% convertible semiannually.  \n Calculate X . \n (A) 1120 \n(B) 1140 (C) 1160 (D) 1180",
    "page_number": null
  },
  "43": {
    "content": "Mary purchased a 10 -year par value bond with a n annual  nominal coupon rate of 4% payable \nsemiannually at a price of 1021.50. The bond can be called at 100 over the par value of  1100 on \nany coupon date starting at the end of year 5 and ending six months prior to maturity.   Calculate the m inimum yield that Mary could receive, expressed as a n annual  nominal rate of \ninterest convertible semiannually.  \n (A) 4.7% \n(B) 4.9% (C) 5.1% (D) 5.3% \n(E) 5.5% \n  44. A liability consists of a series of 15 annual payments of 35,000 with the first payment to be made one year from now.  The assets available to immunize this liability are five -year and ten -year zero -coupon bonds. \n The annual effective interest rate used to value the assets and the liability is 6.2%. The liability has the same present value and duration as the asset portfolio.  Calculate the amount invested in the five -year zero -coupon bonds. \n (A) 127,000 \n(B) 167,800 (C) 208,600 (D) 247,900 \n(E) 292,800 \n \n24 45. \nYou are given the following information about a loan of L  that is to be repaid with a series of 16 \nannual payments: \n(i) The first payment of 2000 is due one year from now.  \n(ii) The next seven payments are each 3% larger than the preceding payment.  \n(iii) From the 9th to the 16th payment, each payment will be 3% less than the preceding \npayment.  \n(iv) The loan has an annual effective interest rate of 7%.  \n Calculate L . \n (A) 20,689 \n(B) 20,716 (C) 20,775 (D) 21,147 \n(E) 22,137 \n  46. The annual force of interest credited to a savings account is defined by \n \n2\n3100\n3150tt\ntδ=\n+  \nwith t  in years.  Austin deposits 500 into this account at time 0. \n \nCalculate the time in years it will take for the fund to be worth 2000.  (A) 6.7 \n(B) 8.8 (C) 14.2 (D) 16.5 \n(E) 18.9 \n \n25 47. \nA 40-year bond is purchased at a discount. The bond pays annual coupons. The amount for accumulation of discount in the 15th coupon is 194.82. The amount for accumulation of discount in the 20th coupon is 306.69.  Calculate the amount of discount in the purchase price of this bond.  (A) 13,635 (B) 13,834 (C) 16,098 (D) 19,301 (E) 21,135   48. Tanner takes out a loan today and repays the loan with eight level annual payments, with the first payment one year from today. The payments are calculated based on an annual effective interest rate of 4.75%. The principal portion of the fifth payment is 699.68.  Calculate the total amount of interest paid on this loan.  \n (A) 1239 \n(B) 1647 (C) 1820 (D) 2319",
    "page_number": "23"
  },
  "49": {
    "content": "Turner buys a new car and finances it with a loan of 22,000. He will make n monthly payments \nof 450.30 starting in one month. He will make one larger payment in n+1 months to pay off the loan. Payments are calculated using an annual nominal interest rate of 8.4%, convertible monthly. Immediately after the 18th payment he refinances the loan to pay off the remaining balance with 24 monthly payments starting one month later. This refinanced loan uses an annual nominal interest rate of 4.8%, convertible monthly.  Calculate the amount of the new monthly payment.  (A) 668  (B) 693 (C) 702 (D) 715 \n(E) 742   50. Kylie bought a 7-year, 5000 par value bond with an annual coupon rate of 7.6% paid semiannually. She bought the bond with no premium or discount.  Calculate the Macaulay duration of this bond with respect to the yield rate on the bond.  (A) 5.16 (B) 5.35 (C) 5.56 (D) 5.77 (E) 5.99  \n27 51. \nKrishna buys an n-year 1000 bond at par. The Macaulay duration is 7.959 years using an annual effective interest rate of 7.2%.  \n Calculate the estimated price of the bond, using the first -order modified approximation, if the \ninterest rate rises to 8.0%.  \n (A) 940.60 \n(B) 942.88 (C) 944.56 (D) 947.03 (E) 948.47   52. The prices of zero -coupon bonds are: \nMaturity  Price  \n1 0.95420  \n2 0.90703  \n3 0.85892  \n Calculate the one- year forward rate, deferred two years . \n (A) 0.048 (B) 0.050 (C) 0.052 (D) 0.054 (E) 0.056 \n \n28 53. \nSam buys an eight-year, 5000 par bond with an annual coupon rate of 5%, paid annually. The \nbond sells for 5000. Let 1d be the Macaulay duration just before the first coupon is paid. Let 2d \nbe the Macaulay duration just after the first coupon is paid. \n \nCalculate 1\n2d\nd. \n \n(A) 0.91 (B) 0.93 (C) 0.95 (D) 0.97 (E) 1.00   54. An insurance company must pay liabilities of 99 at the end of one year, 102 at the end of two years and 100 at the end of three years. The only investments available to the company are the following three bonds. Bond A and Bond C are annual coupon bonds. Bond B is a zero -coupon \nbond.  Bond Maturity (in years) Yield -to-\n Maturity (Annualized) Coupon Rate \nA  1    6%    7% B  2    7%    0% C  3    9%    5%  All three bonds have a par value of 100 and will be redeemed at par.  Calculate the number of units of Bond A that must be purchased to match the liabilities exactly.  (A) 0.8807 \n(B) 0.8901 (C) 0.8975 \n(D) 0.9524 \n(E) 0.9724  \n29 55. \nDetermine which of the following statements is false with respect to Redington immunization.  \n (A) Modified duration may change at different rates for each of the assets and liabilities as time goes by. \n(B) Redington immunization requires infrequent rebalancing to keep modified duration of \nassets equal to modified duration of liabilities.  \n(C) This technique is designed to work only for small changes in the interest rate. (D) The yield curve is assumed to be flat.  \n(E) The yield curve shifts in parallel when the interest rate changes.  \n  56. Aakash has a liability of 6000 due in four years. This liability will be met with payments of A  in \ntwo years and B in six years. Aakash is employing a full immunization strategy using an annual \neffective interest rate of 5%.  \n \nCalculate \nAB−. \n \n(A) 0 (B) 146 (C) 293 (D) 586",
    "page_number": "26"
  },
  "57": {
    "content": "Jia Wen has a liability of 12,000 due in eight years. This liability will be met with payments of \n5000 in five years and B  in 8b+ years.  Jia Wen is employing a full immunization strategy using \nan annual effective interest rate of 3%.  \nCalculate B\nb. \n \n(A) 2807 \n(B) 2873 (C) 2902 (D) 2976 (E) 3019   58. Trevor has assets at time 2 of A  and at time 9 of B . He has a liability of 95,000 at time 5. Trevor \nhas achieved Redington immunization in his portfolio using an annual effective interest rate of 4%. \n \nCalculate \nA\nB. \n \n(A) 0.7307 (B) 0.9670 (C) 1.0000 (D) 1.0132 (E) 1.3686   \n31 59. \nYou are given the following information about two bonds, Bond A and Bond B: \ni) Each bond is a 10-year bond with semiannual coupons redeemable at its par value of 10,000, and is bought to yield an annual nominal interest rate of i, convertible semiannually. \nii) Bond A has an annual coupon rate of ( i + 0.04), paid semiannually. \niii) Bond B has an annual coupon rate of ( i – 0.04), paid semiannually. \niv) The price of Bond A is 5,341.12 greater than the price of Bond B. \n Calculate i . \n (A) 0.042 \n(B) 0.043 (C) 0.081 (D) 0.084 \n(E) 0.086 \n  60. A borrower takes out a 15-year loan for 400,000, with level end-of-month payments, at an annual nominal interest rate of 9% convertible monthly.  Immediately after the 36th payment, the borrower decides to refinance the loan at an annual nominal interest rate of j , convertible monthly. The remaining term of the loan is kept at twelve \nyears, and level payments continue to be made at the end of the month. However, each payment is now 409.88 lower than each payment from the original loan.  Calculate j.  \n (A) 4.72% \n(B) 5.75% (C) 6.35 % (D) 6.90% \n(E) 9.14% \n  \n32 61. \nConsider two 30-year bonds with the same purchase price. Each has an annual coupon rate of 5% paid semiannually and a par value of 1000.  The first bond has an annual nominal yield rate of 5% compounded semiannually, and a redemption value of 1200.  The second bond has an annual nominal yield rate of j  compounded semiannually, and a \nredemption value of 800.  Calculate j . \n (A) 2.20% \n(B) 2.34% (C) 3.53% (D) 4.40% \n(E) 4.69% \n  62. Lucas opens a bank account with 1000 and lets it accumulate at an annual nominal interest rate of 6% convertible semiannually. Danielle also opens a bank account with 1000 at the same time as Lucas, but it grows at an annual nominal interest rate of 3% convertible monthly.   For each account, interest is credited only at the end of each interest conversion period.  Calculate the number of months required for the amount in Lucas’s account to be at least double the amount in Danielle’s account.  (A) 276 \n(B) 282 (C) 285 (D) 286",
    "page_number": "30"
  },
  "63": {
    "content": "Bill and Joe each put 10 into separate accounts at time t  = 0, where t  is measured in years. \nBill’s account earns interest at a constant annual effective interest rate of K /25, K  > 0. \nJoe’s account earns interest at a force of interest, 1.0.25tKtδ=+ \nAt the end of four years, the amount in each account is X . \n Calculate X . \n (A) 20.7 \n(B) 21.7 (C) 22.7 (D) 23.7 \n(E) 24.7 \n  64. A borrower takes out a 50- year loan, to be repaid with payments at the end of each year.  The \nloan payment is 2500 for each of the first 26 years. Thereafter, the payments decrease by 100 per year.  Interest on the loan is charged at an annual effective rate of i  (0% < i  < 10%).  \nThe principal repaid in year 26 is X . \n Determine the amount of interest paid in the first year.  \n \n(A) \n25Xv \n(B) 25 252500v Xv− \n(C) 2500 – X  \n(D) 252500 Xv− \n(E) 25Xi  \n \n  \n34 65. \nJohn made a deposit of 1000 into a fund at the beginning of each year for 20 years.   At the end of 20 years, he began making semiannual withdrawals of 3000 at the beginning of \neach six months, with a smaller final withdrawal to exhaust the fund. The fund earned an annual \neffective interest rate of 8.16%.  \n Calculate the amount of the final withdrawal.  \n (A) 561 \n(B) 1226 (C) 1430 (D) 1488",
    "page_number": "33"
  },
  "66": {
    "content": "The present value of a perpetuity paying 1 every two years with first payment due immediately is 7.21 at an annual effective rate of i . \n Another perpetuity paying R  every three years with the first payment due at the beginning of year \ntwo has the same present value at an annual effective rate of i  + 0.01. \n Calculate R . \n (A) 1.23 \n(B) 1.56 (C) 1.60 (D) 1.74 \n(E) 1.94 \n   \n35 67. \nA loan of 10,000 is repaid with a payment made at the end of each year for 20 years. The payments are 100, 200, 300, 400, and 500 in years 1 through 5, respectively. In  the \nsubsequent 15 years, equal annual payments of X  are made.  \nThe annual effective interest rate is 5%.  \n Calculate X . \n (A)  842 \n(B)  977 (C) 1017 (D) 1029",
    "page_number": null
  },
  "68": {
    "content": "An investor wishes to accumulate 5000 in a fund at the end of 15 years. To accomplish  this, she \nplans to make equal deposits of X  at the end of each year for the first ten years.  The fund earns an \nannual effective rate of 6% during the first ten years and 5% for the next five years.  \n Calculate X . \n (A) 224 \n(B) 284 (C) 297 (D) 312",
    "page_number": null
  },
  "69": {
    "content": "A borrower takes out a 15-year loan for 65,000, with level end-of-month payments. The annual nominal interest rate of the loan is 8%, convertible monthly.   Immediately after the 12 th payment is made, the remaining loan balance is reamortized. The \nmaturity date of the loan remains unchanged, but the annual nominal interest rate of the loan is changed to 6%, convertible monthly.   Calculate the new end -of-month payment. \n (A) 528 \n(B) 534 (C) 540 (D) 546",
    "page_number": "36"
  },
  "70": {
    "content": "College tuition is 6000 for the current school year, payable in full at the beginning of the school year.  College tuition will grow at an annual rate of 5%. A parent sets up a college savings fund \nearning interest at an annual effective rate of 7%.  The parent deposits 750 at the beginning of \neach school year for 18 years, with the first deposit made at the beginning of the current school year. Immediately following the 18th  deposit, the parent pays tuition for the 18th  school year \nfrom the fund.   The amount of money needed, in addition to the balance in the fund, to pay tuition at the beginning of the 19\nth school year is X .  \n Calculate X . \n (A) 1439 \n(B) 1545 (C) 1664 (D) 1785",
    "page_number": null
  },
  "71": {
    "content": "A 1000 par value 20-year bond sells for P  and yields a nominal interest rate of 10% convertible \nsemiannually. The bond has 9% coupons payable semiannually and a redemption value of 1200.  Calculate P . \n (A) 914 \n(B) 943 (C) 1013 (D) 1034",
    "page_number": "37"
  },
  "72": {
    "content": "An investor purchases a 10-year callable bond with face amount of 1000 for price P . The bond \nhas an annual nominal coupon rate of 10% paid semi-annually.   The bond may be called at par by the issuer on every other coupon payment date, beginning with the second coupon payment date.   The investor earns at least an annual nominal yield of 12% compounded semi-annually regardless of when the bond is redeemed.  Calculate the largest possible value of P . \n (A) 885 \n(B) 892 (C) 926 (D) 965",
    "page_number": null
  },
  "73": {
    "content": "You are given the following term structure of interest rates:  \nLength of  investment  in years  Spot rate \n1 7.50%  \n2 8.00%  \n3 8.50%  \n4 9.00%  \n5 9.50%  \n6 10.00%  \n Calculate the one- year forward rate, deferred four years,  implied by this term structure.  \n (A) 9.5% \n(B) 10.0% (C) 11.5% (D) 12.0% \n(E) 12.5% \n  74. Seth has two retirement benefit options.  \n His first option is to receive a lump sum of 374,500 at retirement.   His second option is to receive monthly payments for 25 years starting one month after retirement.  For the first year, the amount of each monthly payment is 2000. For each subsequent \nyear, the monthly payments are 2% more than the monthly payments from the previous year.   Using an annual nominal interest rate of 6%, compounded monthly, the present value of the second option is P .  \n Determine which of the following is true.  \n (A) P is 323,440 more than the lump sum option amount. \n(B) P is 107,170 more than the lump sum option amount. \n(C) The lump sum option amount is equal to P . \n(D) The lump sum option amount is 60 more than P . \n(E) The lump sum option amount is 64,090 more than P . \n   \n39 75. \nA couple decides to save money for their child's first year college tuition.  \n The parents will deposit 1700 n months from today and another 3400 2n months from today.  All deposits earn interest at a nominal annual rate of 7.2%, compounded monthly.  Calculate the maximum integral value of n such that the parents will have accumulated  at least \n6500 five years from today.  (A) 11 \n(B) 12 (C) 18 (D) 24",
    "page_number": "38"
  },
  "76": {
    "content": "Let S be the accumulated value of 1000 invested for two years at a nominal annual rate of discount d convertible semiannually, which is equivalent to an annual effective interest rate of i . \n Let T  be the accumulated value of 1000 invested for one year at a nominal annual rate of \ndiscount d convertible quarterly.  \n4/ (39 / 38)ST= . \n Calculate i . \n (A) 10.0% \n(B) 10.3% (C) 10.8% (D) 10.9% \n(E) 11.1% \n   \n40 77. \nAn investor’s retirement account pays an annual nominal interest rate of 4.2%, convertible monthly.  On January 1 of year y , the investor’s account balance was X . The investor then deposited 100 at \nthe end of every quarter. On May 1 of year ( y + 10), the account balance was 1.9X . \n Determine which of the following is an equation of value that can be used to solve for X .  \n \n(A) \n42\n124 1\n131.9 100\n(1.0105)(1.0105)k\nkXX−\n=+=∑  \n(B) 42\n3( 1) 124\n1100 1.9\n(1.0035) (1.0035)k\nkXX−\n=+=∑  \n(C) 41\n3 124\n1100 1.9\n(1.0035) (1.0035)k\nkXX\n=+=∑  \n(D) 41\n124 1\n13100 1.9\n(1.0105)(1.0105)k\nkXX−\n=+=∑",
    "page_number": null
  },
  "78": {
    "content": "Five deposits of 100 are made into a fund at two- year intervals with the first deposit at the \nbeginning of the first year.  The fund earns interest at an annual effective rate of 4% during the first six years and at an annual effective rate of 5% thereafter.  \n Calculate the annual effective yield rate earned over the investment period ending at the end of \nthe tenth year.  \n (A) 4.18%  \n(B) 4.40% (C) 4.50% (D) 4.58% \n(E) 4.78%   \n41 79. \nJohn finances his daughter’s college education by making deposits into a fund earning interest at an annual effective rate of 8%.  For 18 years he deposits X  at the beginning of each month.  \n In the 16\nth through the 19th years, he makes a withdrawal of 25,000 at the beginning of each year. \nThe final withdrawal reduces the fund balance to zero.  \n Calculate X.  \n (A) 207 \n(B) 223 (C) 240 (D) 245",
    "page_number": null
  },
  "80": {
    "content": "Jack inherited a perpetuity -due, with annual payments of 15,000. He immediately  exchanged the \nperpetuity for a 25-year annuity-due having the same present value. The annuity-due has annual payments of X . \n All the present values are based on an annual effective interest rate of 10% for the first 10 years and 8% thereafter.  \n Calculate  X. \n (A) 16,942 \n(B) 17,384 (C) 17,434 (D) 17,520 \n(E) 18,989 \n  \n42 81. \nAn investor owns a bond that  is redeemable for 300 in seven years. The investor has just \nreceived a coupon of 22.50 and each subsequent semiannual coupon will be X  more than the \npreceding coupon. The present value of this bond immediately after the payment of the coupon is 1050.50 assuming an annual nominal yield rate of 6% convertible semiannually.  Calculate X . \n (A) 7.54 \n(B) 10.04 (C) 22.37 (D) 34.49 \n(E) 43.98 \n  82. A 30 -year annuity is arranged to pay off a loan taken out today at a 5% annual effective interest \nrate. The first payment of the annuity is due in ten years in the amount of 1,000. The subsequent \npayments increase by 500 each year.  \n Calculate the amount of the loan.   (A) 58,283 \n(B) 61,197 (C) 64,021 (D) 64,257 \n(E) 69,211 \n   \n43 83. \nA woman worked for 30 years before retiring.  At the end of the first year of employment she \ndeposited 5000 into an account for her retirement. At the end of each subsequent year of employment, she deposited 3% more than the prior year. The woman made a total of 30 deposits.  She will withdraw 50,000 at the beginning of the first year of retirement and will make annual withdrawals at the beginning of each subsequent year for a total of 30 withdrawals. Each of these subsequent withdrawals will be 3% more than the prior year. The final withdrawal depletes the \naccount.  \n The account earns a constant annual effective interest rate.  \n Calculate the account balance after the final deposit and before the first withdrawal.  \n (A) 760,694 \n(B) 783,948 (C) 797,837 (D) 805,541 \n(E) 821,379 \n  84. An insurance company purchases a perpetuity-due providing a geometric series of quarterly payments for a price of 100,000 based on an annual effective interest rate of i . The first and \nsecond quarterly payments are 2000 and 2010, respectively.  Calculate i . \n (A) 10.0% \n(B) 10.2% (C) 10.4% (D) 10.6% \n(E) 10.8% \n  \n44 85. \nA perpetuity provides for continuous payments. The annual rate of payment at time t  is  \n( )101, for 0 10, \n1.03 , for 10.tt\nt−≤< ≥  \n Using an annual effective interest rate of 6%, the present value at time t  = 0 of this perpetuity is \nx. \n Calculate x .  \n (A) 27.03  \n(B) 30.29 (C) 34.83 (D) 38.64 \n(E) 42.41 \n  86. A bank agrees to lend 10,000 now and X  three years from now in exchange for a single \nrepayment of 75,000 at the end of 10 years. The bank charges interest at an annual  effective rate \nof 6% for the first 5 years and at a force of interest \n1\n1ttδ=+ for 5t≥. \n Calculate X . \n (A) 23,500 \n(B) 24,000 (C) 24,500 (D) 25,000 \n(E) 25,500 \n  \n45 87. \nA company takes out a loan of 15,000,000 at an annual effective discount rate of 5.5%. You are given: \ni) The loan is to be repaid with n annual payments of 1,200,000 plus a drop payment \none year after the nth  payment.  \nii) The first payment is due three years after the loan is taken out. \n Calculate the amount of the drop payment.  (A) 79,100 \n(B) 176,000 (C) 321,300 (D) 959,500 \n(E) 1,180,300 \n  88. Tim takes out an n-year loan with equal annual payments at the end of each year.  \nThe interest portion of the payment at time ( n − 1) is equal to 0.5250 of the interest portion of the \npayment at  time  (n − 3) and is also equal to 0.1427 of the interest portion of the first payment. \n \nCalculate n.  (A) 18 \n(B) 20 (C) 22 (D) 24",
    "page_number": null
  },
  "89": {
    "content": "On January 1, 2003 Mike took out a 30-year mortgage loan in the amount of 200,000 at an annual nominal interest rate of 6% compounded monthly. The loan was to be repaid by level end-of-month payments with the first payment on January 31, 2003.  \n Mike repaid an extra 10,000 in addition to the regular monthly payment on each December 31 in the years 2003 through 2007.   Determine the date on which Mike will make his last payment (which is a drop payment).  (A) July 31, 2013 \n(B) November 30, 2020 (C) December 31, 2020 (D) December 31, 2021 \n(E) January 31, 2022 \n  90. A 5-year loan of 500,000 with an annual effective discount rate of 8% is to be repaid by level \nend-of-year payments.  \n If the first four payments had been rounded up to the next multiple of 1,000, the final payment would be X . \n Calculate X . \n (A) 103,500 \n(B) 111,700 (C) 115,200 (D) 125,200 \n(E) 127,500 \n   \n47 91. \nA company plans to invest X  at the beginning of each month in a zero-coupon bond in order to \naccumulate 100,000 at the end of six months. The price of each bond as a percentage of redemption value is given in the following chart: \nMaturity (months)  1 2 3 4 5 6 \nPrice  99% 98% 97% 96% 95% 94% \n Calculate X  given that the bond prices will not change during the six-month period. \n (A) 15,667 \n(B) 16,078 (C) 16,245 (D) 16,667 \n(E) 17,271 \n  92. A loan of X  is repaid with level annual payments at the end of each year for 10 years.  \nYou are given: \ni) The interest paid in the first year is 3600; and \nii) The principal repaid in the 6\nth year is 4871. \n Calculate X . \n (A) 44,000 \n(B) 45,250 (C) 46,500 (D) 48,000 \n(E) 50,000 \n   \n48 93. \nAn investor purchased a 25-year bond with semiannual coupons, redeemable at par, for a price of 10,000. The annual effective yield rate is 7.05%, and the annual coupon rate is 7%.   \n Calculate the redemption value of the bond.  (A) 9,918 \n(B) 9,942 (C) 9,981 (D) 10,059 \n(E) 10,083 \n  94. Jeff has 8000 and would like to purchase a 10,000 bond. In doing so, Jeff takes out a 10 year  \nloan of 2000 from a bank and will make interest-only payments at the end of each month at a nominal rate of 8.0% convertible monthly. He immediately pays 10,000 for a 10-year bond with a par value of 10,000 and 9.0% coupons paid monthly.  Calculate the annual effective yield rate that Jeff will realize on his 8000 over the 10 -year period.  \n (A) 9.30% \n(B) 9.65% (C) 10.00% (D) 10.35% \n(E) 10.70% \n   \n49 95. \nA bank issues three annual coupon bonds redeemable at par, all with the same term, price, and annual effective yield rate.  \n The first bond has face value 1000 and annual coupon rate 5.28%.  The second bond has face value 1100 and annual coupon rate 4.40%.  The third bond has face value 1320 and annual coupon rate r . \n Calculate r . \n (A) 2.46% \n(B) 2.93%  (C) 3.52% (D) 3.67% \n(E) 4.00% \n  96. An investor owns a bond that is redeemable for 250 in 6 years from now. The investor has just received a coupon of c and each subsequent semiannual coupon will be 2% larger than the \npreceding coupon. The present value of this bond immediately after the payment of the coupon is 582.53 assuming an annual effective yield rate of 4%.  Calculate c . \n (A) 32.04 \n(B) 32.68 (C) 40.22 (D) 48.48 \n(E) 49.45 \n   \n50 97. \nAn n-year bond with annual coupons has the following characteristics: \ni) The redemption value at maturity is 1890; \nii) The annual effective yield rate is 6% ; \niii) The book value immediately after the third coupon is 1254.87; and  \niv) The book value immediately after the fourth coupon is 1277.38.  \nCalculate n.  (A) 16 \n(B) 17 (C) 18 (D) 19",
    "page_number": "46"
  },
  "98": {
    "content": "An n-year bond with semiannual coupons has the following characteristics: \ni) The par value and redemption value are 2500; \nii) The annual coupon r ate is 7% payable semi -annually; \niii) The annual nominal yield to maturity is 8% convertible semiannually; and \niv) The book value immediately after the fourth coupon is 8.44 greater than the book \nvalue immediately after the third coupon. \n Calculate n.  (A)  6.5 \n(B)  7.0 \n(C)  9.5 (D) 12.0 \n(E) 14.0 \n   \n51 99. \nThe one- year forward rates, deferred t  years , are estimated to be : \nYear  (t) 0 1 2 3 4 \nForward Rate  4% 6% 8% 10% 12% \n Calculate the spot rate for a zero -coupon bond maturing three years from now. \n (A) 4% \n(B) 5% (C) 6% (D) 7% \n(E) 8% \n  100. Annuity A pays 1 at the beginning of each year for three years.  Annuity B pays 1 at the \nbeginning of each year for four years.   The Macaulay duration of Annuity A at the time of purchase is 0.93. Both annuities offer the same yield rate.  \n Calculate the Macaulay duration of Annuity B at the time of purchase.  (A) 1.240  \n(B) 1.369 (C) 1.500 (D) 1.930 \n(E) 1.965 \n   \n52 101. \nCash flows are 40,000 at time 2 (in years), 25,000 at time 3, and 100,000 at time 4. The annual effective yield rate is 7.0%.  \n Calculate the Macaulay duration.  \n (A) 2.2 \n(B) 2.3 (C) 3.1 (D) 3.3 \n(E) 3.4 \n  102. Rhonda purchases a perpetuity providing a payment of 1 at the beginning of each year. The perpetuity’s Macaulay duration is 30 years.   Calculate the modified duration of this perpetuity.   (A) 28.97 \n(B) 29.00 (C) 29.03 (D) 29.07 \n(E) 29.10 \n   \n53 103. \nWhich of the following statements regarding immunization are true? \nI. If long -term interest rates are lower than short -term rates, the need for \nimmunization is reduced. \nII. Either Macaulay or modified duration can be used to develop an immunization \nstrategy.  \nIII. Both processes of matching the present values of the flows or the flows \nthemselves will produce exact matching.  \n (A) I only \n(B) II only  \n(C) III only  \n(D) I, II and III  \n(E) The correct answer is not given by (A), (B), (C), or (D). \n  104. A company owes 500 and 1000 to be paid at the end of year one and year four, respectively. The company will set up an investment program to match the duration and the present value of the above obligation using an annual effective interest rate of 10%.   The investment program produces asset cash flows of X  today and Y  in three years.   \n Calculate X  and determine whether the investment program satisfies the conditions for Redington \nimmunization.  \n (A) X = 75 and the Redington immunization conditions are not satisfied. \n(B) X = 75 and the Redington immunization conditions are satisfied. \n(C) X = 1138 and the Redington immunization conditions are not satisfied. \n(D) X = 1138 and the Redington immunization conditions are satisfied. \n(E) X = 1414 and the Redington immunization conditions are satisfied. \n   \n54 105. \nAn insurance company has a known liability of 1,000,000 that is due 8 years from now. The technique of full immunization is to be employed. Asset I will provide a cash flow of 300,000 exactly 6 years from now. Asset II will provide a cash flow of X , exactly y  years from now, \nwhere y > 8.  \n The annual effective interest rate is 4%.  \n Calculate X . \n (A) 697,100 \n(B) 698,600 (C) 700,000 (D) 701,500 \n(E) 702,900 \n  106. A company has liabilities of 573 due at the end of year 2 and 701 due at the end of year 5.  A portfolio comprises two zero-coupon bonds, Bond A and Bond B.  Determine which portfolio produces a Redington immunization of the liabilities using an annual effective interest rate of 7.0%.  \n (A) Bond A: 1-year, current price 500; Bond B: 6-years, current price 500 \n(B) Bond A: 1-year, current price 572; Bond B: 6-years, current price 428 (C) Bond A: 3-years, current price 182; Bond B: 4-years, current price 1092 (D) Bond A: 3-years, current price 637; Bond B: 4-years, current price 637 \n(E) Bond A: 3.5 years, current price 1000; Bond B: Not used \n   \n55 107. \nA company has liabilities of 402.11 due at the end of each of the next three years. The  company \nwill invest 1000 today to fund these payouts. The only investments available are one- year and \nthree- year zero -coupon bonds, and the yield curve is flat at a 10% annual effective rate. The \ncompany wishes to match the duration of its assets to the duration of its liabilities.  \n Determine h ow much the company should invest in each bond. \n (A) 366 in the one-year bond and 634 in the three-year bond. \n(B) 484 in the one-year bond and 516 in the three-year bond. (C) 500 in the one-year bond and 500 in the three-year bond. (D) 532 in the one-year bond and 468 in the three -year bond. \n(E) 634 in the one-year bond and 366 in the three-year bond. \n  108. You are given the following information about a company's liabilities: \n• Present value: 9697  \n• Macaulay duration: 15.24 \n• Macaulay convexity: 242.47 \n The company decides to create an investment portfolio by making investments into two of the following three zero-coupon bonds: 5-year, 15-year, and 20- year.  The company would like its \nposition to be Redington immunized against small changes in yield rate.  The annual effective yield rate for each of the bonds is 7.5%.  Determine which of the following portfolios the company should create.  (A) Invest 3077 for the 5-year bond and 6620 for the 20-year bond. \n(B) Invest 6620 for the 5-year bond and 3077 for the 20-year bond. (C) Invest 465 for the 15-year bond and 9232 for the 20-year bond. (D) Invest 4156 for the 15-year bond and 5541 for the 20-year bond. \n(E) Invest 9232 for the 15-year bond and 465 for the 20-year bond. \n   \n56 109. \nA bank accepts a 20,000 deposit from a customer on which it guarantees to pay an annual effective interest rate of 10% for two years.  The customer needs to withdraw half of the \naccumulated value at the end of the first year.  The customer will withdraw the remaining value at \nthe end of the second year.  The bank has the following investment options available, which may be purchased in any quantity: \nBond H: A one- year zero -coupon bond yielding 10% annually \nBond I: A two -year zero -coupon bond yielding 11% annually \nBond J: A two -year bond that sells at par with 12% annual coupons  \n Any portion of the 20,000 deposit that is not needed to be invested in bonds is retained by the bank as profit.  Determine which of the following investment strategies produces the highest profit for the bank and is guaranteed to meet the customer’s withdrawal needs.  (A) 9,091 in Bond H, 8,264 in Bond I, 2,145 in Bond J \n(B) 10,000 in Bond H, 10,000 in Bond I (C) 10,000 in Bond H, 9,821 in Bond I (D) 8,910 in Bond H, 731 in Bond I, 10,000 in Bond J \n(E) 8,821 in Bond H, 10,804 in Bond J \n   \n57 110. \nAn insurance company wants to match liabilities of 25,000 payable in one year and 20,000 payable in two years with specific assets.  The following assets are currently available:  \ni) One-year bond with an annual coupon of 6.75% at par \nii) Two-year bond with annual coupons of 4.50% at par \niii) Two-year zero -coupon bond yielding 5.00% annual effective \n Calculate the smallest amount the company needs to disburse today to purchase assets that will exactly match these liabilities.   (A) 41,220 \n(B) 41,390 (C) 41,560 (D) 41,660 \n(E) 41,750 \n  111. Martha leaves an estate of 500,000.  Interest on this estate is paid to John for the first X  years at \nthe end of each year. Karen receives annual interest payments from the end of year X +1 forever.  \nAt an annual effective interest rate of 5%, the present value of Karen’s  interest payments is 1.59 \ntimes the present value of John’s.  \n Calculate X . \n (A) 6 \n(B) 7 (C) 8 (D) 9",
    "page_number": null
  },
  "112": {
    "content": "At time 0, Cheryl deposits X  into a bank account that credits interest at an annual effective rate of \n7%. At time 3, Gomer deposits 1000 into a different bank account that credits simple interest at \nan annual rate of y%. At time 5, the annual forces of interest on the two accounts are equal, and \nGomer’s account has accumulated to Z . \n Calculate Z . \n (A) 1160 \n(B) 1200 (C) 1390 (D) 1400",
    "page_number": "58"
  },
  "113": {
    "content": "Which of the following is an expression for the present value of a perpetuity with annual payments of 1, 2, 3, …, where the first payment will be made at the end of n years, using an \nannual effective interest rate of i ? \n \n(A) \nn\nna nv\ni− \n(B) nna\ni− \n(C) nv\nd \n(D) 2nv\nd \n(E) nv\ndi \n \n  \n59 114. \nJennifer establishes an investment account to pay for college expenses for her daughter. She plans to invest X  at the beginning of each month for the next 21 years. Beginning at the end of \nthe 18th year, she will withdraw 20,000 annually. The final withdrawal at the end of the 21st year will exhaust the account. She anticipates earning an annual effective yield of 8% on the investment.  \n Calculate X . \n (A) 137.90 \n(B) 142.80 (C) 146.40 (D) 150.60 \n(E) 154.30 \n  115. For a given interest rate i  > 0, the present value of a 20-year continuous annuity of one dollar per \nyear is equal to 1.5 times the present value of a 10-year continuous annuity of one dollar per year.  \n Calculate the accumulated value of a 7 -year continuous annuity of one dollar per year. \n (A) 5.36 \n(B) 5.55 (C) 8.70 (D) 9.01 \n(E) 9.33 \n   \n60 116. \nAn annuity having n payments of 1 has a present value of X . The first payment is made at the end \nof three years and the remaining payments are made at seven -year intervals thereafter.   \n Determine X . \n \n(A) \n73 3\n3naa\ns+− \n(B) 73 3\n7naa\na+− \n(C) 73 7\n3naa\na+− \n(D) 73 7\n7naa\na+− \n(E) 73 7\n3naa\ns+− \n \n 117. At an annual effective interest rate of 10.9%, each of the following are equal to X : \n• The accumulated value at the end of n years of an n-year annuity-immediate paying 21.80 per \nyear.  \n• The present value of a perpetuity-immediate paying 19,208 at the end of each n-year period. \n \nCalculate X.  \n (A) 1555 \n(B) 1750 (C) 1960 (D) 2174 \n(E) There is not enough information given to calculate X. \n  \n61 118. \nAn investor decides to purchase a five-year annuity with an annual nominal interest rate of 12% convertible monthly for a price of X.  Under the terms of the annuity, the investor is to receive 2 at the end of the first month. The payments increase by 2 each month thereafter.   Calculate X . \n (A) 2015 \n(B) 2386 (C) 2475 (D) 2500",
    "page_number": null
  },
  "119": {
    "content": "A perpetuity-due with semi-annual payments consists of two level payments of 300, followed by a series of increasing payments.  Beginning with the third payment, each payment is 200 larger \nthan the preceding payment.   Using an annual effective interest rate of i , the present value of the perpetuity is 475,000.  \n Calculate i . \n (A) 4.05% \n(B) 4.09% (C) 4.13% (D) 4.17% \n(E) 4.21% \n   \n62 120. \nAt an annual effective interest r ate of 6%, the present value of a perpetuity immediate with \nsuccessive annual payments of 6, 8, 10, 12, ..., is equal to  X. \n Calculate X . \n (A) 100 \n(B) 656 (C) 695 (D) 1767",
    "page_number": null
  },
  "121": {
    "content": "A company is considering investing in a particular project. The project requires an investment of X today. Additional investments are required at the beginning of each of the next five years, with \neach year’s investment 5% greater than the previous year’s investment.  \n The investment is expected to produce an income of 100 per year at the end of each year forever, with the first payment expected at the end of the first year.  \n At an annual effective interest rate of 10.25%, the project has a net present value of zero.  \n Calculate X . \n (A) 183 \n(B) 192 (C) 205 (D) 215",
    "page_number": null
  },
  "122": {
    "content": "A perpetuity-due with annual payments consists of ten level payments of X followed by a series \nof increasing payments. Beginning with the eleventh payment, each payment is 1.5% larger than the preceding payment.   Using an annual effective interest rate of 5%, the present value of the perpetuity is 45,000.   Calculate X . \n (A) 1,679 \n(B) 1,696 (C) 1,737 (D) 1,763 \n(E) 1,781 \n  123. A family purchases a perpetuity-immediate that provides annual payments that decrease by 0.4% each year.  The price of the perpetuity is 10,000 at an annual force of interest of 0.06. \n Calculate the amount of the perpetuity’s first payment.  \n (A) 604 \n(B) 620 (C) 640 (D) 658",
    "page_number": "63"
  },
  "124": {
    "content": "Company X  received the approval to start no more than two projects in the current calendar year. \n Three different projects were recommended, each of which requires an investment of 800 to be made at the beginning of the year.  The cash flows for each of the three projects are as follows:  \n \nEnd of  year Project A  Project B  Project C  \n1 500 500 500 \n2 500 300 250 \n3 –175 –175 –175 \n4 100 150 200 \n5 0 200 200 \n The company uses an annual effective interest rate of 10% to discount its cash flows.  Determine which combination of projects the company should select. \n (A) Projects A and B  \n(B) Projects B and C  \n(C) Projects A and C  \n(D) Project A only \n(E) Project B only \n   \n65 125. \nA borrower took out a loan of 100,000 and promised to repay it with a payment at the end of each year for 30 years.  \n The amount of each of the first ten payments equals the amount of interest due. The amount of each of the next ten payments equals 150% of the amount of interest due. The amount of each of the last ten payments is X . \n The lender charges interest at an annual effective rate of 10%.  \n Calculate X . \n (A) 3,204 \n(B) 5,675 (C) 7,073 (D) 9,744 \n(E) 11,746 \n  126. A borrower takes out a loan of 4000 at an annual effective interest rate of 6%.  Starting at the end of the fifth year, the loan is repaid by annual payments, each of which equals 600 except for a final balloon payment that is less than 1000.  Calculate the final balloon payment.  \n (A) 616 \n(B) 639 (C) 642 (D) 688",
    "page_number": "64"
  },
  "127": {
    "content": "A loan of 20,000 is repaid by a payment of X  at the end of each year for 10 years.  The loan has \nan annual effective interest rate of 11% for the first five years and 12% thereafter.  Calculate X . \n (A) 2739.5 \n(B) 3078.5 (C) 3427.5 (D) 3467.5 \n(E) 3484.5 \n  128. A 16 -year loan of L  is repaid with a payment at the end of each year.  During the first eight years, \nthe payment is 100. During the final eight years, the payment is 300. Interest is charged on the \nloan at an annual effective rate of i , such that  \n81/ (1 ) 0.3. i+>  \n \nAfter the first payment of 100 is made, the outstanding principal is L  + 25. \n Calculate the outstanding balance on the loan immediately after the eighth annual payment of 100 has been made.  (A) 1660 \n(B) 1760 (C) 1870 (D) 1970",
    "page_number": "66"
  },
  "129": {
    "content": "An entrepreneur takes out a business loan for 60,000 with a nominal annual interest rate compounded monthly. The loan is scheduled to be paid off with level monthly payments, plus a final drop payment. All payments will be made at the end of the month.  \n The principal portion of the payment is 1,400 for the first month and 1,414 for the second month.  Calculate the drop payment.  \n (A) 780 \n(B) 788 (C) 1183 (D) 1676",
    "page_number": "67"
  },
  "130": {
    "content": "A student borrows money to pay for university tuition. He borrows 1000 at the end of each month for four years. No payments are made to repay the loan until the end of five years.  The loan accumulates interest at a 6% nominal interest rate convertible monthly for the first two years and at an 8% nominal interest rate convertible monthly for the following two years.  Calculate the loan balance at the end of four years immediately following the receipt of the final 1000.  (A) 54,098 \n(B) 55,224 (C) 55,762 (D) 56,134 \n(E) 56,350 \n  \n68 131. \nA loan is amortized with level monthly payments at an annual effective interest rate of 10%. The amount of principal repaid in the 6th  month is 500. \n Calculate the principal repaid in the 30th  month. \n (A) 500 \n(B) 555 (C) 605 (D) 705",
    "page_number": null
  },
  "132": {
    "content": "Seth repays a 30 -year lo an with a payment at the end of each year.  Each of the first  20 payments \nis 1200, and each of the last 10 payments is 900. Interest on the loan is at an  annual effective rate \nof i, i > 0. The interest portion of the 11th  payment is twice the  interest portion of the 21st  \npayment.  Calculate the interest portion of the 21st  payment. \n (A) 250 \n(B) 275 (C) 300 (D) 325 \n(E) There is not enough information to calculate the interest portion of the 21st  payment. \n   \n69 133. \nJohn took out a 20-year loan of 85,000 on July 1, 2005 at an annual nominal interest rate of 6% compounded monthly. The  loan was to be paid by level monthly payments at the end of each \nmonth with the first payment on July 31, 2005.  Right after the regular monthly payment on June 30, 2009, John refinanced the loan at a new annual nominal rate of 5.40% compounded monthly, and the remaining balance will be paid with monthly payments beginning July 31, 2009. The amount of each payment is 500 except for a final drop payment.   Calculate the date of John’s last payment.  \n (A) July 31, 2022 \n(B) April 30, 2030 (C) May 31, 2030 (D) April 30, 2031 \n(E) May 31, 2031 \n  134. A 25 -year loan is being repaid with annual payments of 1300 at an annual effective rate of \ninterest of 7%.  The borrower pays an additional 2600 at the time of the 5th payment and wants to \nrepay the remaining balance over 15 years.  Calculate the revised annual payment.  \n (A) 1054.58 \n(B) 1226.65 (C) 1300.00 (D) 1369.38 \n(E) 1512.12 \n   \n70 135. \nA 1000- par value 30 -year bond has an annual coupon rate of 7% paid semiannually. After an \ninitial 10 -year period of call protection, the bond is callable immediately following the payment \nof any of the 20th  through the 59th  coupons.  \ni) If the bond is called before payment of the 40th coupon, the redemption value is \n1250. \nii) If the bond is called immediately after the payment of any of the 40th  through the \n59th coupons, the redemption value is 1125. \niii) If the bond is not called, it will be redeemed at par. \n To ensure that the bond will provide at least an annual nominal yield rate of 5% convertible semiannually, it must be assumed that the bond will be called or redeemed immediately after the payment of the nth  coupon. \n Calculate n.  (A) 20 \n(B) 39 (C) 40 (D) 59",
    "page_number": null
  },
  "136": {
    "content": "Bond X is a 20-year bond with annual coupons and the following characteristics: \ni) Par value is 1000. \nii) The annual coupon rate is 10%. \niii) Bond X is callable at par  on any of the last five coupon dates. \n Calculate the maximum purchase price for Bond X that will guarantee an annual effective yield rate of at least 5%.  \n \n(A) 1519 \n(B) 1542 (C) 1570 (D) 1596",
    "page_number": null
  },
  "137": {
    "content": "A life insurance company invests two million in a 10- year zero -coupon bond and four million in \na 30-year zero -coupon bond. The annual effective yield rate for both bonds is 8%. \n When the 10-year bond matures, the company reinvests the proceeds in another 10- year zero -\ncoupon bond. At that time the bond yield rate is 12% annual effective.   \n After 20 years from the initial investment, the 30 -year bond is sold to yield an annual effective \nrate of 10% to the buyer. The maturity of the second 10-year bond and the sale of the 30- year \nbond result in a gain of X  on the company’s initial investment of six million.  \n Calculate X . \n (A) 23 million  \n(B) 29 million  \n(C) 32 million  \n(D) 34 million  \n(E) 42 million  \n  138. You are given the following information about a 20-year bond with face amount 7500: \ni) The bond has an annual coupon rate of 7.4% paid semiannually. \nii) The purchase price results in an annual nominal yield rate to the inves tor of  5.3% \nconvertible semiannually. \niii) The amount for amortization of premium in the fourth coupon payment is 28.31.  \n Calculate the redemption value of the bond.  (A) 7660 \n(B) 7733 (C) 7795 (D) 7879",
    "page_number": "71"
  },
  "139": {
    "content": "Claire purchases an eight -year callable bond with a 10% annual coupon rate payable \nsemiannually. The bond has a face value of 3000 and a redemption value of 2800.  The purchase price assumes the bond is called at the end of the fourth year for 2900, and provides an annual effective yield of 10.0%.   Immediately after the first coupon payment is received, the bond is called for 2960. Claire’s annual effective yield rate is i .  \n Calculate i . \n (A) 9.8% \n(B) 10.1% (C) 10.8% (D) 11.1% \n(E) 11.8% \n  140. You are given the following information about a 20-year bond with face amount 1000: \ni) The bond has an annual coupon rate of r  payable semiannually  and is redeemable \nat par.   \nii) The nominal annual yield rate convertible semiannually is 7.2%. \niii) The amount for accumulation of discount in the seventh coupon payment is 4.36. \n Calculate r . \n (A) 2.1% \n(B) 4.0% (C) 4.3% (D) 6.0% \n(E) 6.9% \n   \n73 141. \nBond A and Bond B are both annual coupon, five-year, 10,000 par value bonds bought to yield an annual effective rate of 4%.  \ni) Bond A has an annual coupon rate of r %, a redemption value that is 10% below \npar, and a price of P . \nii) Bond B has an annual coupon rate of ( r+1)%, a redemption value that is 10% \nabove par, and a price of 1.2P . \n Calculate r %.  \n \n(A) 5.85% \n(B) 6.85% (C) 7.85% (D) 8.85% \n(E) 9.85% \n  142. You are given the following information about an n-year bond, where n > 10:  \ni) The bond pays 8% semiannual coupons and has face amount 1000. \nii) The bond is redeemable at par. \niii) The bond is callable at par 5 years after issue or 10 years after issue.  \niv) P is the price to guarantee a yield of 6.8% convertible semiannually and Q  is the \nprice to guarantee a yield of 8.8% convertible semiannually. \nv) | P – Q| = 123.36. \n Calculate n.  (A) 11 \n(B) 15 (C) 19 (D) 22",
    "page_number": "72"
  },
  "143": {
    "content": "An insurer enters into a four-year contract today. The contract requires the insured to deposit 500 into a fund that earns an annual effective rate of 5.0%, and from which all claims will be paid.  \nThe insurer expects that 100 in claims will be paid at the end of each year, for the next four years.  At the end of the fourth year, after all claims are paid, the insurer is required to return 75% \nof the remaining fund balance to the insured.  To issue this policy, the insurer incurs 100 in expenses today. It also collects a fee of 125 at the \nend of two years.  Calculate the insurer’s yield rate.  \n (A)  9% \n(B) 24% (C) 39% (D) 54% \n(E) 69% \n  144. An investor buys a perpetuity-immediate providing annual payments of 1, with an annual effective interest rate of i  and Macaulay duration of 17.6 years. \n Calculate the Macaulay duration in years using an annual effective interest rate of 2 i instead of i . \n (A)  8.8 \n(B)  9.3 (C)  9.8 (D) 34.2 \n(E) 35.2 \n   \n75 145. \nAn investor purchases two bonds. The bonds have the same annual effective yield rate i , with  \ni > 0. \n With respect to the annual effective yield rate, their modified durations are a years and b years, \nwith 0 < a < b.  \n One of these two bonds has a Macaulay duration of c years, with a < c  < b. \n Determine which of the following is an expression, in years, for the Macaulay duration of the other bond.  (A) bc/a \n(B) ac/b \n(C) ab/c \n(D) b + c  – a \n(E) a + c  – b  \n  \n146. A 20 -year bond priced to have an annual effective yield of 10% has a Macaulay duration of 11. \nImmediately after the bond is priced, the market yield rate increases by 0.25%. The bond's approximate percentage price change, using a first -order Macaulay approximation, is X . \n Calculate X . \n (A) –2.22% \n(B) –2.47% (C) –2.50% (D) –2.62% \n(E) –2.75% \n   \n76 147. \nDetermine which of the following statements regarding asset- liability management techniques is \ntrue. \n (A) Redington immunization requires that the convexity of the liabilities is greater than the \nconvexity of the assets. \n(B) An advantage of the Redington immunization technique over the cash- flow matching \ntechnique is that the portfolio manager has more investment choices available.  \n(C) Both Redington immunization and full immunization are based on the assumption that \nthe yield curve has higher yields for longer term investments. \n(D) A fully immunized portfolio ensures that the present value of assets will exceed the \npresent value of liabilities with non -parallel shifts in the yield curve.  \n(E) A cash -flow matched portfolio requires less rebalancing than a Redington immunized \nportfolio, but more rebalancing than a fully immunized portfolio. \n  148. A company has liabilities that require it to make payments of 1000 at the end of each of the next five years.  The only investments available to the company are as follows: \n Investment  Price Subsequent Cash Flows  \nJ  1500 500 at the end of each year for 5 years K  500 1000 at the end of year 5 L  1000 500 at the end of each year for 4 years M  4000 1000 at the end of each year for 5 years  The company is able to purchase as many of each investment as it wants , but only in whole units. \nThe company’s investment objective is to be fully immunized over the next five years.  Calculate the lowest possible cost to achieve this objective.  \n (A) 1500 \n(B) 2000 (C) 2500 (D) 3000",
    "page_number": "74"
  },
  "149": {
    "content": "A railroad company is required to pay 79,860, which is due three years from now. The company invests 15,000 in a bond with modified duration 1.80, and 45,000 in a bond with modified duration D mod, to Redington immunize its position against small changes in the yield rate. \n The annual effective yield rate for each of the bonds is 10%.  Calculate D mod. \n (A) 2.73 \n(B) 3.04 (C) 3.34 (D) 3.40 \n(E) 3.65 \n  150. A company must pay liabilities of 1000 at the end of year 1 and X  at the end of year 2.  \nThe only investments available are:  \n i) One-year zero -coupon bonds with an annual effective yield of 5%  \n ii) Two-year bonds with a par value of 1000 and 10% annual coupons, with   \n  an annual effective yield of 6%  The company constructed a portfolio that creates an exact cash flow matching strategy for these liabilities. The total purchase price of this portfolio is 1783.76.  Calculate the amount invested in the one- year zero -coupon bonds. \n (A) 784 \n(B) 831 (C) 871 (D) 915",
    "page_number": "77"
  },
  "151": {
    "content": "A company must pay liabilities of 4000 and 6000 at the end of years one and two, respectively. The only investments available to the company are one- year zero -coupon bonds with an annual \neffective yield of 8% and two- year zero -coupon bonds with an annual effective yield of 11%. \n Determine how much the company must invest today to exactly match its liabilities.  \n (A) 8,473 \n(B) 8,573 (C) 8,848 (D) 9,109 \n(E) 10,000 \n  152. A 20 -year bond priced to have an annual effective yield of 10% has a Macaulay duration of 11. \nImmediately after the bond is priced, the market yield rate increases by 0.25%. The bond's approximate percentage price change, using a first -order modified  approximation, is X . \n Calculate X . \n \n(A) –2.22% \n(B) –2.47% (C) –2.50% (D) –2.62% \n(E)  –2.75% \n   \n79 153. \nKrishna buys an n-year 1000 bond at par. The Macaulay duration is 7.959 years using an annual effective interest rate of 7.2%.  \n Calculate the estimated price of the bond, using the first -order Macaulay approximation, if the \ninterest rate rises to 8.0%.  \n (A) 940.60 \n(B) 942.54 (C) 944.56 (D) 947.03 (E) 948.47   154. A bond has a modified duration of 8 and a price of 112,955 calculated using an annual effective interest rate of 6.4%.  \n \nMACE  is the estimated price of this bond at an interest rate of 7.0% using the first- order Macaulay \napproximation.  \nMODE  is the estimated price of this bond at an interest rate  of 7.0% using the first- order m odified \napproximation.  \nCalculate \nMAC MODEE− . \n \n(A)  91 (B) 102 (C) 116 (D) 127",
    "page_number": "78"
  },
  "155": {
    "content": "SOA Life Insurance Life Insurance Company has a portfolio of two bonds: \n• Bond 1 is a bond with a Macaulay duration of 7.28 and a price of 35,000; and \n• Bond 2 is a bond with a Macaulay duration of 12.74 and a price of 65,000. \n The price and Macaulay duration for both bonds were calculated using an annual effective interest rate of 4.32%.  Bailey estimates the value of this portfolio at an interest rate of i  using the first- order Macaulay \napproximation to be 105,000.  Determine i . \n (A) 3.49% (B) 3.62% (C) 3.85% (D) 3.92% (E) 4.03%   156. Graham is the beneficiary of an annuity due. At an annual effective interest rate of 5%, the \npresent value of payments is 123,000 and the modified duration is \nMODD . \n \nTyler uses the first -order Macaulay approximation to estimate the present value of Graham’s \nannuity due at an annual effective interest rate was 5.4%.  Tyler estimates the present value to be \n121,212.  \nCalculate \nMODD , the modified duration of Graham’s annuity at 5% . \n \n(A) 3.67 (B) 3.75 (C) 3.85 (D) 3.95 (E) 4.04    \n81 157. \nA company owes 1000 one year from now and 1000 two years from now. Which of the following demonstrates a strategy to use exact cash -flow matching between assets \nand liabilities?  \n I. The company purchases a one- year zero -coupon bond and a two- year zero -coupon bond, \neach with a face amount of 1000. \nII. The company deposits 1859.41 into an account that currently earns an annual effective \ninterest rate of 5% that is subject to change in one year.  \nIII. The company purchases an asset that has the same duration as the liabilities and a larger convexity.  \n (A) I only \n(B) II only  \n(C) III only  \n(D) I, II, and III  \n(E) The correct answer is not given by (A), (B), (C) or (D). \n  158. Two 15-year par value bonds, X and Y, each pay an annual coupon of 200 at the end of the year. The face amount of Bond X is one-half the face amount of Bond Y.  At an annual effective yield of i , the price of Bond X is 2695.39 and the price of Bond Y is \n3490.78.  Calculate the coupon rate for Bond X.  (A) 6.3% \n(B) 7.4% (C) 8.8% (D) 10.0% \n(E) 11.4% \n  \n82 159. \nBank P offers a 3 -year certificate of deposit that pays an annual effective interest rate of 4%.  In \naddition, a bonus of 2% of the initial investment is paid at the end of the 3-year period.  Bank Q offers a 3 -year certificate of deposit without any bonus. \n Calculate the annual effective interest rate that Bank Q would have to offer to produce the same annual yield as the certificate from Bank P.  \n (A) 4.3% \n(B) 4.4% (C) 4.5% (D) 4.6% \n(E) 4.7% \n  \n160. A 20 -year arithmetically increasing annuity -due sells for 600,000 and provides annual payments. \nThe first payment is X , and each payment thereafter is X  more than the previous payment. \n A 25- year arithmetically increasing annuity -due provides annual payments. The first payment is \nX, and each payment thereafter is X  more than the previous payment. \n The prices of the two annuities are calculated using a continuously compounded annual interest rate of 6%.  \n Calculate the price of the 25 -year annuity. \n (A) 667,026 \n(B) 668,707 (C) 750,000 (D) 779,336 \n(E) 782,712 \n  \n83 161. \nA small business takes out a 10-year loan with level end-of-quarter payments. The payments are based on an annual nominal interest rate of 12% convertible quarterly.  The amount of principal repaid in the 15\nth payment is 10,030.27. \n Calculate the amount of interest paid in the 25\nth payment. \n (A) 7,521 \n(B) 8,151 (C) 9,467 (D) 10,030 \n(E) 11,601 \n  162. Trish had a loan with a balance of 4000 at the beginning of month 1. Starting with month 1, and every month thereafter, she made a payment of X  in the middle of the month. At the beginning of \nmonth 4, and every 6 months thereafter, she borrowed an additional 800.   Trish’s loan balance became 4000 again at the end of month 36.  The annual nominal interest rate for the loan is 26.4%, convertible quarterly.  Determine which of the following is an equation of value that can be used to solve for X . \n \n(A) \n6 36\n2 1 0.5\n11 3800\n0.26400.2640 1144nn\nnnX\n−−\n= ==\n + + ∑∑  \n(B) 6 36\n6 3 0.5\n11800\n0.2640 0.26401112 12nn\nnnX\n−−\n= ==\n ++  ∑∑  \n(C) 6 36\n6 2 12\n11 33800 40004000\n0.26400.2640 0.2640 111444nn\nnnX\n−\n= =+= +\n  + ++   ∑∑  \n(D) 6 36\n6 3 36 0.5\n11800 40004000\n0.2640 0.2640 0.264011 112 12 12nn\nnnX\n−−\n= =+= +\n  ++ +    ∑∑  \n(E) 6 36\n2 1 12 0.5\n11 3800 40004000\n0.2640 0.26400.2640 111444nn\nnnX\n−−\n= =+= +\n  ++  +  ∑∑  \n  \n84 163. \nA bank issues two 20-year bonds, A and B, each with annual coupons, an annual effective yield rate of 10%, and a face amount of 1000. The total combined price of these two bonds is 1600.  Bond B's annual coupon rate is equal to Bond A's annual coupon rate plus 1 percentage point.  Calculate the annual coupon rate of Bond A.  (A) 6.46% \n(B) 7.15% (C) 7.29% (D) 8.02% \n(E) 8.90% \n  164. An annuity provides level payments of 1000 every six months for a fixed period.   Using an annual effective interest rate of i , the future value of this annuity at the time of the last \npayment is 19,549.25 and the present value of this annuity at the time of the first payment is 7,968.89.   Calculate i . \n (A) 7.4% \n(B) 8.5% (C) 15.4% (D) 17.0% \n(E) 17.7%  \n  \n85 165. \nAn annuity provides the following payments: \ni) X at the beginning of each year for 20 years, starting today \nii) 4X at the beginning of each year for 30 years, starting 20 years from today \n Calculate the Macaulay duration of this annuity using an annual effective interest rate of 2%.  (A) 27.32 \n(B) 27.87 (C) 28.30 (D) 33.53 \n(E) 35.41 \n  166. An investor deposits 100 into a bank account at time 0. The bank credits interest at an annual nominal interest rate of i , compounded semi-annually. \n The total amount of interest credited in the twelfth year is twice the amount of interest credited in the fifth year.  \n Calculate i . \n (A) 10.15% \n(B) 10.24% (C) 10.32% (D) 10.41% \n(E) 10.48% \n \n  \n86 167. \nLet A and B be bonds with semiannual coupons as described in the table below:  \n \nBond  Price  Annual  \ncoupon rate  Par Years to  \nredemption  Annual nominal yield rate  \nconvertible semiannually  \nA X 8% 1000  5 6% \nB X y 1000  5 7% \n \nCalculate y . \n \n(A) 8.45% \n(B) 8.65% (C) 8.85% (D) 9.05% \n(E) 9.25% \n  \n168. A borrower takes out a 15- year loan at an annual effective interest rate of i  with payments of 50 \nat the end of each year.  \n The borrower decides to pay off the loan early by making extra payments of 30 with each of the sixth through tenth regularly scheduled payments. As a result, the loan will be paid off at the end of 10 years (instead of 15).  Determine which of the following equations of value is correct.  \n(A) \n15 10 550 50 30aaa= +  \n(B) 15 10 550 50 30sss= +  \n(C) 5\n15 10 550 50 30vs s s= +  \n(D) 5\n15 10 550 50 30s s vs= +",
    "page_number": "80"
  },
  "169": {
    "content": "A borrower takes out a loan to be repaid over 20 years. The first payment is 1102 payable at the end of the first month. Each subsequent monthly payment is five more than the previous month’s payment.  Calculate the accumulated value of the payments at the end of 15 years using an annual effective interest rate of 6.5%.  \n (A) 442,031 \n(B) 443,525 (C) 445,578 (D) 447,287 \n(E) 448,547 \n  170. Fund J begins with a balance of 20,000 and earns an annual effective rate of 6.5%. At the end of each year, the interest earned and an additional 1000 is withdrawn from the fund so that by the end of the 20th year, the fund is depleted.  The annual withdrawals of interest and principal are deposited into Fund K, which earns an annual effective rate of 8.25%.  At the end of the 20\nth year, the accumulated value of Fund K is x . \n Calculate x . \n (A) 39,332 \n(B) 54,818 (C) 84,593 (D) 86,902 \n(E) 97,631 \n \n  \n88 171. \nCompany Q invests X at the end of each year for 25 years at an annual effective interest rate of 9%. Company R invests 100 at the end of each year for 25 years at an annual effective interest \nrate of 9%, but, at the end of each year, the interest earned is reinvested at an annual effective interest rate of 8%.  \n Immediately after the 25\nth payment, Company R’s total investment, including the reinvested \ninterest, has the same value as Company Q’s investment.  \n Calculate X . \n (A) 91.22 \n(B) 91.93 (C) 92.67 (D) 93.41 \n(E) 94.03 \n  172. Fund X receives a deposit of 1000 at time 0 . Fund X accumulates at a nominal rate of interest k , \ncompounded semiannually.  Fund Y receives a deposit of 921.90 at time 0. Fund Y accumulates at a nominal rate of discount, also equal to k , compounded semiannually. \n At the end of 5 years, the accumulated amount in Fund X and the accumulated amount  in Fund Y are both equal to P . \n Calculate P . \n (A) 1820 \n(B) 1970 (C) 2100 (D) 2240",
    "page_number": "87"
  },
  "173": {
    "content": "The present value of a perpetuity-due with payments of X  at the beginning of each 3-year period \nwith an annual effective interest rate of 7% is 735.  Calculate X . \n (A) 135 \n(B) 138 (C) 141 (D) 144",
    "page_number": "89"
  },
  "174": {
    "content": "The present value of a perpetuity- immediate with a first payment of P  and successive annual \nincreases of 9 at an annual effective interest rate of 6% is 2600.  \n Calculate P . \n (A) 5.50 \n(B) 6.00 (C) 6.50 (D) 7.00 \n(E) 7.50 \n \n  \n90 175. \nThe following two annuities- immediate have the same present value at an annual effective \ninterest rate of i , i > 0.  \ni) A ten -year annuity with annual payments of 475. \nii) A perpetuity with annual payments of 400 in years 1- 5, zero in years 6 -10, and \n400 in years 11 and beyond. \n Calculate i .  \n (A) 10.65% \n(B) 10.75% (C) 10.85% (D) 10.95% \n(E) 11.05% \n  176. A two -year loan of 100 is repaid with a payment of X  at the end of the first year and 2 X at the \nend of the second year. The annual effective interest rate charged by the lender is 8% in the first year and i  in the second year.  The annual effective yield rate for the lender is 10%.  \n Calculate i . \n (A) 12.8% \n(B) 12.9% (C) 13.0% (D) 13.1% \n(E) 13.2% \n \n  \n91 177. \nA ten -year loan will be repaid with payments at the end of each year.  Each of the first five \npayments is 1000 and each of the next five payments is 2000.  Interest on the loan is charged at an annual effective rate of 10%.  \n Calculate the total interest paid in the first five payments.  \n (A) 2418 \n(B) 2646 (C) 2978 (D) 4083",
    "page_number": null
  },
  "178": {
    "content": "An investor will accumulate 10,000 at the end of ten years by making level deposits of X at the beginning of each year. The deposits earn 12% simple interest at the end of every year but the interest is reinvested at an annual effective rate of 8%.  \n Calculate X . \n (A) 508.79 \n(B) 541.47 (C) 569.84 (D) 597.73 \n(E) 608.42 \n \n  \n92 179. \nAn investment of 10,000 produces a series of 30 annual payments. The first payment of X  is \nmade one year after the investment is made . Each successive payment decreases by 5 from the \nprevious payment.  At an annual effective interest rate of 5%, calculate X . \n (A) 685 \n(B) 695 (C) 705 (D) 715",
    "page_number": null
  },
  "0": {
    "content": "A company is considering a project that will require an initial investment of 600 and additional investments of 100 and 50 at the end of years one and two, respectively. It is expected that \nrevenue from this project will be 150 per year for five years, beginning one year from the initial investment.  \n Assuming an annual effective rate of 15%, calculate the net present value of this project.  (A) –222 \n(B) –134 (C) 0 (D) 134",
    "page_number": "18"
  },
  "181": {
    "content": "Determine w hich of the following conditions are necessary for an immunization strategy. \n \nI. The present value of the cash inflow from the assets is equal to the present value \nof the cash outflow from the liabilities.  \nII. The price sensitivity to changes in interest rates is greater for assets than for liabilities.  \nIII. The convexity of assets is less than the convexity of liabilities. \n (A) I only \n(B) II only  \n(C) III only  \n(D) I, II, and III  \n(E) The correct answer is not given by (A), (B), (C), or (D). \n  182. Four annual tuition payments of 25,000 are to be paid at a future date.  The payments will be funded by investing 1000 at the beginning of each month. The last deposit will be made six months before the first tuition payment.  Interest is payable at a nominal interest \nrate of 6% convertible monthly.  Calculate the minimum number of monthly deposits required to fund the total tuition.  (A) 70 \n(B) 71 (C) 73 (D) 74 \n(E) There is not enough information to calculate the minimum number of monthly deposits. \n   \n94 183. \nConsider a 7- year loan to be repaid with equal payments made at the end of each year.  The \nannual effective interest rate is 10%.   \n Calculate the Macaulay duration of the loan payments.  (A) 3.15 \n(B) 3.29 (C) 3.40 (D) 3.50 \n(E) 3.62 \n  184. A company has liabilities of 402.11 due at the end of each of the next three years.  The company will match the duration of its liabilities by investing a total of 1000 in one-year and three- year zero -coupon bonds. The annual effective yield of both bonds is 10%. \n Calculate the amount the company will invest in one-year bonds.   (A) 366 \n(B) 402 (C) 442 (D) 500",
    "page_number": "93"
  },
  "185": {
    "content": "A trucking company with assets and liabilities needs to choose between various ten- year par \nvalue bonds each with 8% annual effective yield rate and annual coupons. The bonds have varying face values and varying coupon rates.   The company wants to analyze the effects of face value and coupon rate changes on Macaulay duration of these bonds, in order to choose an investment strategy that immunizes its position.  Determine which of the following statements is true about the separate effects of face value and coupon rate changes on the duration of these bonds.  (A) Macaulay duration increases as face value increases, and increases as coupon  rate \nincreases.  \n(B) Macaulay duration increases as face value increases, and decreases as coupon rate increases.  \n(C) Macaulay duration remains constant as face value increases, and increases as coupon rate increases.  \n(D) Macaulay duration remains constant as face value increases, and remains constant as coupon rate increases.  \n(E) Macaulay duration remains constant as face value increases, and decreases as coupon rate increases.  \n   \n96 186. \nA corporation makes a payment at the end of each month into a savings account that offers an annual nominal interest rate of 8% compounded quarterly.  Determine the equivalent effective rate of interest per payment period.  \n(A) \n1/38%114+− \n(B) 8%1112+− \n(C) 38%1112+− \n(D) 128%1112+− \n(E) 48%114+− \n  \n187. A mortgage for 125,000 has level payments at the end of each month and an annual nominal \ninterest rate compounded monthly. The balances owed immediately after the first and second payments were 124,750 and 124,498, respectively.  Calculate the number of payments needed to pay off the mortgage.  (A) 198 \n(B) 199 (C) 200 (D) 201",
    "page_number": "95"
  },
  "188": {
    "content": "A company is required to pay 500,000 ten years from now and 500,000 fifteen years from now. The company needs to create an investment portfolio using 5-year and 20- year zero -coupon \nbonds, so that, using a 7% annual force of interest, the present value and Macaulay duration of its assets match those of its liabilities.  \n Calculate the amount invested today in each bond.  (A) 211,631 for the 5-year bond and 211,631 for the 20-year bond \n(B) 217,699 for the 5-year bond and 217,699 for the 20-year bond (C) 223,852 for the 5 -year bond and 199,410 for the 20-year bond \n(D) 229,857 for the 5-year bond and 205,540 for the 20-year bond \n(E) 248,293 for the 5-year bond and 174,969 for the 20 -year bond \n  189. A bond with a face value of 1000 and a redemption value of 1080 has an annual coupon rate of 8% payable semiannually. The bond is bought to yield an annual nominal rate of 10% convertible semiannually.  At this yield rate, the present value of the redemption value is 601 on the purchase date.  Calculate the purchase price of the bond.  (A) 911 \n(B) 923 (C) 956 (D) 974",
    "page_number": "97"
  },
  "190": {
    "content": "A loan of 10,000 is being repaid by payments of 1,000 at the end of each quarter for as long as necessary, plus a drop payment.  The annual nominal rate of interest on the loan is 16% convertible quarterly.  Calculate the amount of interest in the tenth payment.  (A)  112 \n(B)  146 (C)  179 (D)  233",
    "page_number": "98"
  },
  "191": {
    "content": "A five -year loan has  an annual nominal interest rate of 30%, convertible monthly. The loan is \nscheduled to be repaid with level monthly payments of 500, beginning one month after the date of the loan.   The borrower misses the thirteenth through the eighteenth payments, but increases the next six payments to X  so that the final 36 payments of 500 will repay the loan.  \n Calculate X . \n (A) 1070 \n(B) 1075 \n(C) 1080 \n(D) 1150",
    "page_number": null
  },
  "192": {
    "content": "A construction firm is facing three liabilities of 1000, due at times  1, 2, and 3 in years . There are \nthree bonds available to match these liabilities, as follows: Bond I A bond due at the end of period 1 with a coupon rate of 1% per year, valued at a \nannual effective yield rate of 14% . \nBond II  A bond due at the end of period 2 with a coupon rate of 2% per year, valued at a \nannual effective yield rate of 15% . \nBond III A zero -coupon bond due at time  3 valued at a periodic effective yield rate of 18% . \n Calculate the face value of each bond that should be purchased to exactly match the liabilities.  \n  Bond I Bond II Bond III \n(A) 970.68 980.39 1000.00  \n(B) 970.68 1000.00 980.39 (C) 980.39 970.68 1000.00 (D) 1000.00 980.39 970.68 \n(E) 1000.00 1000.00 1000.00 \n  193. An institute has provided an early retirement incentive package to a 60- year-old retiree that pays \n12,000 per year at the end of each year up to and including age 65, plus a lump sum payment of 150,000 at age 65. All payments are guaranteed whether or not the retiree is alive at age 65. The institute will create a portfolio of two five -year bonds to exactly match the payments under \nthis package.  \nThe first bond has a face amount of 100,000 and an annual coupon rate of 10%.  Determine which of the following second bonds will exactly match the liability.  \n (A) A bond with a price of 42,015, an annual coupon rate of 4% and annual effective yield of \n8%. \n(B) A bond with a price of 50,000, an annual coupon rate of 4% and annual effective yield of \n8%. \n(C) A bond with a price of 41,588, an annual coupon rate of 8% and annual effective yield of \n10%. \n(D) A bond with a price of 50,000, an annual coupon rate of 8% and annual effective yield of \n10%. \n(E) A bond with a price of 55,451, an annual coupon rate of 8% and annual effective yield of \n10%. \n   \n100 194. \nYou are given the following information about a 30-year bond: \ni) The par value is 2000. \nii) The redemption value is 2250. \niii) Coupons are paid annually. \niv) The annual coupon rate is twice the annual yield rate. v) The purchase price is 3609.29. vi) Based on the yield rate, the Macaulay duration of the bond is 14.41 years. \n Calculate the modified duration of the bond, based on the yield rate.  (A) 12.40 years \n(B) 13.07 years (C) 13.71 years (D) 14.41 years \n(E) 15.15 years \n  195. A company’s preferred stock will pay level annual dividends forever starting five years from now.   Using an annual effective interest rate of 10%, the modified duration of the stock is D . \n Calculate D . \n (A) 13.64 \n(B) 14.55 (C) 15.00 (D) 16.00 \n(E) 16.50 \n  \n101 196. \nA three-year bond with a face value of 1000 pays coupons semiannually. The bond is redeemable at face value.  It is bought at issue at a price to produce an annual yield rate of 10% convertible \nsemiannually. If the term of the bond is doubled and the yield rate remains the same, the purchase price would decrease by 49.   Calculate the amount of a coupon.  (A) 37 \n(B) 46 (C) 54 (D) 63",
    "page_number": "99"
  },
  "197": {
    "content": "Three asset -liability cash flows are given in the following table where a positive amount is an \nasset cash flow and a negative amount is a liability due at the corresponding time.  \nt (in years)  0 1 2 3 \nX 102,400  −192,000  0 100,000  \nY 158,400  −342,000  100,000  100,000  \nZ −89,600  288,000  100,000  -300,000  \n Determine which set of cash flows is Redington immunized for an annual effective interest rate of i = 25%. \n (A) X only \n(B) Y only \n(C) Z only \n(D) X, Y, and Z \n(E) The correct answer is not given by (A), (B), (C) or (D). \n  \n102 198. \nA ten -year 1000 par value bond with coupons paid annually at an annual rate of r  is callable at \npar at the end of the 6th, 7th, 8th, or 9th year.   \nThe price of the bond is 1023.  If the bond is called in the worst-case scenario for the bond investor, the resulting annual effective yield rate, i , is 96% of r . \n Calculate i . \n (A) 4.41% \n(B) 7.46% (C) 8.36% (D) 10.56% \n(E) 14.32% \n  199. Determine which of the following statements regarding the Redington immunization technique is false.  \n (A) This technique assumes that the yield curve is flat. \n(B) This technique assumes that only parallel shifts in the yield curve are allowed. (C) This technique is designed to work only for small changes in the interest rate. (D) The modified duration of the assets must equal the modified duration of the liabilities. \n(E) The convexity of the assets must equal the convexity of the liabilities. \n   \n103 200. \nPayments are made to an account at a continuous rate of 0.5100tefrom time t  = 1 to time t  = 3. \nThe force of interest for this account is 8%δ= . \n \nCalculate the value of the account at time t  = 4. \n (A) 313 \n(B) 432 (C) 477 (D) 606",
    "page_number": null
  },
  "201": {
    "content": "You are given the following information about a perpetuity with annual payments:  i) The first 15 payments are each 2500, with the first payment to be made three years from \nnow. \nii) Beginning with the 16\nth payment, each payment is k% larger than the previous payment. \niii) Using an annual effective interest rate of 3.5%, the present value of the p erpetuity is \n115,000. \n Calculate k . \n (A) 1.66 \n(B) 1.74 (C) 1.78 (D) 1.83 \n(E) 1.89 \n  \n104 202. \nAn insurance company sells an annuity that provides 20 annual payments, with the first payment beginning one year from today and each subsequent payment 2% greater than the previous payment.   Using an annual effective interest rate of 3%, the present value of the annuity is 200,000.  Calculate the amount of the final payment from this annuity.  (A) 11,282 \n(B) 16,436 (C) 16,765 (D) 19,784 \n(E) 24,162 \n  203. A loan for 10,000 is to be repaid by level annual payments at the end of each year for ten years.  \nThe annual effective interest rate for the loan is 10%, which the bank uses to compute the annual payment and the balance on the loan at the end of each year. However, for balances during each year, the bank uses an annual simple interest rate of 10%.   Calculate the balance of the loan halfway through the fourth year.  (A) 7434 \n(B) 7442 (C) 7885 (D) 8310",
    "page_number": null
  },
  "204": {
    "content": "DELETED  \n 205. A company is required to pay 190,000 in 20.5 years. The company creates an investment portfolio using three bonds with annual coupons, so that its position is Redington immunized based on an annual effective interest rate of 7%.  The table below shows the Macaulay duration \nfor each of the bonds. \n Macaulay Duration  \nBond A  10 years  \nBond B  15 years  \nBond C  30 years  \n The company invests twice as much money in Bond C as in Bond B.  Calculate the amount the company invests in Bond A.  (A) 6,640 \n(B) 8,630 (C) 11,075 (D) 13,308 \n(E) 14,240  \n106 206. \nBond X and Bond Y are n-year bonds with face amount of 10,000 and semiannual coupons, each \nyielding an annual nominal interest rate of 7% convertible semiannually. Bond X has an annual coupon rate of 6% and redemption value c . Bond Y has an annual coupon rate of 5% and \nredemption value c  + 50. The price of Bond X exceeds the price of Bond Y by 969.52. \n Calculate n.  (A) 14 \n(B) 17 (C) 23 (D) 34",
    "page_number": "105"
  },
  "207": {
    "content": "An investor deposited 1000 in each of Bank X and Bank Y. Bank X credits simple interest at an annual rate of 10% for the first five years and 7% thereafter.  Bank Y credits interest at an annual \nnominal rate of 5% compounded quarterly. The interest credited in the eighth year by Bank Y exceeds the interest credited in the eighth year by Bank X by N.   Calculate the absolute value of N . \n (A) 0.36 \n(B) 2.14 (C) 20.00 (D) 56.36 \n(E) 56.93 \n    \n107 208. \nA college has a scholarship fund that pays a sum of money twice a year. The scholarship  will pay \nout 500 at the end of six months and another 500 at the end of one year. Every  year thereafter, \nthe two semi-annual payments will be increased by 10. For example, in year two, both payments will be 510 and in year three both payments will be 520.  The scholarship fund earns interest at an annual effective interest rate of 7.5%.   \n Calculate the fund balance needed today to provide this scholarship indefinitely.  (A) 16,000 \n(B) 16,589 (C) 16,889 (D) 17,134 \n(E) 17,200 \n  209. Sam deposits 5000 at the beginning of each year for ten years. The deposits earn an annual effective interest rate of i . All interest is reinvested at an annual effective interest rate of  5%. \n Sam has 100,000 at the end of ten years.  Calculate i . \n (A) 11.6% \n(B) 15.6% (C) 19.1% (D) 23.2% \n(E) 27.6% \n    \n108 210. \nA loan of 10,000 is repaid at an annual effective interest rate of 8%, with equal payments made \nat the end of each year for ten years. The lender immediately deposits each payment into an  \naccount earning an annual effective interest rate of 10%.  Calculate the total amount of interest earned by the lender during the term of the loan.  (A) 11,589 \n(B) 13,576 (C) 13,751 (D) 14,191 \n(E) 14,903 \n  211. A worker is starting an endowment fund for his charity. The fund will accumulate at a nominal annual interest rate of 12% convertible monthly. Beginning today, the worker will deposit 500 monthly for ten years. No deposits or withdrawals will be made for the subsequent ten years. Exactly twenty years from today, monthly payments of X  will be made to his charity and \ncontinue forever.  Calculate X . \n (A) 3270 \n(B) 3572 (C) 3758 (D) 3796",
    "page_number": null
  },
  "212": {
    "content": "Payments of 1000 at the end of each year are paid on a loan of 12,000. The payments are based on an annual effective interest rate of 10%.  Calculate the outstanding loan balance immediately after the 12\nth payment. \n (A)      909 \n(B) 10,909 (C) 12,853 (D) 16,277 \n(E) 20,043 \n   \n109 213. \nA six -year 1000 face amount bond has an annual coupon rate of 8% semiannually. The bond \ncurrently sells for 911.37.  Calculate the annual effective yield rate.  \n (A)   7.29% \n(B)   8.00% (C)   9.72% (D) 10.00% \n(E) 10.25% \n  214. Matthew deposits 100 into Fund X, which earns a nominal annual rate of discount of 12% convertible quarterly.  At the same time, Sarah deposits 200 into Fund Y, which earns a constant annual force of \ninterest of 0.08.  After n years, the balance of Fund X equals the balance of Fund Y.  Calculate n.  (A) 14.5 \n(B) 16.6 (C) 17.6 (D) 18.1 \n(E) 18.6 \n    \n110 215. \nKevin makes a deposit at the end of each year for 10 years into a fund earning interest at a 4% annual effective rate.  The first deposit is equal to X , with each subsequent deposit 9.2% greater \nthan the previous year’s deposit. The accumulated value of the fund immediately after the 10\nth \ndeposit is 5000.  Calculate X . \n (A) 255 \n(B) 260 (C) 270 (D) 279",
    "page_number": null
  },
  "216": {
    "content": "An investor pays 962.92 for a ten-year bond with an annual coupon rate of 8% paid semiannually. The annual nominal yield rate is 10% convertible semiannually.  Calculate the discount of this purchase.  (A) 117 \n(B) 122 (C) 127 (D) 132",
    "page_number": null
  },
  "217": {
    "content": "An investor makes deposits into an account at the end of each year for ten years. The deposit in year one is 1, year two is 2 and so forth until the final deposit of 10 in year ten. The account pays interest at an annual effective rate of i . \n Immediately following the final deposit, the investor uses the entire account balance to purchase a perpetuity -immediate at an annual effective interest rate of i. The perpetuity makes annual \npayments of 10.   Calculate the purchase price of the perpetuity.  \n  (A) 68.0 \n(B) 72.4 (C) 76.2 (D) 81.3 \n(E) 91.3 \n  218. A 25 -year loan is being repaid with payments of 1300 at the end of each year. The loan payments \nare based on an annual effective interest rate of 8%.   The borrower pays an additional 4000 at the time of the fifth payment and will repay the remaining balance with a payment of X  at the end of each of the subsequent ten years.  \n Calculate X . \n (A)   893 \n(B) 1300 (C) 1306 (D) 1500",
    "page_number": "111"
  },
  "219": {
    "content": "A firm has a liability cash flow of 100 at the end of year two and a second liability cash flow of 200 at the end of year three.   The firm also has asset cash flows of X  at the end of years one and five.   \n Using an annual effective interest rate of 10%, calculate the absolute value of the difference between the Macaulay durations of the asset and liability cash flows.  \n (A) 0.018 \n(B) 0.020 (C) 0.022 (D) 0.024 \n(E) 0.026 \n  220. A bank lends 100,000 to Sam . The loan is repaid with level payments at the end of each year for \n30 years based on an annual effective interest rate of 5%.  \n The bank reinvests the loan payments at an annual effective interest rate of 4%.  Calculate the bank’s annual effective yield rate over the 30 -year period.  \n (A) 4.0% \n(B) 4.1% (C) 4.2% (D) 4.4% \n(E) 4.5% \n  \n113 221. \nA life insurance company sells a two -year immediate annuity with annual payments of 1000 for \na price of 1817.  The investment actuary invests the 1817 in two zero-coupon bonds.  \n● The first bond matures in one year and earns an annual effective interest rate of \n6%. The second bond matures in two years and earns an annual effective interest \nrate of 7%.  \n● 999.35 is invested in the first bond and 817.65 is invested in the second bond. \n● The two bonds are held to maturity. \n As long as the effective annual one- year reinvestment rate is at least X % one year from now, the \nprincipal and interest earned will be sufficient to make the two annuity payments.  Calculate X.  \n (A) 6.0 \n(B) 6.6 (C) 7.0 (D) 7.3 \n(E) 7.7 \n  222. You are given the following term structure of interest rates:  \n   \nLength of \ninvestment \nin years   \nSpot \nrate \n1 7.50%  \n2 8.00%  \n3 8.50%  \n4 9.00%  \n5 9.50%  \n Calculate the one- year annual effective rate for the fifth year implied by this term structure.  \n (A)   9.0% \n(B)   9.5% (C) 10.0% (D) 10.5% \n(E) 11.5% \n  \n114 223. \nDetermine which of the following expressions represents the modified duration for a zero-coupon bond that is currently priced at an annual effective yield rate i  and an n-year maturity.  \n (A) n \n(B) \n( )1ni+ \n(C) ( )11ni−+  \n(D) ( )\n( )1\n11\n1nt\nt\nnt\ntti\ni−\n=\n=+\n+∑\n∑ \n(E) ( )\n( )1\n11\n1nt\nt\nnt\ntti\ni−\n=\n−\n=+\n+∑\n∑ \n  224. A company has liabilities of 1000 due at the end of each of the next three years. The company will exactly match the cash flows of assets and liabilities.  The following zero-coupon bonds are \navailable:  \n   \nMaturity  Yield  \n1-Year  8% \n2-Year  9% \n3-Year  10% \n \nCalculate how much more will be invested in the 1-year bond than in the 3-year bond.  (A)     0 \n(B)   84 (C) 132 (D) 158",
    "page_number": "112"
  },
  "225": {
    "content": "The table below shows the cash flows for a particular investment and the prevailing spot rates.  \n \nn Cash flow  \n(at end of year n) n- year \nSpot rate  \n1 10 4.0%  \n2 12 4.5%  \n3 15 5.5%  \n4 20 7.0%  \n Calculate the present value of this investment at the start of year 1.  \n (A) 47.33 \n(B) 48.64 (C) 49.50 (D) 50.04 \n(E) 51.14 \n  226. The price of a 36 -year zero -coupon bond is 80% of its face value.   \n A second bond, with the same price, same face value, and same annual effective yield rate, offers \nannual coupons with the coupon rate equal to \n4\n9 of the annual effective yield rate.   \n \nCalculate the number of years until maturity for the second bond.  (A) 45 \n(B) 54 (C) 63 (D) 72",
    "page_number": "115"
  },
  "227": {
    "content": "An investor purchases a 1200 face amount zero-coupon bond for a price of 1000. With respect to the bond’s annual effective yield rate, the Macaulay duration is four years and the modified duration is d years.  \n Calculate d.  (A) 3.33 \n(B) 3.82 (C) 3.86 (D) 4.00 \n(E) 4.19 \n  228. An insurer has a liability that is expected to result in the following cash outflows.    End of year   Cash Outflow \n  1    10   2    12   3    15   4     20   5    30 \n The insurer uses an 8% annual effective interest rate to discount future cash flows.  Calculate the Macaulay duration of this liability.  \n (A) 3.1 years  \n(B) 3.2 years (C) 3.4 years (D) 3.5 years \n(E) 3.6 years \n  229. A company created a portfolio in order to protect its position using Redington immunization.  Under which of the following changes in the yield rate is the immunization strategy guaranteed to be effective?  \n (A) Only a small decrease in the yield rate  \n(B) Only a small increase in the yield rate  \n(C) Only a small change in the yield rate (D) Any decrease in the yield rate   \n(E) Any change in the yield rate  \n117 230.  \nA bank issues a loan to be repaid by level end- of-year payments for ten years at an annual \neffective interest rate of 10%.  \n The bank invests these payments at an annual effective interest rate of 10% for the first four years and 7% for the next six years.  \n Calculate the bank’s annual effective yield rate on this loan over the ten -year period. \n (A) 7.90% \n(B) 8.20% (C) 8.33% (D) 8.67% \n(E) 9.10% \n  231. Two borrowers obtain loans at the same time. Each loan is for the same amount and is repaid with level end -of month payments.  \n The first borrower is charged a monthly effective interest rate of i  and makes payments of P  for k \nmonths to pay off the loan, where k is a positive integer.  \n The second borrower is charged a monthly effective interest rate of j  and makes payments of 120 \nfor 5 k months to pay off the loan. \n \nYou are given that 0 < j  < 0.04 and that \n( )511ij= +− . \n \nDetermine which statement about P  is true.  \n (A) \n400 450 P<≤  \n(B) 450 500 P<≤  \n(C) 500 550 P<≤  \n(D) 550 600 P<≤  \n(E) 600 650 P<≤  \n  \n118 232. \nA loan of 4000 has an annual effective interest rate of 5%. The loan is repaid by payments of 250 at the end of each year for ten years along with a final balloon payment at the end of the eleventh year.  \n Calculate the outstanding loan balance at the beginning of the seventh year.  (A) 3593 \n(B) 3660 (C) 3790 (D) 3856",
    "page_number": "116"
  },
  "233": {
    "content": "An investor’s new savings account earns an annual effective interest rate of 3% for each of the first ten years and an annual effective interest rate of 2% for each year thereafter.  \n The investor deposits an amount X  at the beginning of each year, starting with year 1, so that the \naccount balance just after the deposit in the beginning of year 26 is 100,000.   Determine which of the following is an equation of value that can be used to solve for X .  \n \n(A) \n11 26\n10 15 1 1\n1 12100,000 1 1\n(1.03) (1.02) (1.03) (1.02)kk\nkkXX−−\n= == +∑∑  \n(B) 10 26\n10 16\n1 11100,000 1 1\n(1.03) (1.02) (1.03) (1.02)kk\nkkXX\n= == +∑∑  \n(C) 11 26\n10 16 1 10 11\n1 12100,000 1 1\n(1.03) (1.02) (1.03) (1.03) (1.02)kk\nkkXX−−\n= == +∑∑  \n(D) 11 26\n10 15 1 10 11\n1 12100,000 1 1\n(1.03) (1.02) (1.03) (1.03) (1.02)kk\nkkXX−−\n= == +∑∑  \n(E) 10 26\n10 16 10 10\n1 11100,000 1 1\n(1.03) (1.02) (1.03) (1.03) (1.02)kk\nkkXX−\n= == +∑∑  \n  \n119 234. \nA bank issues two 20- year par -value bonds providing annual coupons. Each bond sells for the \nsame price and provides an annual effective yield rate of 6.5%.  The first bond has a redemption value of 6000 and a coupon of 7.6% paid annually. The second bond has a redemption value of 7500 and a coupon of r % paid annually. \n Calculate \nr. \n (A) 5.6 \n(B) 5.9 (C) 6.1 (D) 6.7 \n(E) 7.2 \n  235. You are given the following information about Bond X and Bond Y:  i) Both bonds are 20-year bonds. \n ii) Both bonds have face amount 1500. \n iii) Both bonds have an annual nominal yield rate of 7% compounded semiannually.  \n iv) Bond X has an annual coupon rate of 10% paid semiannually and a redemption value \nC. \n v) Bond Y has an annual coupon rate of 8% paid semiannually and a redemption value \nCK+. \n vi) The price of Bond X exceeds the price of Bond Y by 257.18.  Calculate K . \n (A) \n380−  \n(B)   88− \n(C)        0 (D)    235",
    "page_number": null
  },
  "236": {
    "content": "A perpetuity- immediate with annual payments is priced at X  based on an annual effective interest \nrate of 10%.  The amount of the first payment is 14,000. Each payment, from the second through \nthe twentieth, is 4% larger than the previous payment. The 21st payment and each subsequent \npayment will be 1% larger than the previous payment.   Calculate X . \n (A) 185,542 \n(B) 191,834 (C) 206,540 (D) 208,508 \n(E) 212,823 \n  237. An annuity writer sells an annual perpetuity-immediate for 16,000. The first payment is 1,000 and the payments decrease by r % each year.  \n The annual effective yield rate is 5.7%.   Calculate r . \n (A)   0.52 \n(B)   0.55 (C)   0.62 (D)   0.73 \n(E)   0.91 \n  238. A perpetuity makes payments every five years with a first payment of 2 to be paid five years from now.  Each subsequent payment is 10 more than the previous payment. The annual effective interest rate is 9%.  \n Calculate the present value of the perpetuity.   (A) 34.47 \n(B) 35.80 (C) 36.33 (D) 37.12 \n(E) 38.18 \n  \n121 239. \nA four-year 1000 face amount bond, with an annual coupon rate of 5% paid semiannually, has redemption value of C . It is bought at a price to yield an annual nominal rate of 6% convertible \nsemiannually. If the term of the bond had been two years, the purchase price would have been 7% less.   Calculate C . \n (A) 455 \n(B) 469 (C) 541 (D) 611",
    "page_number": "120"
  },
  "240": {
    "content": "You are given the following information about a fully immunized portfolio:  i) The liability is a single payment of 600,000 due in two years. \n ii) The asset portfolio consists of a one- year zero -coupon bond maturing for x  and a four-\nyear zero -coupon bond maturing for y . \n iii) The annual effective interest rate is 4.6%. \n Calculate x . \n (A) 218,800 \n(B) 325,400 (C) 365,600 (D) 382,400 \n(E) 402,800 \n  241. An investor pays 4000 today for a three-year investment that returns cash flows of 1400 at the end of each year. The cash flows can be reinvested at the positive annual effective interest rate of  \ni. Using an annual effective rate of interest of 4%, the net present value of this investment is 0.  \n Calculate i . \n (A) 2.5% \n(B) 3.0% (C) 3.5% (D) 4.0% \n(E) 7.0%  \n122 242. \nSusan won the lottery today which will pay an annual perpetuity of X , with the first payment \noccurring five years from today.   The perpetuity has a present value of 100,000 based on an annual effective interest rate of 1% for the first ten years and 5% for all years thereafter.  \n Calculate X . \n (A) 4100 \n(B) 4224 (C) 4357 (D) 4401",
    "page_number": null
  },
  "243": {
    "content": "A 15 -year loan of 60,000 is to be repaid with payments of X  at the end of each month based on \nan annual nominal interest rate of 7.5%, convertible monthly.  When the loan balance is 49,893, the loan is refinanced at an annual nominal interest rate of 6.0%, convertible monthly. Payments remain at X  and are paid at the end of each month  for as \nlong as necessary, with a smaller final payment.  \n Calculate the total number of payments, including the smaller final payment.  (A) 162 \n(B) 164 (C) 166 (D) 168",
    "page_number": null
  },
  "244": {
    "content": "Greg buys a 20-year increasing annuity- immediate with annual payments.  The first payment is \n110 and each succeeding payment is equal to the previous payment plus X . The annuity is priced \nat 2000 based on an annual effective interest rate of 10%.   Calculate X . \n (A) 16.64 \n(B) 17.45 (C) 19.19 (D) 21.00 \n(E) 22.68 \n  \n123 245. \nAt an annual effective interest rate of 5%, a 10 -year annuity- immediate starting with an annual \npayment of 100 increases each year by 15% of the previous year's payment and has a present value of X . \n Calculate X . \n (A)   597 \n(B)   772 (C) 1040 (D) 1247",
    "page_number": null
  },
  "246": {
    "content": "A loan of X  is repaid with level payments of R  payable at the end of each year  for n years.  \n You are given:  i) The interest paid in year 1 is 797.50. \n ii) The principal repaid in year n – 4 is 865. \n iii) The principal outstanding at the end of year n – 1 is 1144.50. \n Determine X . \n (A)   9,500 \n(B) 10,000 (C) 10,500 (D) 11,000 \n(E) 11,500 \n  \n124 247. \nThe amount that must be invested at i % (0% < i % < 10%) to accumulate to  Y at the end of three \nyears at an annual rate of:  \n i) simple interest of i % is Q \n ii) compound interest of i % is R \n iii) simple discount of i % is S \n iv) compound discount of i % is T  \n Determine which of the following is true.  \n (A) Q < R < S < T \n(B) R < Q < S < T \n(C) S < T  < R < Q \n(D) T < S < Q  < R \n(E) T < S < R  < Q \n  248. Kate buys a five-year 1000 face amount bond today with a 100 discount. The annual nominal coupon rate is 5% convertible semiannually.  One year later, Wallace buys a four -year bond. It has the same face amount and coupon values as \nKate’s and is priced to yield an annual nominal interest rate of 10% convertible semiannually. The discount on Wallace’s bond is D . \n The book value of Kate’s bond at the time Wallace buys his bond is B . \n Calculate B  – D. \n (A) 724 \n(B) 738 (C) 756 (D) 838",
    "page_number": null
  },
  "249": {
    "content": "A company has liabilities of 1000 and 300 due at the end of years two and four, respectively. The company develops an investment program that produces asset cash flows of X  and Y  at the end of \nyears one and three, respectively.  The investment portfolio is constructed to match the present \nvalue and duration of the company’s payment obligations based on an annual effective rate of interest of 5%.   \n \nCalculate \n.Y\nX \n \n(A) 2.14 \n(B) 2.75 (C) 3.42 (D) 4.05 \n(E) 4.91 \n  250. A homeowner borrows 1000 to be repaid with payments at the end of each year for 20 years. There are two repayment options. The first option is equal annual payments based on an annual effective interest rate of 3%.  The second option is payments of 50 each year plus interest on the \nunpaid balance at an annual effective interest rate of i . The total payments under the two options \nare the same.  \n Calculate i . \n (A) 2.86% \n(B) 3.00% (C) 3.28% (D) 3.44% \n(E) 4.76% \n  251.  A debt is amortized with 120 level payments at the end of each month based on an annual effective interest rate of 8%.  The amount of principal in the sixth payment is 600. \n Calculate the amount of principal in the 24\nth payment. \n (A) 532 \n(B) 673 (C) 700 (D) 704",
    "page_number": "125"
  },
  "252": {
    "content": "Fund X accumulates at a force of interest of ,2 12\ntt+=δ where t  is measured in years, \n20 0≤ ≤t . Fund Y accumulates at an annual effective interest rate of i . An amount of 1 is \ninvested in each fund at time t = 0.  After 20 years, Fund X has the same value as Fund Y. \n \nCalculate the value of Fund Y after five years.  \n (A) 2.46 \n(B) 2.53 (C) 2.60 (D) 2.67 \n(E) 2.74 \n  253. You have the option of purchasing one of the following two annuities- immediate: \n i) The first annuity makes annual payments of 1000 for 20 years. \n ii) The second annuity is a perpetuity that also has annual payments. The  \npayment in each of the first 10 years is 600. Beginning in year 11, the payments increase to 1200, and remain at 1200 forever. \n At an annual effective interest rate of \n0i>, both annuities have a present value of X . \n Calculate X . \n (A) 8700 \n(B) 8750 (C) 8800 (D) 8850",
    "page_number": "126"
  },
  "254": {
    "content": "S perpetuity- immediate is purchased at a price of 5000 based on an annual effective rate of i , \nwhere 0i>. The perpetuity pays 150 in the first year and increases by 10 each year thereafter. \n Calculate i . \n (A) 5.7% \n(B) 6.2% (C) 6.7% (D) 7.2% \n(E) 7.7% \n  255. Erin borrows X  at an annual effective rate of 5%.  If the  principal and all accumulated interest is \npaid in one lump sum at the end of 20 years, 1000 more in interest would be paid than if the loan was repaid with level payments at the end of each of the first ten years.  Calculate X . \n (A) 389 \n(B) 540 (C) 704 (D) 736",
    "page_number": "127"
  },
  "256": {
    "content": "A 20 -year loan of 500 based on a 5% annual effective interest rate is repaid with level \ninstallments at the end of each year.  \n Determine the installment in which the principal and interest portions are most nearly equal to each other.  \n (A)  1\nst  \n(B)  7th  \n(C) 10th  \n(D) 13th  \n(E) 20th  \n  \n128 257. \nThe total present value of 10,000 now and 10,815 two years from now is the same as the present value of 20,800 one year from now at either of two different annual effective interest rates, x and  \ny. \n Calculate the absolute value of the difference between x  and y . \n (A) 1.8% \n(B) 2.0% (C) 3.0% (D) 4.0% \n(E) 5.0% \n  258. Bond A is a 15-year 1000 face amount bond with an annual coupon rate of 9% paid semiannually. Bond A will be redeemed at 1200 and is bought to yield 8.4% convertible semiannually.   Bond B is an n-year 1000 face amount bond with an annual coupon rate of 8% paid quarterly. Bond B will be redeemed at 1376.69 and is bought to yield 8.4% convertible quarterly.   The two bonds have the same purchase price.  Calculate n.  (A) 12 \n(B) 14 (C) 15 (D) 16",
    "page_number": null
  },
  "259": {
    "content": "At the end of each year for 60 years, Marilyn makes a deposit to a bank account that credits interest at an annual effective interest rate of i . She deposits 2 at the end of the first year, and \neach subsequent year her deposit increases by 2.  At the end of 60 years, Marilyn uses the \naccumulated amount to purchase a 5 -year annuity- immediate paying  annually at the same annual \ninterest rate of i , with a first payment of X  and each  subsequent payment increasing by 5%. \n Which of the following expressions represents a correct equation of value? \n \nI. \n( ) ( )( )5\n601 1.05 2 60\n0.05Xv s\nii− −\n=− \nII. ( ) ( ) ( )4 60\n602 1 1.05 1.05 Ia Xv v v= + ++   \nIII. ( )59\n2 45\n60\n02 1.05 1.05t\nts Xv v v−\n== + ++∑   \n (A) I only \n(B) II only  \n(C) III only  \n(D) I, II, and III  \n(E) The correct answer is not given by (A), (B), (C), or (D). \n  260. The table below defines available zero -coupon bonds and their prices: \n \nYears to  \nMaturity   \nBond Price \nPer Bond  Redemption \nValue  \nPer Bond  \n1 961.54  1,000  \n2 966.14  1,050  \n3 878.41  1,000  \n A company chooses to purchase 15 one- year zero -coupon bonds; 20 two- year zero - coupon \nbonds; and 30 three- year zero -coupon bonds. \n Calculate the Macaulay duration of this portfolio.  (A) 1.97 \n(B) 2.11 (C) 2.16 (D) 2.20 \n(E) 2.23 \n  \n130 261. \nOn his 65th birthday, an investor withdrew an amount P  from a fund of 1,000,000 and withdrew \nthe same amount on each successive birthday. On the date of his 82nd birthday, the fund was \nagain equal to 1,000,000 after the withdrawal.   The fund earns an annual effective interest rate of 10%.  Calculate P.  \n (A)   81,655 \n(B)   88,915 (C)   90,909 (D)   98,879 \n(E) 109,729 \n  262. The first payment of a five-year annuity is due in five years in the amount of 1000. The subsequent four annual payments increase by 500 each year. The annual effective interest rate is i. \n Determine which of the following formulas gives the present value of the annuity.  \n(A)  \n 6\n5 5500 500i iv a Ia \n(B)  6\n5 5500 500i iv a Ia   \n(C)  5\n5 5500 500i iv a Ia  \n(D)  5\n5 5500 500i iv a Ia   \n(E)  5\n5 51000 500i iv a Ia    \n  \n131 263. \nAn 18-year bond, with a price 61% higher than its face value, offers annual coupons with the coupon rate equal to 2.25 times the annual effective yield rate.   An n-year bond, with the same face value, coupon rate, and yield rate, sells for a price that is 45% higher than its face value.  Calculate n.  (A) 10 \n(B) 12 (C) 14 (D) 17",
    "page_number": "129"
  },
  "264": {
    "content": "A ten -year bond paying annual coupons of X  has a face amount of 1000, a price of 450, and an \nannual effective yield rate of 10%.  \n A second ten -year bond has the same face amount and annual effective yield rate as the first \nbond. This second bond pays semi-annual coupons of \n2X. The price of the second bond is P .  \n Calculate P . \n (A) 439 \n(B) 442 (C) 452 (D) 457",
    "page_number": null
  },
  "265": {
    "content": "Consider two loans. Loan A has an initial principal of0P and an annual nominal interest rate of i , \nconvertible monthly. Loan B also has  an annual nominal interest rate of i , but the interest is \nconvertible daily.  \n At the end of the first month, a payment of m  is made on Loan A, which includes one month of \ninterest.  The remaining balance o n Loan A is then  \n1P.  \n Let j be the monthly effective interest rate of Loan B, assuming there are 12 equal months in a \nyear and 365 days in a year.  Determine which of the following represents j . \n \n(A) \n12\n10\n011112PPm\nP−++− \n(B) 1/12\n10\n01 12 1PPm\nP−++− \n(C) 12\n10\n01211365PPm\nP−++− \n(D) 12/365\n10\n03651112PPm\nP−++− \n(E) 365/12\n10\n01211365PPm\nP−++− \n  \n133 266. \nLet P (0, t) be the current price of a zero -coupon bond that will pay 1 at time t . \n Let X  be the value at time n of an investment of 1 made at time m , where m  < n. \n Assume all investments earn the same interest rate.  \n Determine X . \n \n(A) \n(0, )1(0, )Pm\nPn− \n(B) (0, )1(0, )Pn\nPm+ \n(C) (0, )1(0, )Pm\nPn+ \n(D) (0, )\n(0, )Pm\nPn \n(E) (0, )\n(0, )Pn\nPm \n \n 267. \nA borrower planned to repay a loan of L  with level payments at the end of each month for 30 \nyears.  The loan had an annual nominal interest rate of 6%, convertible monthly. Starting with the \n181\nst payment, the borrower increased the monthly payment to 2000, which enabled the \nborrower to pay off the loan five years earlier than planned. \n Calculate L . \n (A) 253,554 \n(B) 277,772 (C) 310,414 (D) 330,347 \n(E) 333,583 \n  \n134 268. \nAn insurance company aims to structure a portfolio of assets and liabilities so that:  i) Its assets and liabilities have equal present values and equal modified durations.  \n ii) The convexity of its assets exceeds the convexity of its liabilities.  \n Determine which term precisely describes the company’s position.  (A) Diversified    \n(B) Fully immunized  \n(C) Fully leveraged  \n(D) Exactly matched     \n(E) Redington immunized \n  269. A three-year bond with face amount X  and a coupon of 4 paid at the end of every six months is \npriced at 90.17. A three-year bond with face value of 1.6X  and a coupon of 4 paid at the end of \nevery six months is priced at 132.47. Both have the same yield rate.  \n Calculate the annual nominal yield rate, convertible semiannually.  \n (A)  6% \n(B)  8% (C)  9% (D) 11% \n(E) 12% \n  270. Prosperity Insurance sells a two -year annuity with equal payments at the end of each year.  The \nprice of this annuity is 9297. Prosperity Insurance creates a portfolio made up of a one- year zero -\ncoupon bond and a two- year zero -coupon bond to immunize this annuity.  \n The company uses an annual effective interest rate of 5% to vaue its assets and liabilities.  \n Calculate the amount invested today in the two- year zero -coupon bond. \n (A) 3769 \n(B) 4535 (C) 4762 (D) 5000",
    "page_number": "132"
  },
  "271": {
    "content": "Bond A and Bond B are each five-year 1000 face amount bonds. In addition:  \n i) Bond A has an annual coupon rate of 5% paid semiannually. \n ii) Bond B has an annual coupon rate of 3% paid annually. \n iii) The price of Bond B is 100 less  than the price of Bond A. \n iv) The annual effective yield rate for Bond A is 4%.  Calculate the annual effective yield rate for Bond B.  \n (A) 4.15% \n(B) 4.20% (C) 4.25% (D) 4.30% \n(E) 4.35% \n  272. A 100,000 loan has  an annual nominal interest rate of 8% convertible quarterly. The loan will be \nrepaid with quarterly payments and the first payment is due three months from the date of the loan.  For the first five years each payment will be 2500. All payments thereafter will be 5000 except for a final balloon payment, which will be less than 10,000.   Calculate the balloon payment.   (A) 7920 \n(B) 8078 (C) 9056 (D) 9154",
    "page_number": "135"
  },
  "273": {
    "content": "An investor purchases  a 20 -year, 1000 face amount bond with semiannual coupons at a price \nequal to the redemption value of 900. The bond yields an annual nominal rate of 10% convertible semiannually.   After ten years, the investor s ells the bond, yielding to the buyer an annual nominal rate of 8% \nconvertible semiannually. The investor uses the proceeds to purchase a 10-year, 1000 face amount bond with redemption value 1100 and semiannual coupons. The yield rate on the new bond is an annual nominal rate of 8% convertible semiannually.   Calculate the semiannual coupon payment for the new bond.   (A) 34 \n(B) 38 (C) 41 (D) 45",
    "page_number": "136"
  },
  "274": {
    "content": "An insurance company has liabilities due at the end of each of the next two years.  The liability due \nat the end of the second year is twice that for the first year.  \n The company uses a combination of the following two bonds to match the liabilities. The second bond has annual coupons.  \nTerm to maturity (in years)  Annual coupon rate  Annual effective yield  \n1 0% 6% \n2 5% 8% \n Assume both bonds are redeemed at par and the company invests 9465 in the two-year bond.   Calculate the amount the company should invest in the one -year bond to construct an exactly \nmatched portfolio.  (A) 4245 \n(B) 4398 (C) 4481 (D) 4717",
    "page_number": null
  },
  "275": {
    "content": "An insurance company has a single liability due in three years. The company fully immunizes its position by purchasing one-year and four- year zero -coupon bonds. The face value of the one-\nyear bond is 20,000 and the face value of  the four-year bond is 50,000.  \n Assume that the yield curve is flat.   \n Calculate the amount of the liability.  \n (A) 40,000 \n(B) 55,699 (C) 69,624 (D) 73,333 \n(E) 97,500 \n  276. A perpetuity-immediate pays 20 for 10 years, decreases by 1 per year for 19 years, and then pays 1 per year thereafter.  At an annual effective interest rate of 6%, the present value is equal to X . \n Calculate X . \n (A) 208 \n(B) 213 (C) 218 (D) 223",
    "page_number": "137"
  },
  "277": {
    "content": "An actuary’s child will be going to college 15 years from now. To save for the estimated cost of 2000, the actuary makes deposits into a fund at the end of each year for the next 15 years. The first deposit is X . Each subsequent deposit is 3% larger than the previous deposit. \n The fund earns an annual effective rate of 8%.  Calculate X . \n (A) 45 \n(B) 57 (C) 62 (D) 67",
    "page_number": null
  },
  "278": {
    "content": "Two immediate annuities have the following characteristics:  \nX: Pays 1/ m,  m times per year, for 10 years  \nY: Pays P at the end of years 2, 4, 6, 8, and 10 \n You are given  \ni) The accumulated value at time 1 of 1/ m paid at times 1/m , 2/m, …, 1 is 1.0331. \nii) \n22.075 s= . \niii) The present value of X  equals the present value of Y.  \n Calculate P . \n (A) 1.94 \n(B) 2.01 (C) 2.03 (D) 2.07 \n(E) 2.14 \n  279. A debt is amortized with 60 equal monthly payments at an annual effective interest rate of 12%. The amount of principal in the third payment is 900.  Calculate the amount of principal in the 33rd payment.  (A)   668 \n(B)   900 (C) 1008 (D) 1195",
    "page_number": "138"
  },
  "280": {
    "content": "At the beginning of each year, a payment of 5000 is invested in a fund. The payments earn an annual effective interest rate of 8%. At the end of each year, the interest is reinvested in the fund at an annual effective interest rate of 5%. The amount in the fund at the end of ten years, immediately prior to the 11\nth annual payment, is X. \n Calculate X to the nearest 100.  \n (A) 67,600  \n(B) 70,300  \n(C) 75,700  \n(D) 78,200  \n(E) 80,700  \n  281. A 1000 par value ten-year bond with 7.6% semiannual coupons is bought to yield 6.0% convertible semiannually.  Calculate the book value of the bond at the end of year six immediately after the coupon payment.  (A) 1054 \n(B) 1056 (C) 1059 (D) 1062",
    "page_number": "139"
  },
  "282": {
    "content": "A loan of amount \n4 ia is repaid with payments of 1 at the end of each year for four years. The \nsum of the interest paid in the last two years is equal to  21i  times the sum of the principal \nrepaid in the first two years.  \n Calculate i.  \n (A) 0.543 \n(B) 0.567 (C) 0.592 (D) 0.618 \n(E) 0.645 \n    \n140 283. \nPaul makes one investment of 500 on January 1, 2005 and collects 600 on January 1, 2007 for an annual effective yield of X%. \n Toby invests 100 on January 1, 2005, invests another 100 on January 1, 2006, and collects an amount Z  on January 1, 2007 for an annual  effective yield of Y %. \n The combination of Paul’s and Toby’s cash flows, produces an annual effective yield of 10%.  Calculate Y % − X %.  \n (A) 0% \n(B) 1% (C) 2% (D) 3% \n(E) 4% \n  284. A ten -year certificate of deposit pays an annual effective interest rate of 8%. If the balance is \nwithdrawn before the end of ten years, the purchaser can choose between two different penalties:  \n  i) a loss of the last nine months’ interest.  \n ii) a reduction in the annual effective rate of interest to j . \n If the purchaser withdraws the funds after three years, the two penalties are equivalent.  \n Calculate j . \n (A) 5.74% \n(B) 5.94% (C) 6.14% (D) 6.34% \n(E) 6.54% \n    \n141 285. \nAn investor deposits 1000 at the beginning of each year for 20 years. The fund earns interest at an annual effective rate of 9.25%.  At the end of 20 years, the investor wishes to use the fund to purchase a 30-year annuity- due \nwith monthly payments of 500 based on an annual nominal interest  rate of 10% convertible \nmonthly.  Calculate the balance, if any, in the fund after paying for the annuity.  (A) The fund balance is insufficient to purchase the annuity. \n(B)     0 (C)   35 (D) 370",
    "page_number": null
  },
  "286": {
    "content": "A perpetuity pays 1 at the beginning of each three-month period.  Another perpetuity pays X at the beginning of each four-year period.  Using an annual effective interest rate of i , each \nperpetuity has a present value of 300.  Calculate X . \n (A) 15.41 \n(B) 15.61 (C) 15.91 (D) 16.21 \n(E) 16.41 \n  287. A loan with an annual nominal interest rate of 9%, convertible monthly, is repaid with 60 monthly payments.  The first payment is 1000 and each succeeding payment is 2% less than the previous payment.  Calculate the outstanding loan balance immediately after the 40\nth payment is made.  \n (A) 6889 \n(B) 7289 (C) 7344 (D) 7407",
    "page_number": null
  },
  "288": {
    "content": "A 15 -year loan with an annual effective interest rate of 6% has payments of 400 at the end of \neach year.  At the time of the fifth payment, the borrower pays an extra 1000 and then repays the balance over five years with a revised annual payment of X . \n Calculate X . \n (A) 264.13 \n(B) 435.38 (C) 461.51 (D) 556.46 \n(E) 698.90 \n  289. A loan of1500 is to be repaid with payments made at the end of each year for 20 years.  There are two repayment options:     i) equal payments at an annual effective interest rate of 5%  \nii) nonlevel payments of interest on the unpaid balance at an \nannual effective interest rate of i , plus 75 of principal \n The sum of the payments is the same under the two options.    Calculate i . \n (A) 5.26% \n(B) 5.51% (C) 5.76% (D) 6.01% \n(E) 6.26% \n    \n143 290. \nA steel company issued a ten -year 1,000,000 face amount bond on March 1, 2002 with an annual \nnominal coupon rate of 8% paid semiannually.  On September 2, 2004, Company X paid 1,100,000 for this bond to yield an annual nominal rate of i convertible semiannually. \n Calculate i . \n (A) 4.0% \n(B) 5.5% (C) 6.3% (D) 8.0% \n(E) 9.7% \n  291. An investor deposits 150 today and receives 100 one year from now and 80 two years from now.  Calculate the annual nominal rate of interest convertible quarterly that the investor earns.  \n (A) 12.8% \n(B) 13.0% (C) 13.2% (D) 13.4% \n(E) 13.6% \n  292. An investor purchases a 30-year bond with a face amount of 1000 and annual coupon rate of 8% paid semi -annually.  The bond is callable at its face value any time following the coupon \npayment occurring at the end of the 15th year.    The bond is bought at a premium based on an annual effective yield rate of 7%.  Calculate the purchase price of the bond.  (A) 1067 \n(B) 1104 (C) 1132 (D) 1141",
    "page_number": "142"
  },
  "293": {
    "content": "The present value of cash flows at an effective interest rate of i  is given by the following \nfunction:  \n( ) ( ) ( )34100 500 1 1000 1 ,  for 0. Pi i i i−−=+ +− + >  \n Determine w hich of the following expressions represents the modified duration of these cash \nflows . \n \n(A) ( ) ( )\n( ) ( )45\n341500 1 4000 1\n100 500 1 1000 1ii\nii−−\n−−+− +\n+ +− + \n(B) ( ) ( )\n( ) ( )34\n341500 1 4000 1\n100 500 1 1000 1ii\nii−−\n−−+− +\n+ +− + \n(C) ( ) ( )\n( ) ( )45\n341500 1 4000 1\n100 500 1 1000 1ii\nii−−\n−−− ++ +\n+ +− + \n(D) ( ) ( )\n( ) ( )34\n341500 1 4000 1\n100 500 1 1000 1ii\nii−−\n−−− ++ +\n+ +− + \n(E) ( ) ( )\n( ) ( )56\n346000 1 20,000 1\n100 500 1 1000 1ii\nii−−\n−−− ++ +\n+ +− + \n  294. The current yield rates for zero -coupon bonds are as follows: \n \nTerm  \n(years)  Annual effective  \nyield rate  \n1 3.5%  \n2 4.0%  \n3 4.0%  \n4 5.0%  \n Calculate the implied two -year spot rate at the end of year two.  \n (A) 1.0% \n(B) 4.0% (C) 4.5% (D) 5.0% \n(E) 6.0% \n    \n145 295. \nThe table gives information about the assets and liabilities of three companies.    \n                    Assets                Liabilities  \n  \nCompany  Present \nValue  Modified \nDuration  Convexity  Present \nValue  Modified \nDuration  Convexity  \n    U 200,000    10.2     150 200,000     9.3   148 \n    V 300,000      8.6       85 300,000     8.6     80 \n    W 400,000    15.8     300 400,000   15.8   305 \n Determine which of the following statements are true.  \n (I) Company U’s position is immunized against small interest rate changes.  \n(II) Company V’s position is immunized against small interest rate changes.  \n(III) Company W’s position is immunized against small interest rate changes.  \n (A) I only \n(B) II only  \n(C) III only  \n(D) I, II, and III     \n(E) The correct answer is not given by (A), (B), (C), or (D). \n  296. On the first of the month, Chuck took out a business loan for 50,000, with payments at the end of each month based on an annual nominal interest rate compounded monthly.  Each monthly payment is equal to 800, except for a final drop payment.    Immediately after the first payment the balance owed was 49,800.  Calculate the number of payments that Chuck needed to pay off the loan.  (A) 115 \n(B) 117 (C) 119 (D) 121",
    "page_number": "144"
  },
  "297": {
    "content": "A 27 -year bond, with a price equal to 75% of its face value, offers annual coupons with the \ncoupon rate equal to 21\n37 of the annual effective yield rate.   \n An n- year zero -coupon bond has the same price, face value, and yield rate. \n Calculate n.   (A)   5 \n(B)   7 (C)   9 (D) 11",
    "page_number": "146"
  },
  "298": {
    "content": "An annual perpetuity pays 1 one year from now.  Payments will then increase by 4% per year for \n5 years and 8% per year thereafter.  \n Calculate the present value of this perpetuity at an annual effective interest rate of 12%.  \n (A) 21.13 \n(B) 23.51 (C) 25.95 (D) 28.87 \n(E) 31.23 \n  299. An insurance company has a liability of 2662 that is due at the end of three years.  The present value of this liability is 2000.  There are two investments available: a one- year zero -coupon bond \nand a four- year zero -coupon bond.   \n The company wants to find an investment plan that satisfies Redington immunization.  \n Calculate the amount the company invests in the one- year zero -coupon bond. \n (A) 400 \n(B) 667 (C) 858 (D) 1,000 \n(E) There is no investment plan that satisfies Redington immunization  \n    \n147 300. \nA loan of 5,000,000 is to be repaid by installments of X  at the end of each quarter over a period \nof ten years.  The annual nominal interest rate for the loan is 8% compounded quarterly.    The actual quarterly payment for the first five years is X  rounded up to the next higher 1000.  \nAfter that, each quarterly payment is X rounded up to the next higher 100,000, until the loan is paid off with a drop payment.  Calculate the total number of payments, including the drop payment, needed to repay the loan.   (A) 36 \n(B) 37 (C) 38 (D) 39",
    "page_number": null
  },
  "301": {
    "content": "A ten -year 100 face amount bond has an annual coupon rate of 8% payable semiannually. The \nbond is callable at the end of the 5\nth, 7th, and 9th years at par, immediately after the coupon \npayment.   Calculate the maximum price of the bond that ensures an annual effective yield of at least 6%.  \n (A) 108.92 \n(B) 111.83 (C) 114.41 (D) 115.59 \n(E) 116.74 \n  302. Susan receives annual payments from a 20-year annuity-immediate.  The payment in year 1 is 100 and in each succeeding year the payment is 90% of the prior year’s payment.  Upon receipt of each payment, Susan invests the payment in a savings account earning interest at a 3% annual effective rate.   Calculate the balance in the savings account immediately after Susan invests the last annuity payment.  (A)   696 \n(B)   717 (C)   739 (D) 1296",
    "page_number": null
  },
  "303": {
    "content": "Two deposits are made into a fund:  300 at time 0 and Xat time 4.  The force of interest for the \nfund is 50ttδ= , 0≥t .  The amount of interest earned from time 0 to time 10 is 4X. \nCalculate X. \n (A) 145 \n(B) 173 \n(C) 181 \n(D) 192",
    "page_number": "148"
  },
  "304": {
    "content": "An insurance company has a liability of 750,000 due four years from now.  To protect against \ninterest rate risk, it decides to employ the technique of full immunization.  Specifically, it decides to hold three assets, each providing a single cash flow as follows:  \n i) Asset X provides a cash flow of \nXA, exactly two years from now. \n ii) Asset Y provides a cash flow of 250,000, exactly four years from now. \n iii) Asset Z provides a cash flow of ZA, exactly five years from now. \n \nThe annual discount factor is v  = 0.95. \n \nCalculate XA. \n \n(A) 150,000 \n(B) 175,000 (C) 200,000 (D) 225,000 \n(E) 250,000 \n    \n149 305. \nA loan of 50,000 id based on an annual effective interest rate of 6%.   You are given:  \ni) The loan is to be repaid with quarterly payments of 2125 and a final drop payment. \nii) The first payment is due 1.5 years after the loan is taken out. \n Calculate the number of payments of 2125 to be made.  (A) 28 \n(B) 29 (C) 30 (D) 31",
    "page_number": null
  },
  "306": {
    "content": "You are given the following information regarding Company J.  \ni) It has a single liability of 1.75 million to be paid 12 years from now. \nii) Its asset portfolio consists of a zero-coupon bond maturing in 5 years for 242,180 and a \nzero-coupon bond maturing in 14 years for X.  \niii) At an annual effective interest rate of 7%, Company J’s position is fully immunized. \n Calculate the present value of the assets less the present value of the liabilities if the annual effective interest rate immediately changes to 4%.  \n (A)   5,910 \n(B)   8,871 (C) 11,029 (D) 14,746 \n(E) 17,462 \n    \n150 307. \nA scholarship foundation is committed to make a payment of 20,000 exactly two years from today.  It plans to use two zero-coupon bonds to fully immunize the liability based on a flat curve and an annual effective yield rate of 5.5%.  One of the bonds will have a one-year maturity and the other will have a three -year maturity.    \n Calculate the face value of the one- year zero -coupon bond.  \n (A)    9,479\n \n(B)    9,779 (C)  10,079 (D) 10,379 \n(E)  10,679 \n  308. A construction firm is facing three liabilities of 1000, due at the end of each of the periods 1, 2, and 3.  There are three bonds available to match these liabilities, as follows:  \nBond I A bond due at the end of period 1 with a coupon rate of 1% per period, valued \nat a periodic effective yield rate of 14%  \nBond II A bond due at the end of period 2 with a coupon rate of 2% per period, valued \nat a periodic effective yield rate of 15%  \nBond III A zero -coupon bond due at the end of period 3 valued at a periodic effective \nyield rate of 18% \n Calculate the total purchase price of the three bonds required to exactly match the liabilities.  \n (A) 2182 \n(B) 2202 (C) 2222 (D) 2242",
    "page_number": null
  },
  "309": {
    "content": "An annuity-immediate provides annual payments of 10 for 20 years.  Immediately following the 11\nth payment, the annuity is exchanged for a perpetuity- immediate of equal value with semi-\nannual payments. The present values at the time of the exchange are based on an annual effective interest rate of 6%.  \n The first payment of the perpetuity is K  and each subsequent payment is 0.5% larger than the \nprevious payment.  Calculate K . \n (A) 1.53 \n(B) 1.67 (C) 2.37 (D) 3.42 \n(E) 3.74 \n  310. An insurance company purchases a perpetuity-due at an annual effective yield rate of 12.5% for 9450.  The perpetuity provides annual payments according to the repeating three- year pattern \n100, X , 100, 100, X , 100, 100, X , 100, ... .   \n Calculate X . \n (A) 2950 \n(B) 2963 (C) 3321 (D) 3344",
    "page_number": "151"
  },
  "311": {
    "content": "A credit card company charges an annual effective interest rate of 16.8%.   Interest accumulates from the date of purchase.  \n A borrower's credit card balance was X  at the beginning of month 1.  Starting with month 1, the \nborrower purchased satellite internet service, resulting in a 79.99 charge on the credit card at the middle of each month.  The borrower paid 250 at the end of each month.  Immediately after the payment in month 15, the balance was 3000.  Determine which of the following is an equation of value that can be used to solve for X . \n \n(A) \n( ) ( ) ( )15 15\n0.5 15\n1179.99 3000 250\n1.014 1.014 1.014nn\nnnX−\n= =+= +∑∑  \n(B) \n( ) ( ) ( )16 16\n0.5 5\n1112 4 1279.99 3000 250\n1.168 1.168 1.168nn\nnnX+\n= =+= +∑∑  \n(C) \n( ) ( ) ( )16 16\n0.5 4\n1112 3 1279.99 3000 250\n1.168 1.168 1.168nn\nnnX−\n= =+= +∑∑  \n(D) \n( ) ( ) ( )15 15\n0.5 5\n1112 4 1279.99 3000 250\n1.168 1.168 1.168nn\nnnX+\n= =+= +∑∑  \n(E) \n( ) ( ) ( )15 15\n0.5 5\n1112 4 1279.99 3000 250\n1.168 1.168 1.168nn\nnnX−\n= =+= +∑∑  \n \n 312. Deposits of 100 are made to an account today and one year from today.  The annual force of interest at time t  in years for this account is: \n     δ\nt = 0.03 + 0.005t ,   0 ≤ t  ≤ 3 \n Calculate the account balance two years from today.  \n (A) 211.07 \n(B) 211.87 (C) 216.05 (D) 216.79 \n(E) 220.24 \n    \n153 313. \nA perpetuity-due with annual payments is priced at X  based on an annual effective interest rate of \n7%.  The amount of the first payment is 350.  Each payment, from the second through the thirtieth, is 3% larger than the previous payment.  Starting with the 31\nst payment, each payment \nis equal to the 30th payment.  \n Calculate X . \n (A) 7508 \n(B) 7855 (C) 7925 (D) 7971",
    "page_number": "152"
  },
  "314": {
    "content": "A student takes out a loan for 30,000.  The annual nominal interest rate is 9%, convertible semiannually.  The student pays off the loan in five years with monthly payments beginning one month from today.  The first payment is 500, and each subsequent payment is X  more than the previous \npayment.    Determine which of the following is an equation of value that can be used to solve for X . \n \n(A) \n( )60\n0250030,000\n1.015=+=∑ n\nnnX \n(B) \n( )60\n0650030,000\n1.045=+=∑ n\nnnX \n(C) \n( )60\n1650030,000\n1.045=+=∑ n\nnnX \n(D) \n( )60\n12500 ( 1)30,000\n1.015=+−=∑ n\nnnX \n(E) \n( )60\n16500 ( 1)30,000\n1.045=+−=∑ n\nnnX \n \n   \n154 315. \nEach of bonds A, B, and C sells for 10,000 and has the same annual effective yield rate and term.  The par values and coupon rates are shown below.  \n Bond A  Bond B  Bond C  \nPar Value  20,000.00  10,835.58  X \nAnnual Coupon Rate  0% 4% 3% \n Each bond is redeemed at par, and all coupons are paid annually.  Calculate X . \n (A) 12,240 \n(B) 12,630 (C) 13,130 (D) 13,540 \n(E) 14,450 \n  316. A perpetuity- immediate with annual payments consists of ten level payments of k , followed by a \nseries of increasing payments.  Beginning with the eleventh payment, each payment is 200 larger than the preceding payment.    Based on an annual effective interest rate of 5.2%, the present value of the perpetuity  is 50,000.   \n Calculate k . \n (A)   34 \n(B)   86 (C) 163 (D) 283",
    "page_number": null
  },
  "317": {
    "content": "A bank issues two 30-year bonds, A and B, each with annual coupons, an annual effective yield rate of 7%, and a face amount of 1000.  The total price of these two bonds is 3000.  Bond B's annual coupon rate is equal to Bond A's annual coupon rate plus 0.5%.  Calculate the annual coupon rate of Bond A.  (A) 10.06% \n(B) 10.78% (C) 10.90% (D) 11.31% \n(E) 11.84% \n  318. A ten -year bond with a face amount of 1000, a redemption value of C , and an annual coupon rate \nof 7% paid semiannually is purchased at a discount to yield an annual nominal rate of 7.5%, convertible semiannually.    The accumulation of discount in the 12\nth coupon is 7. \n Calculate C . \n (A)   673 \n(B)   799 (C) 1193 (D) 1344",
    "page_number": "155"
  },
  "319": {
    "content": "You are given the following information about Bond A and Bond B:  \ni) Bond A is a 20-year bond that has 10,000 face amount, an annual coupon rate of 7% \npayable semiannually, and has a redemption value that is 10% higher than its price.  Bond A is bought to yield an annual nominal interest rate of 5% convertible semiannually. \n ii) Bond B is an n-year bond with semiannual coupons and the same face amount, \nredemption value, coupon rate, and yield rate as Bond A.  The price of Bond B is 158.33 less than the price of Bond A. \n Calculate  n.  (A) 12 \n(B) 17 (C) 24 (D) 36",
    "page_number": "156"
  },
  "320": {
    "content": "An investor purchases two bonds having the same positive annual effective yield rate.    With respect to the annual effective yield rate, their modified durations are a years and b years, \nwith \n0<<ab .  \n One of these two bonds has a Macaulay duration of d years, with a < d < b. \n Determine which of the following is an expression for the Macaulay duration of the other bond, in years.  \n \n(A) bd / a  \n(B) ad / b \n(C) ab / d \n(D) b + d – a \n(E) a + d – b \n  \n157 321. \nJohn deposits 1000 into a fund.  The fund earns:  \ni) an annual nominal rate of interest of 4% convertible quarterly for the first three years;  \nii) a constant annual force of interest of 5% for the next three years; and \niii) an annual  nominal discount rate of 6% convertible semiannually thereafter.  \n Calculate the amount in the fund at the end of ten years.  (A) 1658 \n(B) 1667 (C) 1670 (D) 1674",
    "page_number": null
  },
  "322": {
    "content": "A payment of 7 is deposited into an account at the end of each year for 45 years.  The account earns  an annual effective interest rate of i . \n Immediately after the 45\nth deposit of 7, the account has accumulated to X , which is used  to \npurchase a perpetuity -immediate.  At an annual effective interest rate of 1.2 i, the perpetuity will \nmake annual  payments  of 75.60. \n Calculate X . \n (A) 1050 \n(B) 1120 (C) 1200 (D) 1260",
    "page_number": null
  },
  "323": {
    "content": "A loan of 20,000 is to be repaid with payments at the end of each year for ten years.   The  first \npayment is X.   Each subsequent payment is 6% greater than the  preceding payment. \n The loan payments are based on an annual effective interest rate of 10%.  \n Calculate the loan balance immediately after the eighth payment.  \n (A) 6685 \n(B) 6937 (C) 7353 (D) 7794",
    "page_number": null
  },
  "324": {
    "content": "You are given that the force of interest at time t  (in years) is 1\n8t+. \n \nCalculate the annual effective rate of interest in year 5.  \n (A) 6.2% \n(B) 6.6% (C) 7.4% (D) 8.3% \n(E) 9.5% \n  325. An investor buys a one-year bond with a face amount of 100 and an annual coupon rate of 6% paid semiannually.  The bond is purchased at a discount of 1.50 to yield an annual nominal rate of j convertible semiannually.  Calculate j.  \n (A) 0.022 \n(B) 0.038 (C) 0.068 (D) 0.076 \n(E) 0.136 \n  326. A 20-year bond with 8% annual coupons is purchased at a price of P .  The face amount of the \nbond is F .  The price assumes an annual effective yield rate of 4%.  \n The change in book value of the bond during the 8\nth year is equal to 43.24. \n Calculate P . \n (A) 2315 \n(B) 2470 (C) 2625 (D) 2780",
    "page_number": "158"
  },
  "327": {
    "content": "An n-year annuity, with a payment of 1 at the end of each year, has a present value of 5.5554 at an annual nominal interest rate, convertible m  times per year.  \n Also:  \n \ni) j is the effective rate of interest per interest conversion period, and \nii) \n( )1mj+ = 1.0614. \n Calculate n.  (A)   7 \n(B)   8 (C)   9 (D) 10 \n(E) There is insufficient information to calculate n. \n  328. A customer has the option to either buy a car for cash for 15,000 or lease it with a down payment of 1000 and monthly payments of X  payable at the end of each month for three years.   \n Under the purchase option, the car has a value to the customer of 8000 at the end of three years.  At the end of the three- year lease, the car is returned and has no value to the customer. \n The customer is indifferent to the options at an annual nominal interest rate of 12% convertible monthly.  Calculate X . \n (A) 259 \n(B) 269 (C) 279 (D) 289",
    "page_number": "159"
  },
  "329": {
    "content": "A loan of 20,000 is to be repaid with ten increasing installments payable at the end of each year.  Each installment will be 10% greater than the preceding installment.  The annual effective interest rate on the loan is 9%.  \n Calculate the amount of principal in the second  installment.  \n (A)   292 \n(B)   527 (C)   975 (D) 1435",
    "page_number": "160"
  },
  "330": {
    "content": "At time \n0t=, 3 is deposited into an investment fund earning interest at a force of interest \n( )11t tδ= + . \n \nAt the same time, X  is as deposited into a bank account paying interest at an annual effective \ninterest rate of 5%.  \n In the third year, the interest earned on the first  account and the interest credited on the second  \naccount are exactly the same.  \n Calculate X . \n (A)   5.5 \n(B)   8.2 (C) 13.0 (D) 25.7 \n(E) 54.4 \n  \n161 331. \nCurrent loan rates are based on the following term structure of interest rates:  \nInvestment  \nLength (years)  Spot \nRate \n1 5.00%  \n2 5.25%  \n3 5.75%  \n4 6.25%  \n5 7.25%  \n A loan of 6000 is to be repaid with a single payment of principal plus interest at the end of five years.  The borrower has two choices:  \ni) a 5-year loan. \nii) a 3-year loan to be repaid with a single payment of principal plus interest by \ntaking out a 2-year loan at the beginning of year 4. \n \nCalculate the annual effective interest rate on the 2 -year loan such that the borrower  is indifferent \nbetween the two choices.  \n \n(A)   6.25% \n(B)   7.25% (C)   8.26% (D)   9.54% \n(E) 11.00% \n 332. \nAn investor wants to accumulate 150,000 to purchase a business in ten years.  The investor \ndeposits 14,000 into an account at the beginning of each of years one through five.  The investor deposits an additional amount X  at the beginning of years four and five to meet this goal. The \naccount earns interest at an annual effective rate of 8%.  \n Calculate X.   \n (A)   2,113 \n(B)   2,592 (C)   5,958 (D)   9,595 \n(E) 11,574 \n  \n162 333. \nDetermine which of the following statements about immunization strategies are true.  \n \nI. Redington immunization protects against any change in interest rates. \n II. Full immunization occurs only when the duration of the assets is greater than \nthe duration of the liabilities.  \n III. Immunization techniques strive to arrange the asset portfolio such that the \nconvexity of the assets is equal to the convexity of the liabilities. \n \n(A) None \n(B) I and II only  \n(C) I and III only \n(D) II and III only  \n(E) The correct answer is not given by (A), (B), (C), or (D). \n  334. Today’s deposit of 9550 earns an annual effective interest rate of i  for five years.  At the end of \nthe fifth year, the entire accumulated balance is reinvested into a 20 -year annuity-due.  The \nannuity-due has level annual payments of 756.97 at an annual effective interest rate of 4%.  Calculate i.  \n (A)   1.5% \n(B)   2.3% (C)   7.7% (D) 12.0% \n(E) 19.7% \n  335. A zero -coupon bond with a face value of 1000 sells for a price of 600 and matures in n years, \nwhere n is a whole number.  A second bond has the same price, same time until maturity, and same annual effective yield.  It pays annual coupons at an annual rate equal to 50% of the annual effective yield rate.   \n Calculate the face value of the second bond.  \n (A) 666.67 \n(B) 750.00 (C) 774.60  (D) 800.00 \n(E) 826.40 \n163 336. \nAn actuary invests 1000 at the end of each year for 30 years.  The investments will earn interest at a 4% annual effective interest rate and, at the end of each year, the interest will be reinvested at a 3% annual effective interest rate.  \n Calculate the accumulated value of the investment at the end of the 30-year period.  (A) 51,625 \n(B) 53,434 (C) 55,260 (D) 58,437 \n(E) 58,938 \n  337. A purchase of 5020 is paid off with a loan at an annual effective interest rate of 6.25%.  Payments are made at the end of each year until the loan is paid off.  Each payment is 360 except for a final balloon payment, which is less than 720.    Calculate the amount of the balloon payment.   (A) 611 \n(B) 630 (C) 649 (D) 667",
    "page_number": null
  },
  "340": {
    "content": "A 15-year bond with semiannual coupons is purchased for 2895.28.  The bond is redeemable for 1000.  The first coupon payment is equal to R  and each subsequent coupon is 1% larger than the \nprevious coupon payment.  The annual nominal yield rate on this bond is 6.2% convertible semiannually.  Calculate R . \n (A) 110 \n(B) 114 (C) 122 (D) 128",
    "page_number": null
  },
  "341": {
    "content": "An annuity writer sells an annual perpetuity-due, with a first payment of 3000.  The payments increase by 7% annually.  The purchase price, P , of the perpetuity is based on a 12% annual force of interest. \n  Calculate P . \n (A) 41,096 \n(B) 52,177 (C) 58,829 (D) 60,000  \n(E) 67,200 \n  \n165 342. \nAn investor opens a savings account with no initial deposit that pays a constant 4.5% annual force of interest.  The investor deposits 700 at the end of every six-month period for 20 years.  \n  The account balance immediately after the last deposit is X . \n Determine which of the following is an equation of value that can be used to solve for X . \n \n(A) \n39\n0.0225 0.9\n0700n\nne Xe−\n==∑  \n(B) 39\n0.0225 0.9\n0700n\nne Xe−\n==∑  \n(C) 39\n0.0225 0.9\n0700n\nne Xe−−\n==∑  \n(D) 39\n0.0225 0.9\n0700n\nne Xe\n==∑",
    "page_number": null
  },
  "343": {
    "content": "A five -year interest -only loan in the amount of 10,000 has  annual payments, and  an annual \neffective interest rate i .  At the end of year 5, the borrower  pays off the principal along with the \nlast interest payment.   \n To finance the principal payment, the borrower buys the following two zero-coupon bonds that both mature at the end of year 5.  \n \nTime of Purchase  Par Value  Annual \nEffective Yield  \nBond 1  End of year 3  2000  3.0%  \nBond 2  End of year 4  8000  2.5%  \n It costs the borrower a total of 2260.19 at the end of year 3 to pay the interest due and to buy Bond 1.  Calculate i . \n (A) 2.60% \n(B) 3.00% (C) 3.18% (D) 3.75% \n(E) 4.30% \n  \n166 344. \nA company faces the following liabilities at the end of the corresponding years:   \nYear  1 2 3 4 \nLiability  5,766  X 15,421  7,811  \n The company can invest in the following three annual coupon bonds redeemable at par:    \n Term (in years)  Annual coupon rate  \nBond A  1 1% \nBond B  3 5% \nBond C  4 7% \n The company invests in each bond so that the asset and liability cash flows are exactly matched.  \n Calculate X . \n (A) 1221 \n(B) 1245 (C) 1290 (D) 1318",
    "page_number": null
  },
  "345": {
    "content": "An n-year bond with an annual coupon rate of r  % has the following characteristics:   \n \ni) The face amount is 980. \nii) Coupons of 49 are paid semiannually. \niii) The annual nominal yield rate convertible semiannually is ( r + 1.8)%. \niv) The purchase price is 915.70.  v) The redemption value is 1000. \n Calculate n.  (A) 2 \n(B) 3 (C) 4 (D) 5",
    "page_number": null
  },
  "346": {
    "content": "A liability consists of a payment of 2000 to be paid six months from now and a payment of 1500 to be paid one year from now.   The only investments available are:  \n \ni) Six-month zero-coupon bonds with an annual nominal yield rate of 3.5% \nconvertible semiannually, and \nii) One-year par value bonds with an annual coupon rate of 6% payable semiannually \nand an annual nominal yield rate of 4.2% convertible semiannually. \n \nCalculate the total cost of a portfolio that exactly matches the liability cash flows.  \n \n(A) 3393 \n(B) 3404 (C) 3418 (D) 3447",
    "page_number": "167"
  },
  "347": {
    "content": "A store purchased couch #1 for X  two months ago and plans to sell it for 1500 six months from \ntoday.  The same store purchases couch #2 for X  today and plans to sell it for 1500 four months \nfrom today.  The annual force of interest is a constant 10%.  \n The current value of the store’s cash flows from the purchase and sale of couch #2 is 260.  Calculate the current value of the store’s cash flows from the purchase and sale of  \ncouch #1.  (A) 216 \n(B) 218 (C) 256 (D) 260",
    "page_number": null
  },
  "348": {
    "content": "You are given the following information regarding two annuities with annual payments:  \ni) Annuity X is a 20-payment annuity- immediate which provides an initial payment \nof 2500 and each subsequent payment is 5% larger than the preceding payment. \nii) Annuity Y is a 30-payment annuity-due which provides an initial payment of k  \nand each subsequent payment is 4% larger than the preceding payment.  \nUsing an annual effective interest rate of 4%, Annuity X and Annuity Y have the same present value.  \n Calculate k . \n (A) 1,758 \n(B) 1,828 (C) 1,901 (D) 2,078 \n(E) 2,262 \n  349. \nThe annual force of interest is \n2,10ttδ=− for \n  in which t  is measured  in years.   \nCalculate the equivalent annual nominal discount rate compounded every two years for the \nperiod \n  \n (A) 20% \n(B) 23% (C) 27% (D) 29% \n(E) 34% \n  350. A portfolio consists of two bonds.  Bond A is a three-year 1000 face amount bond with an annual coupon rate of 6% paid annually.  Bond B is a one- year zero -coupon bond.  Both bonds yield an \nannual effective rate of 4%.   Calculate the percentage of the portfolio to invest in Bond A to obtain a Macaulay duration of two years.  \n (A) 44.5% \n(B) 45.6% (C) 50.0% (D) 54.4% \n(E) 55.5%  \n169 351. \nBank A lends a certain sum of money at an annual effective interest rate of 7%.  The loan is to be repaid by 16 annual payments of 1000, with the first payment due after one year.    Immediately after receiving the 8\nth payment, Bank A sells the right to receive the remaining 8 \npayments to Bank B.  Bank A’s yield on the entire transaction is an annual effective interest rate of 6%.   Calculate the amount that Bank B paid to assume the loan.   (A) 5159 \n(B) 5541  (C) 5655  (D) 5971",
    "page_number": "168"
  },
  "352": {
    "content": "A zero -coupon bond with a face amount of 1000 sells for a price of 640 and matures in n years, \nwhere n is a whole number.  A second bond has the same price, same time until maturity, and same annual effective yield.  It pays annual coupons at an annual rate equal to 50% of the annual effective yield rate.   \n Calculate the face value of the second bond.  \n (A) 780 \n(B) 805 (C) 830 (D) 855",
    "page_number": null
  },
  "353": {
    "content": "A bond is priced at 950, giving an annual effective yield to maturity of 9%.  At 9%, the derivative of the price of the bond with respect to the yield rate is \n4750− . \n Calculate the Macaulay duration of the bond in years.  (A) 4.59 \n(B) 4.62 (C) 5.00 (D) 5.41 \n(E) 5.45 \n  \n170 354. \nAn investor purchases a portfolio consisting of three bonds.  Bond A has annual coupons of 6% and matures for its face amount of 1000 in ten years.  It is purchased for 1000.  Bonds B and C are zero -coupon bonds, maturing for 1000 each in five and ten year s, respectively.  All three \nbonds have the same yield rate.   Calculate the Macaulay duration in years at the time of purchase of the portfolio with respect to the common yield rate.  (A)   7.23 \n(B)   7.43 (C)   7.60 (D)   8.33 \n(E)   8.38 \n  355. An individual is to receive 1,000,000 today and 1,000,000 five years from today.   These payments are to be converted to an increasing annual perpetuity, with the first payment, X , \npaid today and each succeeding payment 1000 more than the previous payment.    At an annual effective interest rate of 4%, the present value of the two payments  is equal to the \npresent value of the perpetuity.  Calculate X . \n  (A) 45,074 \n(B) 47,877 (C) 51,923 (D) 55,000 \n(E) 66,795 \n  \n171 356. \nAt a force of interest 0.5,0 65 0.5t ttδ= ≤≤+an investment of 1000 at time t  = 2 will accumulate \nto X at time t = 6.  At an annual nominal rate of discount of 8% convertible quarterly, an \ninvestment of Y  will accumulate to  X at the end of two years.  \n \nCalculate Y . \n (A) 1124 \n(B) 1129 (C) 1134 (D) 1138",
    "page_number": null
  },
  "357": {
    "content": "An annuity has payments of 1000 at the beginning of every three months for six years.  Another annuity has payments of X at the end of the first, third, and fifth years. \n At an annual effective rate of 8%, the present values of the two annuities are equal.  Calculate X . \n (A) 7931 \n(B) 7981 (C) 8033 (D) 8085",
    "page_number": null
  },
  "358": {
    "content": "A retailer offers two payment plans:  \ni) A 2% discount if paid within 10 calendar days after purchase \nii) Pay the full amount on the 30\nth day after purchase  \n Assume a 365- day year.  \n The implied annual effective yield the buyer is charged for delaying payment from day  1 to day \n30 is i . \n Calculate i . \n (A) 24.3% \n(B) 26.8% (C) 27.9% (D) 36.5% \n(E) 44.6% \n  359. A perpetuity pays X  at the end of the third year, 2 X at the end of the sixth year, 3X  at the end of \nthe ninth year, etc.  At a 6% annual effective interest rate, the present value of the perpetuity is 655.56.  Calculate X . \n (A)   2 \n(B) 17 (C) 20 (D) 33",
    "page_number": "172"
  },
  "360": {
    "content": "A perpetuity- immediate has monthly payments that increase by 5% every 12 payments.  The \ninitial 12 payments are 500 each.  The present value of this perpetuity- immediate, using an annual effective interest rate of  8% is X . \n Calculate X . \n (A) 191,881 \n(B) 197,637 (C) 200,009 (D) 207,231 \n(E) 209,546 \n  361. A level monthly contribution of X  is required to purchase an annual perpetuity of 5000 that \ncommences five years from today.  \n The contributions are made at the end of each month for 60 months.  The last contribution is made at the same time as the first payment from the perpetuity.  \n The annual nominal interest rate is 12% compounded monthly.  Calculate X . \n (A) 402 \n(B) 483 (C) 510 (D) 544",
    "page_number": "173"
  },
  "362": {
    "content": "A payment of 55,400 made today returns  payments of 10,000 at the beginning of each year for \nten years.  These payments are deposited into an account that earns interest at an annual effective rate of 6% payable at the end of each year.  The interest is immediately reinvested at an annual \neffective interest rate of 4%.  The original payment earns an annual effective yield rate of i  over \nthe ten -year period. \n Calculate i . \n (A)   9.0% \n(B)   9.5% (C) 10.0% (D) 10.5% \n(E) 11.0% \n  363. An investor deposits 1000 at the beginning of each year for five years in a fund earning a 5% annual effective interest rate.  The interest from this fund can be reinvested at a 4% annual effective interest rate.  \n Calculate the total accumulated value at the end of five years.  \n (A) 5058 \n(B) 5227 (C) 5436 (D) 5641",
    "page_number": "174"
  },
  "364": {
    "content": "Consider an amortization schedule for a loan at interest rate i  per period, i  > 0, being repaid with \npayments of 1 at the end of each period for n periods.  Determine which of the following statements about this schedule is true.  \n \n(A) The total interest paid equals \nnna−. \n(B) The total interest paid equals nia. \n(C) The total principal repaid equals nn ia− . \n(D) The principal repaid in payment t  equals ntv−. \n(E) The total payment amount equals na. \n  \n175 365. \nA loan of 100 is to have all principal and accrued interest paid at the end of five years.  Interest accrues at an annual effective rate of 5% for the first two years and at a force of interest at time t  \nin years \n) 2 (>t  of 1\n1ttδ=+. \n Calculate the equivalent annual effective rate of discount for the five -year period. \n (A) 10.9% \n(B) 13.0% (C) 14.6% (D) 15.4% \n(E)       17.1%   366. The following deposits are made into a fund at the beginning of each year:     Year  \n Deposit \n 1 100 \n 2 100 \n 3 150 \n 4 150 \n 5 150 \n The fund earns an annual effective interest rate of 13%.  \n At the end of the tenth year, the fund is used to purchase a perpetuity- immediate with  semiannual \npayments of X .  The perpetuity earns an annual effective interest rate of 12%.  \n Calculate X . \n (A)   99 \n(B) 102 (C) 105 (D) 180",
    "page_number": null
  },
  "367": {
    "content": "An investor deposits 225 into a bank at the beginning of each month for 20 years.  The bank pays interest at an annual effective rate of 8%.  \n At the end of 20 years, the investor uses the money in the bank to buy a 30- year annuity-due with \nannual payments of X .  These annual payments are based on an annual effective interest rate of  \n7%. \n Calculate X . \n (A)   9,642 \n(B)   9,704 (C)   9,981 (D) 10,317 \n(E) 10,383 \n  368. Harry borrows 10,000 from Sally and agrees to repay the five- year loan with equal payments at \nthe end of each quarter.  Interest on the loan is charged at an annual nominal rate of 6% convertible quarterly.  Immediately after the fourth payment, Harry and Sally get married and Sally forgives the remaining debt.  Calculate the total interest payments that Sally forgoes receiving by having forgiven the remaining debt.  (A)    582 \n(B)    951 (C) 1,088 (D) 1,270 \n(E) 1,769 \n    \n177 369. \nA loan of 100,000 at an annual effective rate of 9.12% is repaid with level payments at the end of each month over 15 years.  Immediately after the 59\nth payment is made, the outstanding balance \nis refinanced at an annual effective rate of 5.76%.  The term of the refinanced loan is 20 years with level payments at the end of each month. \n \nCalculate the interest portion of the first payment of the refinanced loan.  (A) 375 \n(B) 378 (C) 381 (D) 384",
    "page_number": "176"
  },
  "370": {
    "content": "5000 is borrowed at an annual nominal rate of interest of j  convertible monthly.  The loan is \nrepaid with  payments of 291.23 at the end of each quarter for 5 years. \n Calculate j.  \n (A) 5.97% \n(B) 6.00% (C) 6.04% (D) 6.09% \n(E) 6.14% \n    \n178 371. \nThe prices for four 1000 face amount zero-coupon bonds are as follows: \n \n \n \n \n \n \n \nDetermine which of the following statements describes the yield curve underlying these prices. \n (A) The yield curve is increasing with constant slope. \n(B) The yield curve is flat.  \n(C) The yield curve is inverted with constant slope. (D) The yield curve is concave upward. \n(E) The yield curve is concave downward. \n  372. A five -year 1000 face amount bond with  10% annual coupons is purchased at time of issue for \n1216.47 based on an annual effective interest rate of 5%. \n \nCalculate the Macaulay duration.  \n (A) 2.9 \n(B) 3.2 (C) 3.7 (D) 4.1 \n(E) 4.3 \n  Price Term  \n(in years)  \n943.40 1 \n747.26 5 \n558.39 10 \n311.80 20 \n179 373. \nA loan is originally scheduled to be paid in installments of 1000 payable at the end of each month for three years.  The amortization is calculated with an annual nominal interest rate of 9% convertible monthly.  After paying one full year of scheduled installments, the borrower increases monthly payments to 2000, resulting in a final drop payment.     Calculate the number of months after the first year that it takes for the borrower to pay off the loan.  (A) 10  \n(B) 11  (C) 12  (D) 13",
    "page_number": null
  },
  "374": {
    "content": "A car dealership offers a 120 -month loan for a blue car costing 30,000, with an annual nominal \ninterest rate of 9% compounded monthly and level end-of-month payments.  The dealership also offers a loan for a red car costing 33,000, with the same interest rate and end-of-month payments as for the loan for the blue car.  Calculate the number of months needed to pay off the loan for the red car.   (A) 132 \n(B) 135 (C) 138 (D) 140",
    "page_number": null
  },
  "375": {
    "content": "Two bonds have the same annual effective yield rate, r , where r  > 0.  The bonds have Macaulay \nduration of 5 years and 6 years with respect to r .  One of the bonds has modified duration of 5.76 \nyears while the other bond has modified duration of d years.  \n Calculate d.  (A) 4.760   \n(B) 4.800 (C) 5.208 (D) 5.240    \n(E) 6.912 \n  \n180 376. \nThe modified duration of a ten- year zero -coupon bond with an annual effective yield rate of i is \n9.26 years.    Based on an annual effective interest rate of i,  the Macaulay duration of a ten -year annuity-\nimmediate with level annual payments is D .   \n Calculate D . \n (A) 4.05 \n(B) 4.37 (C) 4.51 (D) 4.87 \n(E) 4.96 \n  377. A bank offers a loan to each of two borrowers with different credit scores.  Both loans are for the same amount.    The first borrower is charged a monthly effective interest rate of 1% and makes level end -of-\nmonth payments of X  for n months to pay off the loan. \n The second borrower is charged a monthly effective interest rate of 2.01% and makes level end-of-month payments of 2.01X  for 200 months to pay off the loan. \n Calculate n.  (A) 200 \n(B) 250 (C) 300 (D) 350",
    "page_number": null
  },
  "378": {
    "content": "A 20 -year non-callable bond that pays coupons annually has a face amount of 2000.  The bond \nwas bought at a price of 2300 and has an annual effective yield rate of 7%.  A 20 -year callable bond with the same annual coupon rate and face amount is callable for 2000 \nat the end of the 18\nth or 19th year.  \n Calculate the maximum price of the callable bond that guarantees an annual effective yield of at \nleast 7%.  \n (A) 2268 \n(B) 2276 (C) 2285 (D) 2293",
    "page_number": "181"
  },
  "379": {
    "content": "An investor deposits 50,000 into a new savings account, which earns an annual effective discount rate of 3.2%.  The investor then withdraws an amount X  at the end of every two -year \nperiod.  The balance at the end of 12 years, just after the withdrawal, is 45,000.  Determine which of the following is an equation of value that can be used to solve for X . \n \n(A) \n7\n12 2( 1)\n145,000 150,000(1.032) (1.032)k\nkX−\n=+=∑    \n(B) 6\n12 2\n145,000 150,000(1.032) (1.032)k\nkX\n=+=∑  \n(C) 6\n12 2\n145,000(0.968) (0.968) 50,000k\nkX\n=+=∑  \n(D) \n( )6\n2\n12\n145,000(0.968) 50,000\n1.032k\nkX\n=+=∑     \n(E) ( )612\n2\n1145,000 0.968 50, 000\n(1.032)k\nkX\n=+=∑  \n  \n182 380. \nAnnual payments of 240 are made at the end of each year to repay a loan of 3400.  The payments are based on an annual effective interest rate of 4.5%.  The loan is settled with a drop payment of X. \n Calculate X . \n (A)   1.61 \n(B)   4.53 (C)   8.83 (D) 12.48 \n(E) 13.04 \n  381. You have decided to invest in a newly issued 20-year bond with annual coupons and the following characteristics:  \n \ni) The price at issue is 1321. \nii) The face amount is 1111. \niii) The annual coupon rate is 10%. \niv) The bond is callable for 1111 immediately after the payment of either the 18\nth or 19th \ncoupon. \n Calculate the minimum possible annual effective yield rate that you can earn.  \n (A) 7.881% \n(B) 7.937% (C) 7.985% (D) 8.028% \n(E) 8.065% \n  \n183 382. \nA company would to be protected from large interest rate changes.  It has  a liability of 5000 due \nat time 3, and three possible sets of asset cash flows:  \n  \n I. 11511.72A= , 43500.00 A=  \n II. 23481.00 A= , 41412.20 A=  \n III. 12580.95A= , 42625.00 A=  \n \nwhere tA is the asset cash flow at time t .   \n The effective interest rate is 5% per time period.  \n Determine which set(s) of asset cash flows fully immunize the liability.  \n (A) I only \n(B) II only  \n(C) III only  \n(D) I, II, and III  \n(E) The correct answer is not given by (A), (B), (C), or (D). \n  383. A company's liabilities are 20,000 today and 100,000 five years from today.  The Macaulay duration of the company's liabilities with respect to the market annual effective yield rate is 3.70 years.  \n Calculate the modified duration of the company's liabilities, in years.  (A) 3.26 \n(B) 3.31 (E) 3.52 \n(D) 3.65 \n(E) 4.14 \n  \n184 384. \nA 15 -year bond with a face amount of 5000, a redemption value of C , and an annual coupon rate \nof 7% paid quarterly is purchased at a price that yields an annual nominal rate of 5.6% convertible quarterly.    The amount for amortization of premium in the third coupon payment is 6.88.  Calculate C . \n (A) 5150 \n(B) 5165 (C) 5190 (D) 5235",
    "page_number": null
  },
  "385": {
    "content": "A three-year 1000 face amount bond pays coupons of X  quarterly.  It is bought at a price to yield \nan annual nominal rate of 8% convertible quarterly.  If the amount of each coupon were doubled, the purchase price would have to increase by 500 for the bond to maintain the same yield rate.  Calculate X . \n (A) 20 \n(B) 24 (C) 31 (D) 40",
    "page_number": null
  },
  "386": {
    "content": "An annuity has the first monthly payment of 750 occurring in five years.  Each payment thereafter is 1.0% greater than the preceding payment.  The final payment occurs exactly 15 years after the first payment.   The annuity has a present value of P  based on an annual nominal interest rate of 7.2% \ncompounded monthly.   Calculate P . \n (A) 136,551 \n(B) 137,370 (C) 138,440 (D) 189,523 \n(E) 198,217 \n  \n185 387. \nAn investor purchases a geometrically decreasing perpetuity-due that provides annual payments. The first payment is 1, and each subsequent payment is 1% less than the previous payment.  At the time of purchase, the Macaulay duration of the perpetuity-due is 12.00 years.  Calculate the modified duration of the perpetuity -due, in years, at the time of purchase.  \n (A) 10.97 \n(B) 11.11 (C) 11.19 (D) 12.81 \n(E) 12.88 \n  388. A restaurant owner takes out a 120-month loan of 10,000 today.  To  pay off the loan, the owner \nwill make end -of-month payments of  P  for each of the first 30 months, 1.1P   for each of the \nnext 40 months, and 1.2P   for each of the final 50 months. \n The monthly payments are based on an annual nominal interest rate of 6% compounded monthly.  Determine which one of the following is an equation of value that can be used to calculate P. \n \n(A) \n30 0.005 40 0.005 50 0.00510,000 1.1 1.2 Pa Pa Pa= ++    \n(B) 30 0.005 40 0.005 50 0.00510,000 1.1 1.2 Pa Pa Pa= ++  \n(C) ( )( ) ( )( )30 40\n30 0.005 400. 005 50 0.00510,000 1.005 1.1 1.005 1.2 Pa Pa P a−−= ++  \n(D) ( )( ) ( )( )30 70\n30 0.005 400. 005 50 0.00510,000 1.005 1.1 1.005 1.2 Pa Pa P a−−= ++    \n(E) ( )( ) ( )( )30 70\n30 0.005 400. 005 50 0.00510,000 1.005 1.1 1.005 1.2 Pa Pa P a−−= ++  \n  \n186 389. \nAn asset provides equal annual payments, with the first payment occurring one year from today.  Based on an annual effective interest rate of  j , the present value of the payments provided by the  \nasset is 10 and the modified duration is 4 years.  If all payments were deferred six years so that payments began at the end of the seventh year, the modified duration at interest rate j  would be 9 years. \n If the original set of cash flows is altered by adding a single payment of 3 today, the Macaulay duration of the altered cash flows is X years, at interest rate j . \n Calculate X.  \n (A) 3.08 \n(B) 3.42 (C) 3.69 (D) 3.75 \n(E) 4.04   \n  390. Company ABC is considering the following three investments:  \ni) Investment X is a 50 -year zero -coupon bond \nii) Investment Y is a perpetuity with annual payments \niii) Investment Z is a geometrically increasing perpetuity with annual payments that increase at a rate of 3% per year  \n For both perpetuities, the first payment will occur one year from now.  The convexities of Investments X, Y, and Z are x , y, and z , respectively, based on an annual \neffective interest rate of 5%.  \n Determine which expression represents the relationship between the convexity of the three investments.  \n (A) x < z < y \n(B) y < x < z \n(C) y < z < x \n(D) z < x < y \n(E) z < y < x \n  \n187 391. \nA company is considering a project where it expects to pay and receive the following cash flows:  \nEnd of  \nyear  \nCash flow  \n2 Receives X \n4 Pays Y \n6 Receives X \n When calculated using an annual effective rate of  i (i > 0) , the present value of this project is \nequal to 0.  Determine i . \n \n(A) \n224\n2YY X\nX±− \n(B) 22412YY X\nX±−− \n(C) 22412YY X\nX−± −− \n(D) \n2221\n4X\nYY X−\n−± −",
    "page_number": null
  },
  "392": {
    "content": "Payments of 200 are invested at the beginning of each year for five years.  The payments earn interest at an annual effective interest rate of i.   The interest is reinvested at the end of each year \nat an annual effective rate of 6.00%.  At the end of the five-year period, the value of the fund including both the sum of the annual payments and the accumulated value of the interest is 1260. \n \nCalculate i . \n (A)   8.00% \n(B)   8.75% (C) 10.00% (D) 11.25% \n(E) 12.25% \n  \n188 393. \nAn annual perpetuity-due pays 20,000 for the first five years and 50,000 thereafter.   \n \nAt an annual effective interest rate of 3% for the first five years and i  thereafter, the present value of the \nperpetuity is 1,000,000.  \n \nCalculate i.  \n \n(A) 4.50% \n(B) 4.75% (C) 5.00% (D) 5.50% \n(E) 5.85% \n  394. \nGiven a force of interest \n,81\n+=ttδ  where t  is measured in years, calculate the effective rate of \ninterest during the 5th year.  \n \n(A) 7.4% \n(B) 7.7% (C) 8.0% (D) 8.3% \n(E) 8.7% \n  395. At an annual effective interest rate of 5%, the present value of an increasing perpetuity-due with annual payments of 1, 2, 3, etc., is equal to X .  \n Calculate X . \n (A) 400 \n(B) 420 (C) 440 (D) 441 \n(E) ∞ \n  \n189 396. \nThe present value of a series of payments of 1 made every six months forever, with the first \npayment made immediately, is equal to 23.  Calculate the annual effective rate of interest.  \n (A) 4.3% \n(B) 4.5% (C) 8.9% (D) 9.1% \n(E) 9.3% \n  397. An annuity-immediate has quarterly payments of 100, 200, 300, and 400 each year for ten years. At a nominal annual rate of 12% convertible quarterly, the present value of the annuity is P . \n Determine the equation of value.  \n \n(A) \n( )10 12% 4 3%100P Ia a=   \n(B) ( )10 12% 4 3%100P Ia a=  \n(C) ( )10 12.55% 4 3%100P Ia a=  \n(D) ( )10 12% 4 3%100P Ia a=   \n(E) ( )10 12.55% 4 3%100P Ia a=   \n \n 398. A perpetuity-immediate has annual payments starting at 1, increasing by 1 each year until it reaches 10, then decreasing by 1 each year until it reaches 5, and remaining at  5 thereafter.  \n The present value of this perpetuity at an annual effective interest rate of 9% is X . \n Calculate X . \n (A) 51 \n(B) 53 (C) 55 (D) 58",
    "page_number": null
  },
  "399": {
    "content": "Jennifer paid X  for a ten -year 10,000 face amount bond at issue with an annual coupon rate of \n5% paid annually.  She immediately reinvests the coupons at an annual effective interest rate of 8%.  The annual effective yield on her investment of X  is 8.5% over the ten- year period.  \n Calculate X . \n (A) 7626 \n(B) 7704 (C) 7987 (D) 8068",
    "page_number": "190"
  },
  "400": {
    "content": "A ten -year loan of 1000 is repaid by level payments at the end of each month at an annual \nnominal interest rate of 8%, compounded monthly.  The lender invests the repayments at an annual nominal interest rate of 6%, compounded monthly.  Calculate the lender’s annual effective yield rate.  \n (A) 6.8% \n(B) 6.9% (C) 7.0% (D) 7.1% \n(E) 7.2% \n  401. An investor borrows 13,650 at an annual effective interest rate of 7%.  Level payments are made at the end of each year.  The interest paid in the last payment is 65.42.  Calculate the principal repaid in the first payment.  \n (A) 44.50 \n(B) 45.00 (C) 45.50 (D) 46.00 \n(E) 46.50 \n  \n191 402. \nYou are given an interest rate i , a real rate of interest i′, and an  inflation rate r.   \nAll rates are annual effective rates.  \n Determine i , in terms of \ni′ and r . \n \n(A) ir′+ \n(B) i r ir′′++  \n(C) i r ir′′+−  \n(D) ( ) ( )( )1 11i ir′′+−+ − \n(E) 2 i r ir′′+−  \n  403. At the beginning of a year, Rachael invests 10,000 in Fund X earning an annual nominal interest rate of 9% convertible quarterly.    At the end of the year and each successive year, she withdraws the accumulated interest from Fund X and reinvests it into Fund Y, earning an annual effective interest rate of i . \n The balance of Fund Y immediately after the fifth interest deposit is 5461.  \n Calculate i . \n (A) 7.9% \n(B) 8.0% (C) 8.1% (D) 8.2% \n(E) 8.3% \n  \n192 404. \nThe following term structure of interest rates is based on available bond market data as of 01/01/2023:  \nTerm to \nmaturity \n(years)  Spot  Rate \n1 3.0%  \n2 3.5%  \n3 4.0%  \n \nA three-year 1000 face amount bond with an annual coupon rate of 10% paid annually is issued on 01/01/2023.  Calculate the yield to maturity for this bond.  (A) 3.82% \n(B) 3.86% (C) 3.90% (D) 3.94% \n(E) 3.98% \n  405. A borrower plans to repay a loan of 12,000 with payments to be made at the end of each month for five  years.  The loan payments are based on an annual nominal interest rate of 12%, \nconvertible monthly.   Each payment after the first will be 1% larger than the previous one.  \n Calculate the amount of principal repaid in the first payment.  \n (A)   82 \n(B) 120 (C) 147 (D) 202",
    "page_number": null
  },
  "406": {
    "content": "An investor purchases a Treasury bond for 100 today.  The bond earns an annual effective rate of interest of 9%.  The annual rate of inflation is 5%.  Calculate the real annual effective rate of interest earned by the investor.  \n (A) −3.7%  \n(B)   3.8% (C)   4.0% (D) 14.0% \n(E) 14.5% \n  407. A person borrows 150,000 to purchase a house.  The borrower makes interest-only payments at the end of each month for five years, then makes payments of 1000 at the end of each month.  Interest accrues at a nominal annual rate of 4% convertible monthly for the first five years and then at a nominal annual rate of 6% convertible monthly.  Determine the total number of payments it will take to repay the loan.  \n (A) 209 \n(B) 269 (C) 278 (D) 329",
    "page_number": "193"
  },
  "408": {
    "content": "You are given the following table of spot rates to calculate the present value of a level four -year \nannuity- immediate: \n \nLength of \ninvestment \nin years   \nSpot \nrate \n1 4.25%  \n2 4.50%  \n3 4.75%  \n4 5.00%  \n Calculate the annual effective interest rate for this annuity.  \n (A) 4.52% \n(B) 4.63% (C) 4.74% (D) 4.85% \n(E) 4.87% \n  409. A ten -year mortgage is to be repaid with annual level payments at the end of the year.  The \nmortgage is paid assuming an annual effective interest rate of 6%.  Calculate the Macaulay duration of this mortgage.  (A)   4.74 \n(B)   5.02 (C)   7.36 (D) 10.00 \n(E) There is insufficient information to calculate the Macaulay duration.   \n  410. A student invested a math competition prize into a savings account.  The account receives interest quarterly, and the account balance increases by 4.5% each year.  Determine the correct term that the 4.5% figure represents.  \n (A) annual effective interest rate  \n(B) force of interest  \n(C) annual nominal interest rate, convertible quarterly (D) annual discount rate  \n(E) annual simple interest rate  \n  \n195 411. \nJeremy purchases a perpetuity providing a payment of 1 at the end of each year.  The perpetuity’s modified duration is 15 years.  Calculate the Macaulay duration of this perpetuity.  (A) 14.00 \n(B) 14.46 (C) 15.07 (D) 15.94 \n(E) 16.00 \n  412. A two -year annuity-immediate with level annual payments has a Macaulay duration of D  using a \nforce of interest of\nδ.  \n Determine D .  \n \n(A) 12\n1e\ne\n\n\n \n(B) 212\n1e\ne\n\n\n \n(C) 21\n1e\ne\n\n\n \n(D) 21\n1e\ne\n\n\n",
    "page_number": "194"
  },
  "413": {
    "content": "A graduate takes out a 60-month car loan at an annual nominal interest rate of 3% convertible monthly.  The loan provides for a payment of 359.37 at the end of each month.  The graduate failed to make the 25\nth and 26th payments.  Beginning with the 27th month the graduate resumes \npayments of 359.37 at the end of each month, with a final balloon payment at the end of the 60th \nmonth made necessary by the two missed payments.    Calculate the outstanding loan balance immediately following the payment at the end of the 36\nth \nmonth.  (A) 8298 \n(B) 8361 (C) 8723 (D) 9036",
    "page_number": "196"
  },
  "414": {
    "content": "At the beginning of the year, an entrepreneur deposited money into a savings account.  At the end of the year, the entrepreneur had earned a total of 400 in interest and had an account balance of 8000.  Determine which annual quantity exactly equals 5%.  (A) Nominal discount rate  \n(B) Discount factor (C) Effective discount rate  \n(D) Effective interest rate     \n(E) Force of interest  \n    \n197 415. \nLoan A is a 96-month loan with an annual nominal interest rate of 7.2% compounded monthly.  This loan is repaid with equal payments of m  at the end of each of the first 48 months followed \nby payments of 1.5m  at the end of each of the last 48 months. \n Loan B is also a 96-month loan with the same annual nominal interest rate compounded monthly. This loan is repaid with equal payments of 1.2m  at the beginning of each of the first 48 months \nfollowed by payments of 0.9m  at the beginning of each of the last 48 months. \n Calculate the ratio of the amount of Loan A to the amount of Loan B.  (A) 1.127 \n(B) 1.133 (C) 1.145 (D) 1.152 \n(E) 1.190 \n  \n416. \nBond A and bond B are both annual-coupon bonds.    Bond A is an m -year bond with face amount 1000 and price 800, where m  is a whole number.  \nThe coupon rate is half of the yield rate.  Bond B is a 3m -year bond with the same face amount, coupon rate, and yield rate as bond A. \n Calculate the price for bond B.  (A) 400 \n(B) 512 (C) 608 (D) 671",
    "page_number": null
  },
  "417": {
    "content": "A non- callable n -year 5000 face amount annual-coupon bond has a price of 4361, an annual \ncoupon rate of 5%, and an annual effective yield rate of 6%.  Another n-year 5000 face amount annual-coupon bond, with an annual coupon rate of 5%, is callable at par at the end of any year from the ( n – 10)\nth year to the nth year, inclusive. \n Calculate the maximum price that an investor should be willing to pay for the callable bond, to guarantee at least a 6% annual effective yield rate.  \n (A) 3944 \n(B) 3948 (C) 3967 (D) 4361",
    "page_number": "198"
  },
  "418": {
    "content": "A credit card charges an annual continuously compounded interest rate of 18%, plus a fee of 20 at the end of each year.  These fees accrue interest once they are charged.  \n A borrower, upon receiving the credit card, immediately purchased a piano for 1500 with the card.  \n The borrower then made a payment of X  at the end of every month.  At the beginning of the third \nyear, the borrower’s credit card balance was 200.  \n Determine which of the following is an equation of value that can be used to solve for X . \n \n(A) \n24\n0.18 0.36 0.015 0.36\n11500 20 20 200k\nke e Xe e−− − −\n=++− = ∑  \n(B) 24\n0.18 0.36 0.015\n11500 20 20 200k\nke e Xe−− −\n=++− = ∑  \n(C) 24\n0.18 0.36 0.015 0.36\n11500 20 20 200k\nke e Xe e\n=++− = ∑  \n(D) 24\n22\n11220 20 20 20015001.18 (1.18) (1.18 )(1.18)k\nkX\n=++ − = ∑",
    "page_number": null
  },
  "419": {
    "content": "A bank issues two bonds with the same annual effective yield rate.  The first bond is a 10- year \nzero-coupon bond with a price of 3000 and a face amount of 5000.  The second bond is a 15- year \nbond providing quarterly coupons, with a price of 1000 and a face amount of 950.  Calculate the annual coupon rate for the second bond.  (A) 5.24% \n(B) 5.36% (C) 5.58% (D) 5.65% \n(E) 5.76% \n  420. A perpetuity-due with annual payments is priced at X  based on an annual effective interest rate of \n7%.  The amount of the first payment is 350.  Each payment, from the second through the fifth, is 3% larger than the previous payment.  Each of the sixth and subsequent payments is equal to the fifth payment.   Calculate X . \n (A) 5249 \n(B) 5530 (C) 5617 (D) 5917",
    "page_number": "199"
  },
  "421": {
    "content": "A 15-year bond is purchased at a premium.  The bond has an annual effective yield rate of 7.4% and pays semi-annual coupons.  Determine which of the following statements about this bond must be true.  (A) The face amount is greater than the purchase price.  \n(B) The redemption value is greater than the purchase price. (C) The redemption value is greater than the face amount.  \n(D) The face amount is greater than the redemption value. \n(E) The purchase price is greater than the redemption value. \n  \n200 422. \nA home buyer borrows 225,000 and has two options to repay the loan, both at an annual nominal interest rate of i , convertible monthly: \n Option 1: Level payments of 1960 at the end of each month for 180 \nmonths. \n Option 2: Level payments of X  at the beginning of each month for 360 \nmonths. \n Calculate X . \n (A) 1415 \n(B) 1418 (C) 1422 (D) 1427",
    "page_number": null
  },
  "423": {
    "content": "Bond A pays 1 at the end of each year in perpetuity.  Bond B is a zero coupon bond that matures in ten years.  The Macaulay duration of bond A is twice that of bond B.   Calculate the modified duration of bond A.   (A) 19.0 \n(B) 19.5 (C) 20.0 (D) 21.0 \n(E) \n∞ \n    \n201 424. \nAn insurance company plans to sell an annual perpetuity- immediate, where each payment after the \nfirst payment is 2% less than the previous payment.  The company has chosen a price for this annuity and needs to calculate the amount of the first payment.  The annual effective yield rate is 7.8%, but the company mistakenly uses 8.7% and therefore incorrectly calculates 1500 for the first payment.  Calculate the correct first payment.  \n (A) 1299 \n(B) 1309 (C) 1345 (D) 1374",
    "page_number": null
  },
  "425": {
    "content": "A company has liabilities of 1000 and 750 due at the end of years two and four, respectively.  The company creates an investment portfolio that produces asset cash flows of X  immediately \nand Y  at the end of year three.  The portfolio is constructed to match the present value and \nduration of the company’s payment obligations, using an annual effective interest rate of 6%.   Calculate Y . \n (A) 1000 \n(B) 1385 (C) 1650 (D) 1667",
    "page_number": null
  },
  "427": {
    "content": "An investor has purchased an 18-year 7000 face amount bond with an annual coupon rate of 6% paid annually.  The redemption value of the bond is 7500.  The purchase price, P , results in an \nannual effective yield of i.   \n Upon receipt, each coupon payment is immediately reinvested in an account earning an annual effective rate of 5.70%.  Immediately following the receipt of the last payment from the 18- year \nbond, the investor has earned an annual effective yield of 5.18% on the original investment of P . \n Calculate i . \n (A) 4.54% \n(B) 4.56% (C) 4.79% (D) 4.91% \n(E) 5.13% \n  428. You are given the following information regarding two perpetuities:  \ni) Perpetuity X provides payments of 3000 every six months with the first payment due immediately.  \nii) Perpetuity Y provides payments of k  every two years with the first payment due \none year from now. \niii) Based on an annual effective interest rate of 4.94%, Perpetuity X and Perpetuity Y have the same present value.  \n Calculate k . \n (A)  12,150 \n(B)  12,450 \n(C)  12,750 \n(D)  13,050 \n(E)  13,380  \n  \n203 429. \nA bond with an annual coupon rate of 9% paid annually matures in ten years.  The annual effective yield rate is 10%.   Calculate the modified duration of this bond.  (A) 6.27 \n(B) 6.32 (C) 6.47 (D) 6.89 \n(E) 7.58 \n  430. A zero -coupon 1000 face amount bond sells for a price of 890 and matures in n years, where n is \na whole number.  A second bond has the same price, same time until maturity, and same annual effective yield.  It pays annual coupons at an annual rate equal to 50% of the annual effective yield rate.   \n Calculate the face value of the second bond.  \n (A) 938 \n(B) 942 (C) 945 (D) 948",
    "page_number": "202"
  },
  "431": {
    "content": "A ten -year 1000 face amount bond has an annual coupon rate of 6% paid semiannually.  The \nbond is purchased at a premium, to yield an annual effective interest rate of 5%.   Calculate the amount of the amortization of premium in the 12th coupon.  (A) 3.85  \n(B) 3.95  (C) 4.00  (D) 4.10  \n(E) 4.26  \n  \n204 432. \nDetermine which of the following statements about Redington immunization is true.  \n (A) A difference between Redington immunization and full immunization is that the \n duration condition does not need to be satisfied for Redington immunization. (B) A portfolio that satisfies the Redington immunization conditions requires less  rebalancing than a cash -flow matched portfolio. \n(C) Redington immunization requires that the convexity of the liabilities is greater than the \nconvexity of the assets. \n(D) A Redington-immunized portfolio has a duration of zero and a convexity smaller than \nzero.  \n(E) Redington immunization is designed to provide surplus protection for small, parallel \nchanges in interest rates.  \n  433. Interest on a 20- year loan is charged based on an annual effective rate of 10.1%. \n The loan is repaid by payments of 100 at the end of each of the years 1 through 5 and each of the years 11 through 20.  During years 6 through 10 no payments are made.    Calculate the absolute value of the difference between the outstanding balance immediately after the payment in year 5 and the outstanding balance immediately after the payment in year 15.  (A)     0 \n(B) 142 (C) 144 (D) 234",
    "page_number": null
  },
  "434": {
    "content": "You are given the following information about two 30-year 1000 face amount bonds, A and B, each yielding an annual nominal interest rate of i % convertible semiannually. \n \ni) Bond A has an annual coupon rate of 9% paid semiannually and has a price of \n1249.45. \nii) Bond B has an annual coupon rate of 8% for the first 15 years and 10% for the \nlast 15 years, all paid semiannually. \n Calculate the price of Bond B.  \n (A) 1150 \n(B) 1160 (C) 1170 (D) 1180",
    "page_number": "205"
  },
  "435": {
    "content": "A 20 -year 1000 face amount bond has an annual coupon rate of 6%, payable semiannually.   \n The bond is callable for 1060 at the end of the 10\nth year and for 1030 at the end of the  \n15th year.  \n Calculate the highest price for the bond that guarantees an annual nominal yield rate of 5%, convertible semiannually.  \n (A) 1115 \n(B) 1119 (C) 1126 (D) 1135",
    "page_number": null
  },
  "436": {
    "content": "Elinor is receiving her lottery winnings in the form of a perpetuity so that she will have money to leave to her heirs . You are given the following information: \n \ni) Payments are annual and began on January 1, 2000. \nii) Payments increase by 1,000 each year after the first year.  \niii) The present value of her lottery winnings on January 1, 2000 was 1,000,000, \nimmediately before the first payment, based on an annual effective interest rate of 10%. \n Calculate the present value of Elinor’s lottery winnings on January 1, 2020, immediately after the payment at that time, using an annual effective interest rate of 10%.  (A) 1,008,181 \n(B) 1,119,091 (C) 1,200,000 (D) 1,210,000 \n(E) 1,219,999 \n  437. Kelly purchases a 25 -year annual coupon bond for 20,000 with an annual effective yield rate of  i.  \nThe amount for the accumulation of discount in the first coupon is 50.    The bond's book value is 20,491.51 just after the 8\nth coupon payment and 21,263.74 just after the \nth16 coupon payment. \n Calculate the bond's redemption value.  (A) 22,135 \n(B) 22,170 (C) 22,234 (D) 22,671 \n(E) 23,660 \n    \n207 438. \nThe full price of orthodontic treatment is X .  The patient must pay at least a portion of the \nbalance by Day 15 (fifteen days following the beginning of the work).  The two payment options are: \n  i) Pay the full balance, less a 2.5% discount, on Day 15.   \n  ii) Pay 250 on Day 15 and the remaining balance, without interest, on Day 60.   \n Assume a 365- day year.  \n The implied effective annual yield rate the patient is charged for delaying full payment from Day 15 to Day 60 is 24.2%.    Calculate X . \n (A)   697 \n(B)   875 (C) 1675 (D) 3295",
    "page_number": "206"
  },
  "439": {
    "content": "Wendy borrows 20,000 based on an annual effective interest rate of 8% and agrees to repay the loan with level end -of-year payments for 40 years.  Immediately after the 20\nth payment, Wendy \nrepays the remaining balance by taking out a new loan with an annual effective interest rate of 6% and level annual end-of-year payments for 20 years.  Calculate the sum of the 40 payments made by Wendy.  (A) 50,011 \n(B) 58,147 (C) 60,007 (D) 62,257 \n(E) 67,088 \n  \n  \n208 440. \nDavid purchases a level perpetuity -due, which provides annual payments of  1 and is priced to \nyield an annual effective rate of 6.25%.  Immediately before the second payment, the annual effective yield rate is 5.75%, and the price is estimated to be X  using the first-order modified approximation.  The actual price of the \nperpetuity at this time is Y . \n \nCalculate \n.XY\nY−  \n \n(A) –0.76% \n(B) –0.64% (C) –0.61% (D) –0.32% \n(E) –0.17% \n  441. At Jack’s death, his estate of 298,000 is to be divided between Charity A and Charity B.    Charity A will receive 198,000 and use it to purchase a perpetuity- due that makes a payment of  \nX every month.    Charity B will receive 100,000 and use it to purchase a perpetuity- due that makes a payment of  \nX every two months.  The payments of X for each charity are based on an annual effective interest rate of  i . \n Calculate i .    \n  (A) 21.5% \n(B) 24.0% (C) 24.5% (D) 26.8% \n(E) 27.4%  \n    \n209 442. \nAn asset earns an annual force of interest given by ( )1\n20ttδ=+, where t  is the time in years \nsince January 1, 2020.  The equivalent annual effective rate of interest for the year 2024 is i . \n \nCalculate i . \n (A) 4.00% \n(B) 4.08% (C) 4.17% (D) 4.35% \n(E) 5.00% \n  443. Kelly sets up a savings account and makes a deposit at the beginning of each month starting today.  The following information is known about the account:  \ni) Within each year, the amounts of monthly deposits are all equal. \nii) For any given year, the monthly deposits are 10% greater than the monthly \ndeposits of the previous year. \niii) The savings account earns an annual nominal interest rate of 2.4% compounded \nmonthly. \niv) The accumulated amount of the savings account at the end of year 10 is \n21,234.05. \nv) The amount of the monthly deposit in year 5 is  K . \n \nCalculate K . \n (A) 133.02 \n(B) 144.68 (C) 146.41 (D) 146.70 \n(E) 147.12 \n    \n210 444.  \nBond X, Bond Y, and Bond Z are each n -year bonds with face amount 1000.  All three bonds are \npriced to yield a nominal annual interest rate of 6.5% convertible semiannually.    Bond X provides annual coupons of R , Bond Y provides quarterly coupons of 20.00, and Bond Z \nprovides semiannual coupons of 32.50.    The price of Bond Y exceeds the price of Bond X by 401.50 and the price of Bond Y exceeds the price of Bond Z by 169.30.  Calculate R . \n (A) 41.79 \n(B) 42.03 (C) 43.78 (D) 44.25 \n(E) 45.52 \n  445. An investor owns two bonds, Bond 1 and Bond 2.  At today’s annual effective interest rate, the bonds have the following characteristics:     \n Bond 1   Bond 2  \nPresent Value  20,400  20,400  \nModified Duration  \n(in years)  11.735 13.101 \n If the annual effective interest rate decreases by 50 basis points today, the first- order Macaulay \napproximations of the present value for Bond 1 and Bond 2 are 21,635.83 and X , respectively.  \n Calculate X . \n (A) 21,503.55 \n(B) 21,596.97 (C) 21,736.30 (D) 21,779.69 \n(E) 21,784.47 \n    \n211 446. \nA special arithmetically increasing annuity -due will make 84 monthly payments.  It provides \npayments of 100 today, 100 one month from now, 105 two months from now, 105 three months from now, and so on until the 83\nrd and 84th payments of 305 each are made.  \n The present value of this annuity based on an annual nominal rate interest rate of 4.8% compounded monthly is P . \n Calculate P . \n (A)  13,950 \n(B)  13,978 (C)  14,008 (D)  14,062 \n(E)  14,117 \n  447. A perpetuity- immediate with level annual payments of  k has a Macaulay duration of 32.25 years \nbased on an annual effective interest rate of  i.  At the same annual effective interest rate, a  \nperpetuity-due with level annual payments of 1.02 k has a modified duration of X years . \n Calculate X . \n (A)  30.28 \n(B)  30.89 (C)  31.25 (D)  31.88 \n(E)  32.22 \n  448. A twelve -year 2500 face amount bond has an annual coupon rate of 4.84% paid quarterly and is \nredeemable for C .  The book values of the bond following the 4\nth and 19th coupons are 2092.88 \nand 2316.30, respectively.  Calculate the amount for accumulation of discount in the last coupon.  (A)   7.77 \n(B) 13.10 (C) 22.97 (D) 30.91 \n(E) 31.55 \n    \n212 449. \nA 30 -year 1000 face amount bond has an annual coupon rate of 7% paid  semiannually for the \nfirst 15 years, and an annual coupon rate of 9% paid semiannually for the last 15 years.  The \nbond is purchased to yield an annual nominal interest rate of 8% convertible semiannually.  At the time the 20\nth coupon is paid, the bond has an annual nominal yield rate of 6% convertible \nsemiannually.  Calculate the bond’s book value immediately after the 20\nth coupon is paid. \n (A)   901 \n(B)   940 (C) 1018 (D) 1261",
    "page_number": null
  },
  "450": {
    "content": "An electric company faces liabilities with present values 24,000 and 1,000, due 7.5 years from now and 20 years from now, respectively.  \n The company will purchase an n- year zero -coupon bond and a 2n- year zero -coupon bond.  \n Determine which of the following expressions describes the set of all values of n for which the company can achieve Redington immunization.  (A) \n48n≤≤  \n(B) 57n<<  \n(C) 5 or 7nn= =  \n(D) 0 5 or 7nn<< >  \n(E) 45  o r  78nn≤< <≤  \n    \n213 451. \nPaul makes level deposits of 1000 into a fund at the beginning of each quarter for five years.  The first deposit occurs at t  = 0, where t  is in years. \n Starting at t = 5, the amount of each quarterly deposit is 2% greater than the preceding deposit.  The last such deposit occurs at t = 19.75.  Calculate the accumulated value of Paul’s deposits at t  = 20 based on an annual nominal interest \nrate of 5% compounded quarterly.  (A) 124,847 \n(B) 152,717 (C) 184,484 (D) 206,608 \n(E) 209,778 \n  452. An investment project involves an outlay of 30 at time 0 and 40 at time 1, where time is measured in years.  In return the investor will receive 60 at time 2 and 90 at time\n, where \n . \n Determine which one of the following statements about the annual effective yield rate is true.  (A) There is a unique yield rate, which is higher than 50%.  \n(B) There is a unique yield rate, which is lower than 50%. (C) There are multiple yield rates, but all are higher than 50%.   (D) There are multiple yield rates, but all are lower than 50%. \n(E) There are multiple yield rates with at least one lower than 50% and at least one higher than 50%. \n  453. Kelly purchases a 25 -year annual coupon bond for 20,000 with an annual effective yield rate of  i.  \nThe amount for the accumulation of discount in the first coupon is 50.    \nThe bond's book value is 20,491.51 just after the \nth8 coupon payment and 21,263.74 just after \nthe th16 coupon payment. \n \nCalculate the bond's redemption value.  (A) 22,135 \n(B) 22,170 (C) 22,234 (D) 22,671 \n(E) 23,660 \n  \n214 454. \nAn investor purchases a ten -year 5000 bond with annual coupons, bought to yield an annual \neffective rate of i .  \n The bond's book value is 4478 just after the eighth coupon payment and 4730 just after the ninth coupon payment.  Calculate i . \n (A) 0.0563 \n(B) 0.0567 (C) 0.0571 (D) 0.0690 \n(E) 0.0714 \n  455. Bond X, Bond Y, and Bond Z are each n -year bonds with face amount 1000.  All three bonds are \npriced to yield a nominal annual rate of 6.0% convertible quarterly.    Bond X pays annual coupons of R , Bond Y pays semiannual coupons of 34.00, and Bond Z pays \nquarterly coupons of 15.00.  The price of Bond Y exceeds the prices of Bond X and Bond Z by 138.88 and 73.78, respectively.  \n Calculate R . \n (A) 52.05 \n(B) 52.23 (C) 53.20 (D) 53.92 \n(E) 54.60 \n   \n215 456. \nA 20 -year bond has an annual coupon rate of 3% paid semiannually.  The bond is priced using an \nannual nominal yield rate of 2% convertible semiannually.  The cumulative amount of premium amortization exceeds 50% of the premium at purchase, for the first time, immediately after the \nthn coupon is paid. \n Calculate n.  (A) 18 \n(B) 19 (C) 20 (D) 21",
    "page_number": null
  },
  "457": {
    "content": "An n-year 100 face amount bond has an annual coupon rate of r  paid semiannually.  The price of \nthe bond is 91.8243 based on an annual yield rate of 4% compounded semiannually.   The book value of the bond immediately after the n\nth coupon payment is 95.5087. \n Calculate n.  (A)   5 \n(B) 10 (C) 15 (D) 20",
    "page_number": null
  }
}